
// Insert all the icons from the json file by iconClass
function insertIcons(){
    $(".iconHolderWrapper").empty();
    for (const iconKey in icons) {
        if (Object.hasOwnProperty.call(icons, iconKey)) {
            const icon = icons[iconKey];
            $(`i.hsh.${icon.iconClass}`).html(icon.svg);
        }
    }
}

// I could not fetch my icon array because of github pages. So i had to create a json file with all the icons.
var icons = {
    "hsh-arrow-left": {
        "keyWords": {
            "HU": [
                "nyíl",
                "balra",
                "irány"
            ],
            "EN": [
                "arrow",
                "left",
                "direction"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-arrow-left",
        "svg": "<svg  version=\"1.1\" id=\"arrow_x5F_left\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"arrow33\" style=\"fill:currentColor;\" d=\"M46.9,104.8l99.4,70.3c2.7,1.9,6.5,1.3,8.4-1.4c1.9-2.7,1.3-6.4-1.4-8.4L60.8,99.9 \tl92.4-65.2c2.7-1.9,3.4-5.7,1.4-8.4c-1.2-1.7-3-2.5-4.9-2.5c-1.2,0-2.4,0.4-3.5,1.1L46.9,95c-1.6,1.1-2.5,3-2.5,4.9 \tC44.4,101.9,45.3,103.7,46.9,104.8z\"></path> </svg>"
    },
    "hsh-arrow-up": {
        "keyWords": {
            "HU": [
                "nyíl",
                "fel",
                "irány"
            ],
            "EN": [
                "arrow",
                "up",
                "direction"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-arrow-up",
        "svg": "<svg  version=\"1.1\" id=\"arrow_x5F_up\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"arrow22\" style=\"fill:currentColor;\" d=\"M95.2,46.9L25,146.2c-1.9,2.7-1.3,6.5,1.4,8.4c2.7,1.9,6.4,1.3,8.4-1.4l65.4-92.4 \tl65.2,92.4c1.9,2.7,5.7,3.4,8.4,1.4c1.7-1.2,2.5-3,2.5-4.9c0-1.2-0.4-2.4-1.1-3.5L105,46.9c-1.1-1.6-3-2.5-4.9-2.5 \tC98.2,44.3,96.3,45.3,95.2,46.9z\"></path> </svg>"
    },
    "hsh-arrow-right": {
        "keyWords": {
            "HU": [
                "nyíl",
                "jobbra",
                "irány"
            ],
            "EN": [
                "arrow",
                "right",
                "direction"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-arrow-right",
        "svg": "<svg  version=\"1.1\" id=\"arrow_x5F_right\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"arrow11\" style=\"fill:currentColor;\" d=\"M153.2,95.2L53.8,24.9c-2.7-1.9-6.5-1.3-8.4,1.4c-1.9,2.7-1.3,6.4,1.4,8.4l92.4,65.4 \tl-92.4,65.2c-2.7,1.9-3.4,5.7-1.4,8.4c1.2,1.7,3,2.5,4.9,2.5c1.2,0,2.4-0.4,3.5-1.1l99.4-70.1c1.6-1.1,2.5-3,2.5-4.9 \tC155.7,98.1,154.8,96.3,153.2,95.2z\"></path> </svg>"
    },
    "hsh-arrow-down": {
        "keyWords": {
            "HU": [
                "nyíl",
                "le",
                "irány"
            ],
            "EN": [
                "arrow",
                "down",
                "direction"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-arrow-down",
        "svg": "<svg  version=\"1.1\" id=\"arrow_x5F_down\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"arrow44\" style=\"fill:currentColor;\" d=\"M104.9,153.1l70.3-99.4c1.9-2.7,1.3-6.5-1.4-8.4c-2.7-1.9-6.4-1.3-8.4,1.4L100,139.3 \tL34.8,46.9c-1.9-2.7-5.7-3.4-8.4-1.4c-1.7,1.2-2.5,3-2.5,4.9c0,1.2,0.4,2.4,1.1,3.5l70.1,99.4c1.1,1.6,3,2.5,4.9,2.5 \tC101.9,155.7,103.8,154.7,104.9,153.1z\"></path> </svg>"
    },
    "hsh-watering-head": {
        "keyWords": {
            "HU": [
                "locsoló",
                "öntöző",
                "fej"
            ],
            "EN": [
                "sprinkler",
                "watering",
                "head"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-watering-head",
        "svg": "<svg version='1.1' id='ontozo' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_ontozo'> \t<path style='fill:currentColor;' d='M143.5,72.8h-0.8V57.5c0-3.5-2.5-6.4-5.8-7c-0.5-1.7-1.1-4.3-1.1-7.8s0.5-6.2,1.1-7.8 \t\tc3.3-0.6,5.8-3.5,5.8-7V17c0-8.9-7.2-16.1-16.1-16.1H73.4c-8.9,0-16.1,7.2-16.1,16.1v10.9c0,3.9,3.2,7.1,7.1,7.1c0.1,0,0.3,0,0.4,0 \t\tc0.8,1.4,1.7,4,1.7,7.7s-0.9,6.3-1.7,7.7c-0.1,0-0.3,0-0.4,0c-3.9,0-7.1,3.2-7.1,7.1v15.3h-1.6c-7.2,0-13.1,5.9-13.1,13.1v38.8 \t\tc0,7.2,5.9,13,13.1,13h8.5V188c0,6.4,4.8,11.5,10.7,11.5h50.6c5.9,0,10.7-5.2,10.7-11.5v-50.3h7.3c7.2,0,13.1-5.8,13.1-13V85.8 \t\tC156.6,78.6,150.7,72.8,143.5,72.8z M73.4,15.2h53.2c1,0,1.8,0.8,1.8,1.8v4.9H71.6V17C71.6,16,72.4,15.2,73.4,15.2z M77.1,33.8 \t\th47.8c-0.6,2.8-1,5.8-1,8.9c0,3,0.3,6.1,1,8.9H77.1c0.8-2.7,1.2-5.7,1.2-8.9C78.4,39.5,77.9,36.5,77.1,33.8z M71.6,63.4h56.9v9.3 \t\tH71.6V63.4z M122,185.3H78.4v-47.6H122V185.3z M142.3,123.4h-6.1h-7.1H71.3h-7.1h-7.3V87h7.5h0.1h0.1h70.9h0.1h0.1h6.7v36.4H142.3z \t\t'/> \t<circle style='fill:currentColor;' cx='101.1' cy='42.7' r='5.9'/> </g> <g id='spriccen_x5F_water'> \t<circle style='fill:currentColor;' cx='179.9' cy='40.9' r='5.1'/> \t<circle style='fill:currentColor;' cx='179.9' cy='24.7' r='5.1'/> \t<circle style='fill:currentColor;' cx='179.9' cy='55.7' r='5.1'/> \t<circle style='fill:currentColor;' cx='165.6' cy='31.2' r='5.1'/> \t<circle style='fill:currentColor;' cx='194.9' cy='14.5' r='5.1'/> \t<circle style='fill:currentColor;' cx='194.9' cy='31.2' r='5.1'/> \t<circle style='fill:currentColor;' cx='194.3' cy='47.9' r='5.1'/> \t<circle style='fill:currentColor;' cx='194.3' cy='64.6' r='5.1'/> \t<circle style='fill:currentColor;' cx='165.6' cy='48.7' r='5.1'/> \t<circle style='fill:currentColor;' cx='151.5' cy='40.9' r='5.1'/> \t<circle style='fill:currentColor;' cx='20.3' cy='42.6' r='5.1'/> \t<circle style='fill:currentColor;' cx='20.3' cy='26.4' r='5.1'/> \t<circle style='fill:currentColor;' cx='20.3' cy='57.4' r='5.1'/> \t<circle style='fill:currentColor;' cx='34.6' cy='32.9' r='5.1'/> \t<circle style='fill:currentColor;' cx='5.3' cy='16.2' r='5.1'/> \t<circle style='fill:currentColor;' cx='5.3' cy='32.9' r='5.1'/> \t<circle style='fill:currentColor;' cx='5.9' cy='49.6' r='5.1'/> \t<circle style='fill:currentColor;' cx='5.9' cy='66.3' r='5.1'/> \t<circle style='fill:currentColor;' cx='34.6' cy='50.3' r='5.1'/> \t<circle style='fill:currentColor;' cx='48.6' cy='42.6' r='5.1'/> </g> </svg>"
    },
    "hsh-watering-system": {
        "keyWords": {
            "HU": [
                "öntöző rendszer",
                "rendszer"
            ],
            "EN": [
                "watering system",
                "system"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-watering-system",
        "svg": "<svg version='1.1' id='ontozo_x5F_rendszer' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' \t x='0px' y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='leaf_x5F_drops'> \t<path style='fill:currentColor;' d='M196.7,81.1c0,0-123.4,15.3-111.4,86.8c31.5-2,75.7-51,75.7-51c-6.7,35.8-82.6,82.5-82.6,82.5 \t\tS203.7,214.6,196.7,81.1z'/> \t<path style='fill:currentColor;' d='M27,112.5c0,0,29.5,32.6,50.5,34c8-47.7-74.3-57.9-74.3-57.9c-4.7,89.1,78.9,78.9,78.9,78.9 \t\tS31.5,136.3,27,112.5z'/> \t<path style='fill:currentColor;' d='M96.5,72.7c5.5,2,11-1.4,15.2-4.7c3.1-2.4,5.8-5.3,7.8-8.7c1.3-2.3,2.3-4.7,2.9-7.2 \t\tc5-20.5-12.6-43.9-16.4-48.7c-0.4-0.6-0.9-1.2-1.5-1.7c-3-2.5-7.5-2.1-10,1c-2.3,2.8-22.2,27.7-16.9,49.2 \t\tC79.9,61.1,87.6,69.4,96.5,72.7z M91.3,42.2c0.7-6.3,3.2-12.4,6-18c0.8-1.7,1.8-3.3,2.7-4.9c3.6,5.9,6.6,12.4,8.2,19.1 \t\tc0.5,2.3,0.9,4.8,0.8,7.2c-0.1,1.1-0.2,2.1-0.4,3c-0.9,3.6-3.4,8.2-7.1,9.6c-2.4,0.9-4.7-0.8-6.2-2.6c-1.7-2-3-4.3-3.7-6.9 \t\tC91,46.6,91.1,44.4,91.3,42.2z'/> \t<path style='fill:currentColor;' d='M148,81.7c3.4,1.3,6.8-0.9,9.5-2.9c1.9-1.5,3.6-3.3,4.8-5.4c0.8-1.4,1.4-2.9,1.8-4.5 \t\tc3.1-12.7-7.8-27.2-10.2-30.2c-0.2-0.4-0.6-0.8-0.9-1.1c-1.9-1.6-4.7-1.3-6.2,0.6c-1.4,1.7-13.8,17.2-10.5,30.6 \t\tC137.7,74.5,142.5,79.7,148,81.7z M144.8,62.9c0.5-3.9,2-7.7,3.8-11.2c0.5-1,1.1-2,1.7-3c2.2,3.7,4.1,7.7,5.1,11.9 \t\tc0.3,1.5,0.6,3,0.5,4.5c-0.1,0.6-0.2,1.2-0.4,1.7c-0.6,2.2-2.1,5.1-4.4,6c-1.5,0.6-2.9-0.5-3.8-1.6c-1.1-1.2-1.9-2.7-2.3-4.3 \t\tC144.6,65.6,144.7,64.2,144.8,62.9z'/> </g> </svg>"
    },
    "hsh-attic-up": {
        "keyWords": {
            "HU": [
                "padlás",
                "tetőtér"
            ],
            "EN": [
                "attic"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-attic-up",
        "svg": "<svg version='1.1' id='padlasfeljaro' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='nyil' style='fill:currentColor;' d='M178,102.3L158.8,83c-1.2-1.2-2.8-1.8-4.4-1.7c-1.6,0-3.2,0.6-4.4,1.7l-19.3,19.3 \tc-2.3,2.3-2.3,6.1,0,8.5c2.3,2.3,6.1,2.3,8.5,0l9-9l0,33.3c0,3.3,2.7,6,6,6c0,0,0,0,0,0c0.1,0,0.1,0,0.2,0c0.1,0,0.1,0,0.2,0 \tc0,0,0,0,0,0c3.3,0,6-2.7,6-6l0-33.3l9,9c2.3,2.3,6.1,2.3,8.5,0C180.4,108.5,180.4,104.7,178,102.3z'/> <path id='letra' style='fill:currentColor;' d='M193.3,0.7H6.7c-3.3,0-6,2.7-6,6v186.7c0,3.3,2.7,6,6,6h186.7c3.3,0,6-2.7,6-6V6.7 \tC199.3,3.4,196.6,0.7,193.3,0.7z M108.5,109H49.7V85h58.8V109z M49.7,121h58.8v23.4H49.7V121z M108.5,50.2V73H49.7V50.2H108.5z \t M12.7,187.3V21.7l25,25v139.1c0,0.5,0.1,1,0.2,1.5H12.7z M49.5,187.3c0.1-0.5,0.2-1,0.2-1.5v-29.4h58.8v29.3c0,0.6,0.1,1.1,0.2,1.6 \tH49.5z M187.3,187.3h-67.1c0.1-0.5,0.2-1,0.2-1.6V46.3l22.2-27.7c1.4-1.7,1.7-4,0.9-6h43.7V187.3z'/> </svg>"
    },
    "hsh-cellar": {
        "keyWords": {
            "HU": [
                "pince",
                "kamra"
            ],
            "EN": [
                "basement",
                "cellar"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-cellar",
        "svg": "<svg version='1.1' id='pince' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='arrow' style='fill:currentColor;' d='M175.8,96.7l0-20.7c0-3.3-2.7-6-6-6c0,0,0,0,0,0c-3.3,0-6,2.7-6,6l0,6.2l-15.3-15.4 \tc-2.3-2.3-6.1-2.4-8.5,0c0,0-0.1,0.1-0.1,0.1c0,0-0.1,0-0.1,0.1c-2.3,2.3-2.4,6.1,0,8.5l15.4,15.4l-6.2,0c0,0,0,0,0,0 \tc-3.3,0-6,2.7-6,6c0,3.3,2.7,6,6,6l20.6,0c0,0,0,0,0,0c1.7,0,3.2-0.7,4.3-1.9C175.1,99.9,175.8,98.3,175.8,96.7z'/> <g id='stairs'> \t<path style='fill:currentColor;' d='M149.4,128h-41l-0.1-41.3c0-3.3-2.7-6-6-6l-41.2-0.3V39.5c0-3.3-2.7-6-6-6H8c-3.3,0-6,2.7-6,6v141.8 \t\tc0,1.6,0.6,3.1,1.8,4.2c1.1,1.1,2.7,1.8,4.2,1.8c0,0,0,0,0,0l141.4-0.1c3.3,0,6-2.7,6-6V134C155.4,130.7,152.7,128,149.4,128z \t\t M143.4,175.2L14,175.3V45.5h35.2v40.8c0,3.3,2.7,6,6,6l41.2,0.3l0.1,41.3c0,3.3,2.7,6,6,6h41V175.2z'/> \t<path style='fill:currentColor;' d='M193.6,12.7H6.4c-3.3,0-6,2.7-6,6s2.7,6,6,6h187.2c3.3,0,6-2.7,6-6S196.9,12.7,193.6,12.7z'/> </g> </svg>"
    },
    "hsh-cellar-house": {
        "keyWords": {
            "HU": [
                "pince",
                "kamra"
            ],
            "EN": [
                "basement",
                "cellar"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-cellar-house",
        "svg": "<svg version='1.1' id='pince2' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='house_x5F_shape' style='fill:currentColor;' d='M182.9,52.7L103.3,1.2c-2-1.3-4.5-1.3-6.5,0L17.1,52.7 \tc-2.2,1.4-3.2,4.2-2.5,6.7c0.8,2.6,3.1,4.3,5.8,4.3l17.3,0v78.9c0,0,0,0,0,0v51c0,3.3,2.7,6,6,6h112.5c3.3,0,6-2.7,6-6v-51v-79 \tl17.4,0c2.7,0,5-1.8,5.8-4.3C186.1,56.9,185.1,54.2,182.9,52.7z M49.7,148.7h11.6v10.2c0,2.8,2.2,5,5,5H78v11.3c0,2.8,2.2,5,5,5 \th13.7v7.5H49.7V148.7z M150.2,187.7h-43.6v-12.5c0-2.8-2.2-5-5-5H88v-11.3c0-2.8-2.2-5-5-5H71.3v-11.2c0-1.1-0.4-2.2-1-3 \tc-1-1.8-3-3-5.2-3H49.7V57.8c0-3.3-2.7-6-6-6c0,0,0,0,0,0l-3,0L100,13.4l59.3,38.4l-3.1,0c0,0,0,0,0,0c0,0,0,0,0,0h0c0,0,0,0,0,0 \tc-0.2,0-0.4,0-0.6,0c-3,0.3-5.4,2.9-5.4,6c0,0,0,0.1,0,0.1v78.8H95.7c-3.3,0-6,2.7-6,6s2.7,6,6,6h54.6V187.7z'/> </svg>"
    },
    "hsh-place": {
        "keyWords": {
            "HU": [
                "helység"
            ],
            "EN": [
                "place"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-place",
        "svg": "<svg version='1.1' id='place' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='frame' style='fill:currentColor;' d='M99.6,0L99.6,0H0.1v99.3C0,99.6,0,99.9,0,100.3s0,0.7,0.1,1v99.2h100l0,0H200V0H99.6z \t M187.9,94.2h-82l-0.2-82.1h82.2V94.2z M93.5,12.1l0.2,82.1H12.2V12.1H93.5z M12.2,106.3h81.6l0.2,82H12.2V106.3z M106.2,188.4 \tl-0.2-82h81.9v82H106.2z'/> <rect id='square' x='21.4' y='21' style='fill:currentColor;' width='63.9' height='64.1'/> </svg>"
    },
    "hsh-power-off": {
        "keyWords": {
            "HU": [
                "kikapcsolva"
            ],
            "EN": [
                "power"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-power-off",
        "svg": "<svg id='powerbutton' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 184.05 198.71'><title>powerbutton</title><g id='pb_elem'><path d='M141.11,24.5a6,6,0,0,0-5.37,10.74A80,80,0,1,1,20,106.84,80.52,80.52,0,0,1,65.14,34.79,6,6,0,0,0,59.91,24a92,92,0,1,0,81.2.51Z' transform='translate(-7.95 -0.16)' style='fill:currentColor'/><path d='M100.1,90.91h0a6,6,0,0,0,6-6V6.16a6,6,0,0,0-6-6h0a6,6,0,0,0-6,6V84.91A6,6,0,0,0,100.1,90.91Z' transform='translate(-7.95 -0.16)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-power-on": {
        "keyWords": {
            "HU": [
                "bekapcsolva"
            ],
            "EN": [
                "power"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-power-on",
        "svg": "<svg  version=\"1.1\" id=\"round\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"shape_x5F_round\" style=\"fill:currentColor;\" d=\"M100.7,12.8c48.1,0,87.3,39.1,87.3,87.3s-39.1,87.3-87.3,87.3 \tS13.5,148.1,13.5,100S52.6,12.8,100.7,12.8 M100.7,0.8C45.9,0.8,1.5,45.2,1.5,100s44.4,99.3,99.3,99.3S200,154.8,200,100 \tS155.5,0.8,100.7,0.8L100.7,0.8z\"></path> </svg>"
    },
    "hsh-pump": {
        "keyWords": {
            "HU": [
                "pumpa",
                "motor"
            ],
            "EN": [
                "pump",
                "motor"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-pump",
        "svg": "<svg version='1.1' id='pump' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='boudy_x5F_pump' style='fill:currentColor;' d='M155.4,5.7L140,21L125.5,6.5L116,6.6l-13.7,13.7c-6.9,0.5-13.7,1.8-20.4,4 \tc-1.6-2.3-3.4-4.5-5.4-6.5C64.4,5.7,48.2,2.9,39.7,11.4L11.2,40c-4.4,4.5-6,11.3-4.2,18.8c1.6,6.3,5.4,12.7,10.7,18.1 \tc2,2,4.2,3.8,6.5,5.4c-2.2,6.6-3.5,13.5-3.9,20.4L6.6,116.3l-0.1,9.5l14.1,14l-15,15.1c-4.2,4.2-4.4,10.9-0.4,14.9L29,193.6 \tc5.6,5.6,15,5.3,21-0.7L61.9,181l14.9,15l9.5-0.2l14.2-14.2c20.5-1.6,40-10.8,55.1-26c15.2-15.2,24.3-34.7,25.8-55.2l14.2-14.2 \tl0.1-9.5l-14.6-14.6L193,50.2c6-6,6.3-15.4,0.7-20.9l-24-24C165.8,1.4,159.4,1.6,155.4,5.7z M52.4,171.6l-11.9,11.9 \tc-0.7,0.7-1.6,0.7-2,0.4l-21.7-21.7l13-13.1L52.4,171.6z M20,55.2c-0.6-2.7-0.5-4.9,0.5-5.9l28.6-28.6c2-2,10.2-0.9,17.9,6.8 \tc0.7,0.7,1.4,1.5,2.1,2.3c-8.4,4.3-16,9.9-22.8,16.7S33.9,61,29.7,69.4c-0.8-0.6-1.6-1.3-2.3-2C23.6,63.6,21,59.2,20,55.2z \t M181.6,81.7L170.3,93c-0.2,0.2-0.5,0.5-0.7,0.8l-0.1,0.1c-0.2,0.3-0.4,0.7-0.6,1c0,0,0,0.1-0.1,0.1c-0.2,0.4-0.3,0.7-0.4,1.1v0.1 \tc-0.1,0.4-0.2,0.8-0.2,1.2v0.1c-0.8,18-8.6,35.4-22,48.8s-30.7,21.2-48.7,22.1h-0.1c-0.4,0-0.8,0.1-1.2,0.2c-0.1,0-0.1,0-0.2,0 \tc-0.4,0.1-0.7,0.2-1.1,0.4c-0.1,0-0.1,0-0.2,0.1c-0.3,0.2-0.7,0.4-1,0.6l-0.1,0.1c-0.3,0.2-0.5,0.4-0.8,0.7l-11.2,11.3l-10.4-10.4 \tL62,162l-22.5-22.5l-9.3-9.3l-9.4-9.4L31.5,110c0.3-0.3,0.5-0.5,0.7-0.8l0.1-0.1c0.2-0.3,0.4-0.7,0.6-1c0,0,0-0.1,0.1-0.1 \tc0.2-0.4,0.3-0.7,0.4-1.1c0-0.1,0-0.1,0-0.2c0.1-0.4,0.1-0.8,0.2-1.2c0,0,0,0,0-0.1c0.3-8.2,2-16.2,5.1-24c3.8-9.6,9.5-18.2,17-25.7 \tc7.4-7.5,16.1-13.2,25.6-17c7.7-3.1,15.8-4.8,24-5.1c0,0,0,0,0.1,0c0.4,0,0.8-0.1,1.2-0.2h0.1c0.4-0.1,0.7-0.2,1.1-0.4 \tc0,0,0.1,0,0.1-0.1c0.4-0.2,0.7-0.3,1-0.6c0,0,0.1,0,0.1-0.1c0.3-0.2,0.6-0.5,0.9-0.8l0,0l0,0l0,0l10.8-10.8L181.6,81.7z M184.2,39 \tc0.4,0.4,0.3,1.3-0.4,2l-11.9,11.9l-22.5-22.5l13-13.1L184.2,39z'/> <g id='rotating_x5F_element'> \t<g> \t\t<path style='fill:currentColor;' d='M119.6,81.8c-9.5-9.5-24.9-9.9-35.4-1.2c-0.7,0.6-1.3,1.2-2,1.8c-0.6,0.6-1.2,1.3-1.8,2 \t\t\tc-8.6,10.5-8.3,25.9,1.3,35.4s24.9,9.9,35.4,1.2c0.7-0.6,1.3-1.2,2-1.8c0.6-0.6,1.2-1.3,1.8-2C129.5,106.7,129.1,91.3,119.6,81.8z \t\t\t M109.7,109.9c-0.6,0.7-1.3,1.2-2.1,1.7c-5.1,3.4-12,3-16.3-1.4c-4.4-4.4-4.8-11.2-1.4-16.3c0.5-0.7,1.1-1.4,1.7-2.1 \t\t\ts1.3-1.2,2.1-1.7c5.1-3.4,12-3,16.4,1.4s4.8,11.2,1.4,16.3C110.9,108.5,110.3,109.2,109.7,109.9z'/> \t</g> \t<g> \t\t<path style='fill:currentColor;' d='M76,125.4c-12.6-12.6-12.9-32.9-1.2-46.6l-9.4-9.3c-17,19-16.8,47.9,0.9,65.6s46.6,17.8,65.6,0.8 \t\t\tl-9.4-9.3C108.9,138.3,88.5,138,76,125.4z'/> \t</g> \t<g> \t\t<path style='fill:currentColor;' d='M69.2,65.7l9.4,9.3c13.7-11.9,34.1-11.6,46.7,1s12.9,33,1.1,46.7l9.4,9.3c17.1-19,17-48-0.8-65.7 \t\t\tC117.1,48.6,88.2,48.5,69.2,65.7z'/> \t</g> </g> </svg>"
    },
    "hsh-rain": {
        "keyWords": {
            "HU": [
                "eső"
            ],
            "EN": [
                "rain"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-rain",
        "svg": "<svg version='1.1' id='rain' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='lines'> \t<path style='fill:currentColor;' d='M182,125.1c-0.5,0.6-1.1,1.2-1.7,1.9c-7.2,8.2-22.1,25.2-80.8-3.2c-71.4-34.6-95.1,0.6-96.1,2.1 \t\tc-1.8,2.8-1,6.5,1.8,8.3s6.5,1,8.3-1.8c0.2-0.3,18.8-27.8,80.7,2.2c26,12.6,44.8,16.9,58.7,16.9c21.8,0,31.2-10.7,36.3-16.6 \t\tc0.5-0.6,1-1.1,1.4-1.6c2.3-2.4,2.2-6.2-0.2-8.5C188.1,122.6,184.3,122.7,182,125.1z'/> \t<path style='fill:currentColor;' d='M5.3,104.9c2.8,1.8,6.5,1,8.3-1.8c0.2-0.3,18.8-27.8,80.7,2.2c23,11.2,42.3,16.7,58.1,16.7 \t\tc11.4,0,21-2.9,29-8.7c7.2-5.2,18.6-17.8,15.6-31.7c-1.8-8.3-8.2-15.4-16.3-18.1c-6.4-2.2-15.8-2.2-22.9,4 \t\tc-8.6,7.6-7.5,18.8-7.3,20c0.4,3.3,3.4,5.6,6.7,5.2s5.6-3.4,5.2-6.7c0-0.2-0.7-5.9,3.4-9.5c4.2-3.7,10-2,11.1-1.6 \t\tc4.7,1.6,7.7,5.9,8.4,9.2c1.6,7.3-5.9,15.9-10.9,19.5c-15.1,11-39.5,8-74.8-9.1C28.2,59.9,4.5,95.1,3.5,96.6 \t\tC1.7,99.4,2.5,103.1,5.3,104.9z'/> \t<path style='fill:currentColor;' d='M5.3,74c2.8,1.8,6.5,1,8.3-1.8c0.2-0.3,18.8-27.8,80.7,2.2c6.8,3.3,13.3,6.1,19.3,8.4 \t\tc0.7,0.3,1.4,0.4,2.1,0.4c2.4,0,4.7-1.5,5.6-3.9c1.2-3.1-0.4-6.6-3.5-7.7c-5.7-2.2-11.9-4.9-18.4-8C28.2,29,4.5,64.2,3.5,65.7 \t\tC1.7,68.5,2.5,72.2,5.3,74z'/> </g> </svg>"
    },
    "hsh-remove-filled": {
        "keyWords": {
            "HU": [
                "elvesz",
                "minusz"
            ],
            "EN": [
                "remove",
                "minus"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-remove-filled",
        "svg": "<svg version='1.1' id='remove' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='remove_x5F_shape' style='fill:currentColor;' d='M142.4,22.4H58.5c-19.9,0-36,16.2-36,36v83.9c0,19.9,16.2,36,36,36h83.9 \tc19.9,0,36-16.2,36-36V58.4C178.4,38.5,162.3,22.4,142.4,22.4z M150.1,107.6H50.2c-3.9,0-7-3.1-7-7c0-3.9,3.1-7,7-7h99.9 \tc3.9,0,7,3.1,7,7C157.1,104.5,154,107.6,150.1,107.6z'/> </svg>"
    },
    "hsh-remove": {
        "keyWords": {
            "HU": [
                "elvesz",
                "minusz"
            ],
            "EN": [
                "remove",
                "minus"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-remove",
        "svg": "<svg version='1.1' id='remove_x5F_line' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='remove_x5F_line_1_'> \t<path style='fill:currentColor;' d='M143.8,18.5H56.2c-20.8,0-37.7,16.9-37.7,37.7v87.6c0,20.8,16.9,37.7,37.7,37.7h87.6 \t\tc20.8,0,37.7-16.9,37.7-37.7V56.2C181.5,35.4,164.6,18.5,143.8,18.5z M166.8,143.8c0,12.7-10.3,23-23,23H56.2 \t\tc-12.7,0-23-10.3-23-23V56.2c0-12.7,10.3-23,23-23h87.6c12.7,0,23,10.3,23,23V143.8z'/> \t<path style='fill:currentColor;' d='M159.2,100.3c0,4-3.3,7.3-7.3,7.3H47.5c-4,0-7.3-3.3-7.3-7.3c0-4,3.3-7.3,7.3-7.3h104.3 \t\tC155.9,93,159.2,96.2,159.2,100.3z'/> </g> </svg>"
    },
    "hsh-loading": {
        "keyWords": {
            "HU": [
                "tölt"
            ],
            "EN": [
                "loading"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-loading",
        "svg": "<svg version='1.1' id='loading' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='dot1' style='fill:currentColor;' d='M61.9,89.3c-5.8,0-10.6,4.7-10.6,10.6s4.7,10.6,10.6,10.6c5.8,0,10.6-4.7,10.6-10.6 \tS67.7,89.3,61.9,89.3z'/> <path id='dot3' style='fill:currentColor;' d='M136.4,89.3c-5.8,0-10.6,4.7-10.6,10.6c0,5.8,4.7,10.6,10.6,10.6c5.8,0,10.6-4.7,10.6-10.6 \tC147,94,142.3,89.3,136.4,89.3z'/> <g id='arrow'> \t<path style='fill:currentColor;' d='M183.5,93.9C183.5,93.9,183.5,93.9,183.5,93.9c-3.3,0-6,2.7-6,6c0,43-35,78-78,78c-43,0-78-35-78-78 \t\tc0-40.8,31.6-74.5,71.7-77.7v4.2c0,3.3,2.7,6,6,6c3.3,0,6-2.7,6-6V15.9c0,0,0-0.1,0-0.1c0,0,0,0,0-0.1V6.3c0-3.3-2.7-6-6-6 \t\tc-3.3,0-6,2.7-6,6v3.8C46.5,13.3,9.5,52.4,9.5,99.8c0,49.6,40.4,90,90,90c49.6,0,90-40.4,90-90C189.5,96.6,186.8,93.9,183.5,93.9z' \t\t/> \t \t\t<ellipse transform='matrix(0.7071 -0.7071 0.7071 0.7071 22.6144 86.896)' style='fill:currentColor;' cx='116.2' cy='16.1' rx='6.8' ry='6.8'/> </g> <path id='dot2' style='fill:currentColor;' d='M99.6,89C93.8,89,89,93.8,89,99.6c0,5.8,4.7,10.6,10.6,10.6c5.8,0,10.6-4.7,10.6-10.6 \tC110.2,93.8,105.4,89,99.6,89z'/> </svg>"
    },
    "hsh-dormer": {
        "keyWords": {
            "HU": [
                "tetőablak",
                "ablak"
            ],
            "EN": [
                "dormer",
                "skylight"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-dormer",
        "svg": "<svg version='1.1' id='roof_x5F_window' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_roof_x5F_window'> \t<path style='fill:currentColor;' d='M198.8,190.8l-44.9-89.9l-0.2-0.4l2.8-4l41.8-59.1c1.3-1.8,1.5-4.2,0.4-6.2c-1-2-3.1-3.2-5.3-3.2 \t\th-76.1H104h-4c-2,0-3.8,0.9-4.9,2.5L55.6,86.3l6.2,12.1L103.1,40h3.1l0,0h3.8h13.4h0.2l0,0h58.3l-31.5,44.4l-2.8,4l-16.8-33.7 \t\th-13.4l22.4,44.8l-2.5,3.5L97,160h-3.6l6.1,12h0.6c2,0,3.8-0.9,4.9-2.5l38.4-54.3l2.5-3.6l37.9,75.9h-80.4L95.7,172l-6-12l0,0 \t\tl-29.5-59.3l-6.1-12.2l-37.9-76h80.1L100,20h13.4l-8.1-16.1c-1-2-3.1-3.3-5.4-3.3H6.5c-2.1,0-4,1.1-5.1,2.8c-1.1,1.8-1.2,4-0.3,5.8 \t\tl45,90.4l6.1,12.2l24,48.2l6,12l12,24.2c1,2,3.1,3.3,5.4,3.3h93.8c2.1,0,4-1.1,5.1-2.8C199.7,194.8,199.8,192.6,198.8,190.8z'/> \t<path style='fill:currentColor;' d='M18.1,160l29-41L41,106.8L1.6,162.6c-1.3,1.8-1.5,4.2-0.4,6.2c1,2,3.1,3.2,5.3,3.2h66.9l-6-12H18.1z \t\t'/> \t<path style='fill:currentColor;' d='M157.5,50.2c1.7,0,3-1.3,3-3s-1.3-3-3-3h-28.7c-1.7,0-3,1.3-3,3s1.3,3,3,3H157.5z'/> </g> </svg>"
    },
    "hsh-download": {
        "keyWords": {
            "HU": [
                "letöltés",
                "letölt"
            ],
            "EN": [
                "downloading",
                "download"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-download",
        "svg": "<svg id='save1' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 200.08 199.96'><title>save1</title><path id='karmento' d='M194.05,110.5a6,6,0,0,0-6,6v56.34c0,8.52-9,15.45-19.94,15.45H31.9c-11,0-19.93-6.93-19.93-15.45V116.5a6,6,0,0,0-12,0v56.34C0,188,14.29,200.29,31.9,200.29H168.11c17.61,0,31.94-12.31,31.94-27.45V116.5A6,6,0,0,0,194.05,110.5Z' transform='translate(0.03 -0.33)' style='fill:currentColor'/><path id='arrow' d='M136.47,80.23a6,6,0,0,0-8.49,0L106.08,102l0-79.57,0-16.15a6,6,0,0,0-6-6h0a6,6,0,0,0-6,6l0,16.14,0,79.52L72.27,80.19a6,6,0,0,0-8.48,8.49l32,32.06.14.11a5.56,5.56,0,0,0,.65.53l.24.17a6.12,6.12,0,0,0,.91.49h0s0,0,.08,0a5.63,5.63,0,0,0,1,.31h0a6,6,0,0,0,1.12.11h0a6,6,0,0,0,1.12-.11h0a6.56,6.56,0,0,0,1.07-.31l0,0a5.33,5.33,0,0,0,1-.54h0a6,6,0,0,0,.93-.75l32.15-32A6,6,0,0,0,136.47,80.23Z' transform='translate(0.03 -0.33)' style='fill:currentColor'/></svg>"
    },
    "hsh-save": {
        "keyWords": {
            "HU": [
                "ment",
                "mentés"
            ],
            "EN": [
                "save",
                "saving"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-save",
        "svg": "<svg id='save2' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 199.65 199.65'><title>save2</title><path id='floppy' d='M186.26,0H13.15A13.28,13.28,0,0,0-.12,13.27V186.38a13.28,13.28,0,0,0,13.27,13.27H163a13.18,13.18,0,0,0,9.38-3.88l23.32-23.3a13.42,13.42,0,0,0,3.87-9.37V13.27A13.28,13.28,0,0,0,186.26,0ZM51.32,12H148V59.25a1.27,1.27,0,0,1-1.27,1.27H52.59a1.27,1.27,0,0,1-1.27-1.27Zm78.11,175.65H94V146.43h34.2a1.27,1.27,0,0,1,1.27,1.27Zm-45.47,0H69.08v-40a1.27,1.27,0,0,1,1.27-1.27H84ZM187.53,163.1a1.32,1.32,0,0,1-.37.9l-23.3,23.29a1.28,1.28,0,0,1-.9.36H141.43v-40a13.28,13.28,0,0,0-13.27-13.27H70.35A13.28,13.28,0,0,0,57.08,147.7v40H13.15a1.27,1.27,0,0,1-1.27-1.27V13.27A1.27,1.27,0,0,1,13.15,12H39.32V59.25A13.28,13.28,0,0,0,52.59,72.52h94.15A13.28,13.28,0,0,0,160,59.25V12h26.25a1.27,1.27,0,0,1,1.27,1.27Z' transform='translate(0.12)' style='fill:currentColor'/></svg>"
    },
    "hsh-search": {
        "keyWords": {
            "HU": [
                "keresés",
                "kereső"
            ],
            "EN": [
                "search",
                "searching"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-search",
        "svg": "<svg id='nagyito' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 199 198.9'><title>search</title><path id='shape_nagyito' d='M197.7,189.1l-58.9-58.8A78.58,78.58,0,0,0,79.1.6a78.65,78.65,0,1,0,51.3,138.3l58.9,58.8a5.92,5.92,0,0,0,4.2,1.8,5.76,5.76,0,0,0,4.2-1.8A6,6,0,0,0,197.7,189.1ZM12.5,79.3A66.54,66.54,0,1,1,79,146,66.71,66.71,0,0,1,12.5,79.3Z' transform='translate(-0.5 -0.6)' style='fill:currentColor'/></svg>"
    },
    "hsh-cloud-save": {
        "keyWords": {
            "HU": [
                "mentés",
                "felhő",
                "feltöltés"
            ],
            "EN": [
                "save",
                "cloud",
                "upload"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-cloud-save",
        "svg": "<svg id='save3' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 199.4 199.31'><title>save3</title><g id='cloud_arrow'><path d='M150.32,43.79C147.25,19.35,125.84.35,100,.35s-47.24,19-50.31,43.44C22.16,45.57.3,68,.3,95.31.3,123.79,24.05,147,53.24,147a6,6,0,1,0,0-12C30.67,135,12.3,117.17,12.3,95.31S30.67,55.66,53.24,55.66c.59,0,1.16,0,1.74,0h.47l.32,0,.28,0,.31,0,.29-.06.27-.07.32-.1.22-.08.33-.14.18-.08.35-.19.14-.08.35-.23.12-.09.33-.27.11-.1.3-.3.11-.12.27-.31.1-.14a3.78,3.78,0,0,0,.22-.33l.11-.16.18-.33.09-.2c0-.11.1-.21.15-.33s.05-.14.08-.22.07-.22.1-.33a2.17,2.17,0,0,0,.07-.24c0-.11.05-.22.07-.34s0-.17,0-.26,0-.22,0-.33a.68.68,0,0,0,0-.14v-.16s0-.11,0-.16c.06-20.61,17.42-37.38,38.7-37.38s38.63,16.77,38.69,37.38a.86.86,0,0,0,0,.16,1,1,0,0,0,0,.17s0,.09,0,.14,0,.21,0,.32a2.51,2.51,0,0,0,0,.27c0,.11,0,.22.07.33l.06.25c0,.11.07.22.11.33l.08.21.15.35c0,.06.05.12.08.17l.2.36.09.13a3,3,0,0,0,.25.37l.07.09c.1.13.2.25.31.37l.05.06c.12.13.25.25.38.37l0,0c.14.12.28.24.43.35h0a4.53,4.53,0,0,0,.46.3h0c.16.1.32.18.48.26l0,0,.47.19.09,0,.44.14.15,0,.39.07.22,0,.35,0h.76c.57,0,1.15,0,1.72,0,22.57,0,40.93,17.78,40.93,39.65S169.34,135,146.72,135l-48.95.44a6,6,0,0,0,0,12h.06l48.89-.44c29.19,0,52.93-23.17,52.93-51.65C199.7,68,177.85,45.57,150.32,43.79Z' transform='translate(-0.3 -0.35)' style='fill:currentColor'/><path d='M93.41,108.84a6,6,0,0,0,8.83,8.13l16-17.37.06-.09a6.06,6.06,0,0,0,.65-.86l.08-.16a5.65,5.65,0,0,0,.31-.6c0-.06,0-.13.07-.19a3.38,3.38,0,0,0,.11-.34,6,6,0,0,0,.19-.73,2.93,2.93,0,0,0,.05-.29,5.94,5.94,0,0,0,.06-1,.51.51,0,0,0,0-.13,5.55,5.55,0,0,0-.12-.9c0-.1-.05-.2-.08-.31a4.84,4.84,0,0,0-.25-.73,1.53,1.53,0,0,0-.11-.27,5.11,5.11,0,0,0-.52-.9l-.13-.17a5.81,5.81,0,0,0-.38-.46l-16-17.13a6,6,0,0,0-8.77,8.19l6.7,7.17-18.48-.14a15.75,15.75,0,0,0-11.19,4.56,15.6,15.6,0,0,0-4.65,11.15v88.41a6,6,0,1,0,12,0V105.24a3.72,3.72,0,0,1,3.72-3.71h0l18.44.14Z' transform='translate(-0.3 -0.35)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-shutter": {
        "keyWords": {
            "HU": [
                "redőny"
            ],
            "EN": [
                "shutter"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-shutter",
        "svg": "<svg version='1.1' id='shutter_x5F_groups' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shutter'> \t<path id='body_x5F_shutter' style='fill:currentColor;' d='M108.5,61.9c0-0.1,0-0.1,0-0.2V34.2c0-0.1,0-0.1,0-0.2s0-0.1,0-0.2V6.7 \t\tc0-3.3-2.7-6-6-6H9.1c-3.3,0-6,2.7-6,6v186.5c0,3.3,2.7,6,6,6h93.4c3.3,0,6-2.7,6-6V89.6c0-0.1,0-0.1,0-0.2s0-0.1,0-0.2V62.1 \t\tC108.5,62,108.5,62,108.5,61.9z M34.2,83.5h-19V67.9h19h62.3v15.5L34.2,83.5L34.2,83.5z M36.5,40h60v15.9H34.2h-19V40H36.5z \t\t M96.5,12.7V28h-60H15.1V12.7H96.5z M15.1,187.1V95.5h19h62.3v91.7L15.1,187.1L15.1,187.1z'/> </g> <g id='slider'> \t<g id='ellipse'> \t\t<path style='fill:currentColor;' d='M157,123.6c-2-1.1-4.4-1.8-6.9-1.8s-4.8,0.7-6.9,1.8c-4.4,2.4-7.3,7-7.3,12.4c0,5.3,3,10,7.3,12.4 \t\t\tc2,1.1,4.4,1.8,6.9,1.8s4.8-0.7,6.9-1.8c4.4-2.4,7.3-7,7.3-12.4S161.3,126,157,123.6z M150.1,141.6c-3.1,0-5.6-2.5-5.6-5.6 \t\t\ts2.5-5.6,5.6-5.6s5.6,2.5,5.6,5.6C155.7,139.1,153.2,141.6,150.1,141.6z'/> \t\t<path style='fill:currentColor;' d='M188.5,49.1c-2-1.1-4.4-1.8-6.9-1.8s-4.8,0.7-6.9,1.8c-4.4,2.4-7.3,7-7.3,12.4c0,5.3,3,10,7.3,12.4 \t\t\tc2,1.1,4.4,1.8,6.9,1.8s4.8-0.7,6.9-1.8c4.4-2.4,7.3-7,7.3-12.4S192.8,51.5,188.5,49.1z M181.6,67.1c-3.1,0-5.6-2.5-5.6-5.6 \t\t\ts2.5-5.6,5.6-5.6s5.6,2.5,5.6,5.6C187.2,64.5,184.7,67.1,181.6,67.1z'/> \t</g> \t<g id='lines'> \t\t<path style='fill:currentColor;' d='M150.1,15.1c-3.8,0-6.9,3.1-6.9,6.9v154.8c0,3.8,3.1,6.9,6.9,6.9s6.9-3.1,6.9-6.9V22 \t\t\tc0-1.9-0.8-3.6-2-4.9C153.7,15.9,152,15.1,150.1,15.1z M150.1,141.6c-3.1,0-5.6-2.5-5.6-5.6s2.5-5.6,5.6-5.6s5.6,2.5,5.6,5.6 \t\t\tC155.7,139.1,153.2,141.6,150.1,141.6z'/> \t\t<path style='fill:currentColor;' d='M181.6,13.8c-3.8,0-6.9,3.1-6.9,6.9v154.8c0,3.8,3.1,6.9,6.9,6.9c1.9,0,3.6-0.8,4.9-2 \t\t\tc1.2-1.2,2-2.9,2-4.9V20.7C188.5,16.9,185.4,13.8,181.6,13.8z M181.6,67.1c-3.1,0-5.6-2.5-5.6-5.6s2.5-5.6,5.6-5.6 \t\t\ts5.6,2.5,5.6,5.6C187.2,64.5,184.7,67.1,181.6,67.1z'/> \t</g> </g> </svg>"
    },
    "hsh-shutter-teach": {
        "keyWords": {
            "HU": [
                "redőny",
                "betanítás"
            ],
            "EN": [
                "shutter",
                "teach"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-shutter-teach",
        "svg": "<svg  version=\"1.1\" id=\"redonytanitas1\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <g id=\"shape_x5F_redonyt1\"> \t<path style=\"fill:currentColor;\" d=\"M152.8,34.2c0,0,0-0.1,0-0.1v-27c0-3.5-2.9-6.4-6.4-6.4H53.8c-3.5,0-6.4,2.9-6.4,6.4V192 \t\tc0,3.5,2.9,6.4,6.4,6.4h92.6c3.5,0,6.4-2.9,6.4-6.4V89.3c0,0,0-0.1,0-0.1c0,0,0-0.1,0-0.1V62c0,0,0-0.1,0-0.1s0-0.1,0-0.1V34.3 \t\tC152.8,34.3,152.8,34.2,152.8,34.2z M78.7,82.8H60.2V68.3h18.4H140v14.5H78.7z M81,40.6h59v14.9H78.7H60.2V40.6H81z M140,13.5v14.3 \t\tH81H60.2V13.5H140z M60.2,185.6v-90h18.4H140v90H60.2z\"></path> \t<path style=\"fill:currentColor;\" d=\"M25,7.1c0-3.5-2.9-6.4-6.4-6.4s-6.4,2.9-6.4,6.4v156.1H2L18.6,192l16.6-28.8H25V7.1z\"></path> \t<path style=\"fill:currentColor;\" d=\"M197.9,35.9L181.2,7.1l-16.6,28.8h10.2V192c0,3.5,2.9,6.4,6.4,6.4s6.4-2.9,6.4-6.4V35.9H197.9z\"></path> </g> </svg>"
    },
    "hsh-shutter-teach-up": {
        "keyWords": {
            "HU": [
                "redőny",
                "betanítás"
            ],
            "EN": [
                "shutter",
                "teach"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-shutter-teach-up",
        "svg": "<svg  version=\"1.1\" id=\"redonytanitas2\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"redony\" style=\"fill:currentColor;\" d=\"M110.6,62.7C110.6,62.7,110.6,62.6,110.6,62.7l0-27.4c0,0,0-0.1,0-0.1s0-0.1,0-0.1V8.3 \tc0-2.8-2.2-5-5-5H13.8c-2.8,0-5,2.2-5,5v183.3c0,2.8,2.2,5,5,5h91.8c2.8,0,5-2.2,5-5V89.8c0,0,0-0.1,0-0.1s0-0.1,0-0.1L110.6,62.7 \tC110.6,62.7,110.6,62.7,110.6,62.7z M38.4,84.7H18.8V67.7h19.6h62.2v17.1H38.4z M40.7,40.2h59.9v17.5H38.4H18.8V40.2H40.7z \t M100.6,13.3v16.9H40.7H18.8V13.3H100.6z M18.8,186.7V94.7h19.6h62.2v91.9H18.8z\"></path> <g id=\"skala\"> \t<path style=\"fill:currentColor;\" d=\"M184.6,22.5h-57.9c-5.5,0-10,4.5-10,10s4.5,10,10,10h57.9c5.5,0,10-4.5,10-10S190.2,22.5,184.6,22.5 \t\tz\"></path> \t<path style=\"fill:currentColor;\" d=\"M177.5,57.9l-21.6-0.3l-29.1,0c-5.5,0-10,4.5-10,10s4.5,10,10,10h28.9l21.6,0.3c0.1,0,0.1,0,0.2,0 \t\tc5.4,0,9.9-4.4,10-9.8C187.4,62.6,183,58,177.5,57.9z\"></path> \t<path style=\"fill:currentColor;\" d=\"M155.7,163.2l-29-0.1c0,0,0,0,0,0c-5.5,0-10,4.5-10,10c0,5.5,4.4,10,10,10l29,0.1c0,0,0,0,0,0 \t\tc5.5,0,10-4.5,10-10C165.7,167.7,161.2,163.2,155.7,163.2z\"></path> \t<path style=\"fill:currentColor;\" d=\"M163,128.3l-36.2-0.4c0,0-0.1,0-0.1,0c-5.5,0-9.9,4.4-10,9.9c-0.1,5.5,4.4,10,9.9,10.1l36.1,0.4 \t\tc0,0,0.1,0,0.1,0c5.5,0,9.9-4.4,10-9.9C172.9,132.9,168.5,128.3,163,128.3z\"></path> \t<path style=\"fill:currentColor;\" d=\"M170.2,92.8h-43.5c-5.5,0-10,4.5-10,10c0,5.5,4.5,10,10,10h43.5c5.5,0,10-4.5,10-10 \t\tC180.2,97.2,175.7,92.8,170.2,92.8z\"></path> </g> </svg>"
    },
    "hsh-shutter-teach-down": {
        "keyWords": {
            "HU": [
                "redőny",
                "betanítás"
            ],
            "EN": [
                "shutter",
                "teach"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-shutter-teach-down",
        "svg": "<svg  version=\"1.1\" id=\"redonytanitas3\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"redony2\" style=\"fill:currentColor;\" d=\"M110.6,62.7C110.6,62.7,110.6,62.6,110.6,62.7l0-27.4c0,0,0-0.1,0-0.1s0-0.1,0-0.1V8.3 \tc0-2.8-2.2-5-5-5H13.8c-2.8,0-5,2.2-5,5v183.3c0,2.8,2.2,5,5,5h91.8c2.8,0,5-2.2,5-5V89.8c0,0,0-0.1,0-0.1s0-0.1,0-0.1L110.6,62.7 \tC110.6,62.7,110.6,62.7,110.6,62.7z M38.4,84.7H18.8V67.7h19.6h62.2v17.1H38.4z M40.7,40.2h59.9v17.5H38.4H18.8V40.2H40.7z \t M100.6,13.3v16.9H40.7H18.8V13.3H100.6z M18.8,186.7V94.7h19.6h62.2v91.9H18.8z\"></path> <g id=\"skala2\"> \t<path style=\"fill:currentColor;\" d=\"M184.6,183.2h-57.9c-5.5,0-10-4.5-10-10s4.5-10,10-10h57.9c5.5,0,10,4.5,10,10 \t\tS190.2,183.2,184.6,183.2z\"></path> \t<path style=\"fill:currentColor;\" d=\"M177.5,147.7l-21.6,0.3l-29.1,0c-5.5,0-10-4.5-10-10s4.5-10,10-10h28.9l21.6-0.3c0.1,0,0.1,0,0.2,0 \t\tc5.4,0,9.9,4.4,10,9.8C187.4,143.1,183,147.6,177.5,147.7z\"></path> \t<path style=\"fill:currentColor;\" d=\"M155.7,42.5l-29,0.1c0,0,0,0,0,0c-5.5,0-10-4.5-10-10c0-5.5,4.4-10,10-10l29-0.1c0,0,0,0,0,0 \t\tc5.5,0,10,4.5,10,10C165.7,37.9,161.2,42.4,155.7,42.5z\"></path> \t<path style=\"fill:currentColor;\" d=\"M163,77.4l-36.2,0.4c0,0-0.1,0-0.1,0c-5.5,0-9.9-4.4-10-9.9c-0.1-5.5,4.4-10,9.9-10.1l36.1-0.4 \t\tc0,0,0.1,0,0.1,0c5.5,0,9.9,4.4,10,9.9C172.9,72.8,168.5,77.3,163,77.4z\"></path> \t<path style=\"fill:currentColor;\" d=\"M170.2,112.9h-43.5c-5.5,0-10-4.5-10-10c0-5.5,4.5-10,10-10h43.5c5.5,0,10,4.5,10,10 \t\tC180.2,108.4,175.7,112.9,170.2,112.9z\"></path> </g> </svg>"
    },
    "hsh-set": {
        "keyWords": {
            "HU": [
                "beállít"
            ],
            "EN": [
                "set"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-set",
        "svg": "<svg id='set' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 199.48 199.48'><title>set</title><g id='set_shape'><path d='M169.93.28H30A29.83,29.83,0,0,0,.25,30.07V170A29.83,29.83,0,0,0,30,199.76H169.93A29.83,29.83,0,0,0,199.73,170V30.07A29.83,29.83,0,0,0,169.93.28ZM187.73,170a17.82,17.82,0,0,1-17.8,17.79H30A17.81,17.81,0,0,1,12.25,170V30.07A17.81,17.81,0,0,1,30,12.28H169.93a17.82,17.82,0,0,1,17.8,17.79Z' transform='translate(-0.25 -0.28)' style='fill:currentColor'/><path d='M164.93,56.55a6,6,0,0,0-6,6v59.54H49l8.85-8.91a6,6,0,0,0-8.52-8.46l-18.26,18.4a6,6,0,0,0-1.59,8.36l.06.08a6.67,6.67,0,0,0,.53.64,2.31,2.31,0,0,0,.2.24l19.18,19A6,6,0,1,0,57.92,143L49,134.09h116a6,6,0,0,0,6-6V62.55A6,6,0,0,0,164.93,56.55Z' transform='translate(-0.25 -0.28)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-shutter-down": {
        "keyWords": {
            "HU": [
                "redőny lent"
            ],
            "EN": [
                "shutter closed"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-shutter-down",
        "svg": "<svg version='1.1' id='shutter_x5F_window_x5F_down' \t xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' viewBox='0 0 200 200' \t style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body_x5F_shutter_x5F_down' style='fill:currentColor;' d='M189.7,0.2H10.6c-5.5,0-10,4.5-10,10v179.6c0,5.5,4.5,10,10,10h179.1 \tc5.5,0,10-4.5,10-10V10.2C199.7,4.7,195.2,0.2,189.7,0.2z M187.7,52.4h-81.6v-8.8h81.6V52.4z M94.1,52.4H12.6v-8.8h81.5V52.4z \t M94.1,72.4V81H12.6v-8.7L94.1,72.4L94.1,72.4z M12.6,101h81.5v8.8H12.6V101z M12.6,129.8h81.5v8.8H12.6V129.8z M106.1,129.8h81.6 \tv8.8h-81.6V129.8z M106.1,109.8V101h81.6v8.8H106.1z M106.1,81v-8.7h81.6V81H106.1z M187.7,23.5h-81.6V12.2h81.6V23.5z M94.1,12.2 \tv11.4H12.6V12.2H94.1z M12.6,158.5h81.5v29.3H12.6V158.5z M106.1,187.8v-29.3h81.6v29.3H106.1z'/> </svg>"
    },
    "hsh-shutter-half": {
        "keyWords": {
            "HU": [
                "redőny félig"
            ],
            "EN": [
                "shutter half"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-shutter-half",
        "svg": "<svg version='1.1' id='shutter_x5F_window_x5F_halfway' \t xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' viewBox='0 0 200 200' \t style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shape_x5F_shutterhalf' style='fill:currentColor;' d='M190,0.1H10.4c-5.5,0-10,4.5-10,10v179.7c0,5.5,4.5,10,10,10H190 \tc5.5,0,10-4.5,10-10V10.2C200.1,4.6,195.5,0.1,190,0.1z M188.1,22.5h-81.9V12.1h81.9V22.5z M12.3,71.6h81.8v8.7H12.3V71.6z \t M12.3,51.6v-9.1h81.8v9.1H12.3z M106.1,80.3v-8.7H188v8.7H106.1z M188.1,51.6h-81.9v-9.1h81.9V51.6z M94.1,12.1v10.4H12.3V12.1 \tH94.1z M12.3,100.3h81.8v87.6H12.3V100.3z M106.1,187.9v-83.8l14.4,0.2l0,0c2.2,0,4-1.8,4-3.9H188V188L106.1,187.9L106.1,187.9z'/> </svg>"
    },
    "hsh-shutter-up": {
        "keyWords": {
            "HU": [
                "redőny fent"
            ],
            "EN": [
                "shutter up"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-shutter-up",
        "svg": "<svg version='1.1' id='shutter_x5F_window' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shape_x5F_shutterwindow' style='fill:currentColor;' d='M189.9,0H10.1C4.5,0,0,4.5,0,10.1v179.8c0,5.5,4.5,10,10,10h179.8 \tc5.5,0,10-4.5,10-10V10.1C200,4.5,195.5,0,189.9,0z M188,22h-82V12h82V22z M93.9,12v10H12V12H93.9z M12,42h81.9v146H12V42z \t M105.9,188v-83.9l14.4,0.2l0,0c2.2,0,4-1.8,4-4s-1.7-4-4-4l-14.5-0.2V42h82v146H105.9z'/> </svg>"
    },
    "hsh-table": {
        "keyWords": {
            "HU": [
                "táblázat"
            ],
            "EN": [
                "table"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-table",
        "svg": "<svg id='spreadsheet' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 144.97 199.62'><title>spreadsheet</title><path id='tablazat' d='M139.63,56.4H60.33a4,4,0,0,0-4,4v79.3a4,4,0,0,0,4,4h79.3a4,4,0,0,0,4-4V60.4A4,4,0,0,0,139.63,56.4ZM84.9,85h50.73V97.88H84.9Zm0,20.92h50.73v10.89H84.9ZM135.63,77H84.9V64.4h50.73ZM64.33,64.4H76.9v71.3H64.33ZM84.9,135.7V124.77h50.73V135.7Z' transform='translate(-27.52 -0.21)' style='fill:currentColor'/><path id='paper' d='M169.72,28.54,127,1.16a6,6,0,0,0-3.24-.95H33.52a6,6,0,0,0-6,6V193.83a6,6,0,0,0,6,6h133a6,6,0,0,0,6-6V33.59A6,6,0,0,0,169.72,28.54ZM39.52,187.83V12.21H122l27.12,17.38H125.61V22.27a4,4,0,1,0-8,0V33.59a4,4,0,0,0,4,4h38.87V187.83Z' transform='translate(-27.52 -0.21)' style='fill:currentColor'/></svg>"
    },
    "hsh-storm": {
        "keyWords": {
            "HU": [
                "vihar",
                "viharos"
            ],
            "EN": [
                "storm",
                "stormy"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-storm",
        "svg": "<svg version='1.1' id='storm' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='drops'> \t<path style='fill:currentColor;' d='M80.5,154.3c-1.1-0.5-2.5,0-3,1.2l-10.2,23.8c-0.2,0.5-0.4,1.1-0.5,1.7c-0.4,3.3,2,6.3,5.3,6.7 \t\tc3.3,0.4,6.3-2,6.7-5.3l2.9-25.7C81.9,155.6,81.4,154.7,80.5,154.3z'/> \t<path style='fill:currentColor;' d='M15,134.2c-0.9-0.4-2,0-2.4,0.9L1.9,158.8c-0.3,0.6-0.4,1.2-0.5,1.9c-0.3,3.3,2.1,6.3,5.5,6.6 \t\tc3.3,0.3,6.3-2.1,6.6-5.5l2.5-25.8C16.1,135.3,15.7,134.6,15,134.2z'/> \t<path style='fill:currentColor;' d='M41.6,163.2c-1-0.5-2.3,0-2.7,1.1L28.5,188c-0.2,0.5-0.4,1.2-0.5,1.8c-0.4,3.3,2.1,6.3,5.4,6.7 \t\tc3.3,0.4,6.3-2.1,6.7-5.4l2.8-25.7C43,164.4,42.5,163.6,41.6,163.2z'/> </g> <path id='cloud_x5F_flash' style='fill:currentColor;' d='M198.3,94.7c0-24.6-18.6-45-42.5-47.8C153,23.1,132.7,4.5,108,4.5 \tc-24.6,0-45,18.6-47.8,42.5c-23.9,2.8-42.5,23.2-42.5,47.8c0,26.5,21.6,48.1,48.1,48.1c0.1,0,0.1,0,0.2,0h51.6l-2.7,10 \tc-0.3,1.2-0.1,2.5,0.7,3.5s1.9,1.6,3.2,1.6h18l1.5,24.3c0.1,1.8,1.4,3.2,3.1,3.6c0.3,0.1,0.6,0.1,0.9,0.1c1.4,0,2.7-0.7,3.4-2 \tl25.4-43c0.6-1,0.7-2.1,0.4-3.1C187.4,129.9,198.3,113.6,198.3,94.7z M145.6,168.6l-0.9-15c-0.1-2.1-1.9-3.7-4-3.7h-16.6l10.6-38.8 \th12.8l-7.9,26.9c-0.4,1.2-0.1,2.5,0.6,3.5c0.8,1,1.9,1.6,3.2,1.6c0,0,0,0,0,0l17.4-0.1L145.6,168.6z M150.1,130.9 \tc-0.1,0-0.2,0-0.3,0l6.7-22.7c0.4-1.2,0.1-2.5-0.6-3.5c-0.8-1-1.9-1.6-3.2-1.6h-21.2c-1.8,0-3.4,1.2-3.9,3l-6.8,24.9H65.9v0 \tc0,0,0,0,0,0c-19.9,0-36.1-16.2-36.1-36.1c0-19.9,16.2-36.1,36.1-36.1c3.3,0,6-2.7,6-6c0-19.9,16.2-36.1,36.1-36.1 \tc19.9,0,36.1,16.2,36.1,36.1c0,3.3,2.7,6,6,6c19.9,0,36.1,16.2,36.1,36.1C186.3,114.7,170.1,130.9,150.1,130.9z'/> </svg>"
    },
    "hsh-sunny": {
        "keyWords": {
            "HU": [
                "napos"
            ],
            "EN": [
                "sunny"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-sunny",
        "svg": "<svg version='1.1' id='sunny' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='ellipse'> \t<path style='fill:currentColor;' d='M100.1,151.4c-28.8,0-52.2-23.4-52.2-52.2S71.3,47,100.1,47s52.2,23.4,52.2,52.2 \t\tS128.9,151.4,100.1,151.4z M100.1,59c-22.2,0-40.2,18-40.2,40.2s18,40.2,40.2,40.2s40.2-18,40.2-40.2S122.3,59,100.1,59z'/> </g> <g id='beam'> \t<path style='fill:currentColor;' d='M50.3,57.3c1.2,1.1,2.7,1.7,4.2,1.7c1.6,0,3.1-0.6,4.3-1.8c2.3-2.4,2.2-6.2-0.1-8.5L39.2,29.8 \t\tc-2.4-2.3-6.2-2.2-8.5,0.1c-2.3,2.4-2.2,6.2,0.1,8.5L50.3,57.3z'/> \t<path style='fill:currentColor;' d='M100.4,1L100.4,1c-3.3,0-6,2.7-6,6v27.1c0,3.3,2.7,6,6,6l0,0c3.3,0,6-2.7,6-6V7 \t\tC106.4,3.7,103.7,1,100.4,1z'/> \t<path style='fill:currentColor;' d='M146.3,59.7c1.5,0,3.1-0.6,4.3-1.8L170,38.3c2.3-2.3,2.3-6.1,0-8.5s-6.1-2.3-8.5,0L142,49.4 \t\tc-2.3,2.3-2.3,6.1,0,8.5C143.3,59.1,144.8,59.7,146.3,59.7z'/> \t<path style='fill:currentColor;' d='M192.9,93.2L192.9,93.2l-27.2,0.3c-3.3,0-6,2.7-5.9,6.1c0,3.3,2.7,5.9,6,5.9c0,0,0,0,0.1,0l27.2-0.3 \t\tc3.3,0,6-2.7,5.9-6.1C198.9,95.8,196.2,93.2,192.9,93.2z'/> \t<path style='fill:currentColor;' d='M151.2,141.2c-2.3-2.4-6.1-2.4-8.5-0.1c-2.4,2.3-2.4,6.1-0.1,8.5l18.9,19.5c1.2,1.2,2.7,1.8,4.3,1.8 \t\tc1.5,0,3-0.6,4.2-1.7c2.4-2.3,2.4-6.1,0.1-8.5L151.2,141.2z'/> \t<path style='fill:currentColor;' d='M100.4,158.8L100.4,158.8c-3.3,0-6,2.7-6,6V192c0,3.3,2.7,6,6,6l0,0c3.3,0,6-2.7,6-6v-27.2 \t\tC106.4,161.5,103.7,158.8,100.4,158.8z'/> \t<path style='fill:currentColor;' d='M50.3,141.6l-19.5,18.9c-2.4,2.3-2.4,6.1-0.1,8.5c1.2,1.2,2.7,1.8,4.3,1.8c1.5,0,3-0.6,4.2-1.7 \t\tl19.5-18.9c2.4-2.3,2.4-6.1,0.1-8.5C56.5,139.4,52.7,139.3,50.3,141.6z'/> \t<path style='fill:currentColor;' d='M35,105.5c3.3,0,6-2.7,6-6s-2.7-6-6-6H7.9l0,0c-3.3,0-6,2.7-6,6s2.7,6,6,6H35L35,105.5z'/> </g> </svg>"
    },
    "hsh-switch-double": {
        "keyWords": {
            "HU": [
                "kapcsoló",
                "2 modulos"
            ],
            "EN": [
                "switch",
                "double"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-switch-double",
        "svg": "<svg version='1.1' id='switch_x5F_double' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_swiccs'> \t<path style='fill:currentColor;' d='M187.9,0.3H12.1C5.6,0.3,0.3,5.6,0.3,12.1v175.8c0,6.6,5.3,11.9,11.9,11.9H188 \t\tc6.6,0,11.9-5.3,11.9-11.9V12.1C199.8,5.6,194.4,0.3,187.9,0.3z M190.3,182.8c0,2.8-2.3,5-5,5H14.8c-2.8,0-5-2.3-5-5v-168 \t\tc0-2.8,2.3-5,5-5h170.4c2.8,0,5,2.3,5,5v168H190.3z'/> \t<path style='fill:currentColor;' d='M155.6,31.1h-50.9h-9.5H44.4c-7.3,0-13.3,5.9-13.3,13.3v106.5c0,7.3,5.9,13.3,13.3,13.3h50.9h9.5 \t\th50.9c7.3,0,13.3-5.9,13.3-13.3V44.4C168.9,37.1,162.9,31.1,155.6,31.1z M48.2,154.6c-4.2,0-7.5-3.4-7.5-7.5V48.2 \t\tc0-4.2,3.4-7.5,7.5-7.5h47.1v114L48.2,154.6L48.2,154.6z M159.4,147.1c0,4.2-3.4,7.5-7.5,7.5h-47.1v-114h47.1 \t\tc4.2,0,7.5,3.4,7.5,7.5V147.1z'/> \t<path style='fill:currentColor;' d='M80,140.4H55.9c-0.5,0-1,0.5-1,1v2.8c0,0.5,0.5,1,1,1H80c0.5,0,1-0.5,1-1v-2.8 \t\tC81,140.8,80.5,140.4,80,140.4z'/> \t<path style='fill:currentColor;' d='M141.8,140.4H120c-0.5,0-1,0.5-1,1v2.8c0,0.5,0.5,1,1,1h21.8c0.5,0,1-0.5,1-1v-2.8 \t\tC142.8,140.8,142.3,140.4,141.8,140.4z'/> </g> </svg>"
    },
    "hsh-sunrise-set": {
        "keyWords": {
            "HU": [
                "napjárás"
            ],
            "EN": [
                "sunrise"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-sunrise-set",
        "svg": "<svg version='1.1' id='napjaras' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='sun'> \t<g id='ellipse'> \t\t<path style='fill:currentColor;' d='M78.4,140.9c-23.3,0-42.2-18.7-42.2-41.6s18.9-41.6,42.2-41.6s42.2,18.7,42.2,41.6 \t\t\tS101.7,140.9,78.4,140.9z M78.4,69.7c-16.6,0-30.2,13.3-30.2,29.6s13.5,29.6,30.2,29.6c16.6,0,30.2-13.3,30.2-29.6 \t\t\tC108.6,83,95.1,69.7,78.4,69.7z'/> \t</g> \t<g id='beams'> \t\t<path style='fill:currentColor;' d='M114.6,70.2c1.5,0,3-0.6,4.2-1.7L134,53.4c2.4-2.3,2.4-6.1,0-8.5c-2.3-2.4-6.1-2.4-8.5,0L110.4,60 \t\t\tc-2.4,2.3-2.4,6.1,0,8.5C111.5,69.6,113.1,70.2,114.6,70.2z'/> \t\t<path style='fill:currentColor;' d='M38.6,68.1c1.2,1.1,2.7,1.7,4.1,1.7c1.6,0,3.2-0.6,4.3-1.9c2.3-2.4,2.2-6.2-0.2-8.5L31.6,44.8 \t\t\tc-2.4-2.3-6.2-2.2-8.5,0.2s-2.2,6.2,0.2,8.5L38.6,68.1z'/> \t\t<path style='fill:currentColor;' d='M78.7,22.3L78.7,22.3c-3.3,0-6,2.7-6,6v20.9c0,3.3,2.7,6,6,6l0,0c3.3,0,6-2.7,6-6V28.3 \t\t\tC84.7,25,82,22.3,78.7,22.3z'/> \t\t<path style='fill:currentColor;' d='M151.1,93.3L151.1,93.3l-21.3,0.2c-3.3,0-6,2.7-5.9,6.1c0,3.3,2.7,5.9,6,5.9c0,0,0,0,0.1,0 \t\t\tl21.3-0.2c3.3,0,6-2.7,5.9-6.1C157.1,96,154.4,93.3,151.1,93.3z'/> \t\t<path style='fill:currentColor;' d='M119.3,130.7c-2.3-2.4-6.1-2.4-8.5-0.1c-2.4,2.3-2.4,6.1-0.1,8.5l14.8,15c1.2,1.2,2.7,1.8,4.3,1.8 \t\t\tc1.5,0,3-0.6,4.2-1.7c2.4-2.3,2.4-6.1,0.1-8.5L119.3,130.7z'/> \t\t<path style='fill:currentColor;' d='M78.7,143.8L78.7,143.8c-3.3,0-6,2.7-6,6v21c0,3.3,2.7,6,6,6l0,0c3.3,0,6-2.7,6-6v-21 \t\t\tC84.7,146.5,82,143.8,78.7,143.8z'/> \t\t<path style='fill:currentColor;' d='M38.6,131l-15.3,14.6c-2.4,2.3-2.5,6.1-0.2,8.5c1.2,1.2,2.8,1.9,4.3,1.9s3-0.6,4.1-1.7l15.3-14.6 \t\t\tc2.4-2.3,2.5-6.1,0.2-8.5C44.8,128.8,41,128.7,38.6,131z'/> \t\t<path style='fill:currentColor;' d='M27.5,105.6c3.3,0,6-2.7,6-6s-2.7-6-6-6H6.3l0,0c-3.3,0-6,2.7-6,6s2.7,6,6,6H27.5L27.5,105.6z'/> \t</g> </g> <g id='arrow'> \t<path style='fill:currentColor;' d='M196.9,128l-8.8-5.3c9-23.1,4.3-43.1-1.5-56.1c-6.7-14.9-16.1-23.9-16.5-24.3 \t\tc-2.4-2.3-6.2-2.2-8.5,0.2s-2.2,6.2,0.2,8.5c1.3,1.2,29,28.2,15.9,65.3l-6.5-4c-1.8-1.1-4.1-1.2-6-0.1c-1.9,1-3.1,3-3.1,5.2 \t\tl-0.3,28.7c0,2.1,1,4,2.8,5.1c1,0.6,2.1,0.9,3.2,0.9c0.9,0,1.8-0.2,2.7-0.6l26-13c2-1,3.2-2.9,3.3-5.1 \t\tC199.8,131.2,198.7,129.1,196.9,128z'/> </g> </svg>"
    },
    "hsh-switch-one": {
        "keyWords": {
            "HU": [
                "kapcsoló",
                "1 modul"
            ],
            "EN": [
                "switch"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-switch-one",
        "svg": "<svg version='1.1' id='switch_x5F_simple' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_switchsimple'> \t<path style='fill:currentColor;' d='M188.1,0H11.9C5.3,0,0,5.3,0,11.9v176.2c0,6.6,5.3,11.9,11.9,11.9h176.2c6.6,0,11.9-5.3,11.9-11.9 \t\tV11.9C200,5.3,194.7,0,188.1,0z M190.5,183c0,2.8-2.3,5-5,5H14.6c-2.8,0-5-2.3-5-5V14.6c0-2.8,2.3-5,5-5h170.9c2.8,0,5,2.3,5,5V183 \t\tz'/> \t<path style='fill:currentColor;' d='M155.8,31H44.2c-7.3,0-13.3,6-13.3,13.3V151c0,7.3,6,13.3,13.3,13.3h111.5c7.3,0,13.3-6,13.3-13.3 \t\tV44.2C169,36.9,163.1,31,155.8,31z M159.5,147.2c0,4.2-3.4,7.5-7.5,7.5H48c-4.2,0-7.5-3.4-7.5-7.5V48c0-4.2,3.4-7.5,7.5-7.5h104 \t\tc4.2,0,7.5,3.4,7.5,7.5V147.2z'/> \t<path style='fill:currentColor;' d='M134.2,138.1h-66c-0.8,0-1.5,0.7-1.5,1.5v4.1c0,0.8,0.7,1.5,1.5,1.5h66c0.8,0,1.5-0.7,1.5-1.5v-4.1 \t\tC135.7,138.8,135,138.1,134.2,138.1z'/> </g> </svg>"
    },
    "hsh-strip-curtain": {
        "keyWords": {
            "HU": [
                "szalagfüggöny",
                "függöny"
            ],
            "EN": [
                "strip curtain",
                "curtain"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-strip-curtain",
        "svg": "<svg version='1.1' id='szalagfuggony' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body_x5F_fuggony' style='fill:currentColor;' d='M190,0.2H10.6c-5.5,0-10,4.5-10,10v179.4c0,5.5,4.5,10,10,10H190 \tc5.5,0,10-4.5,10-10V10.2C200,4.7,195.5,0.2,190,0.2z M58.5,12.2h35.7v175.5H58.5V12.2z M44.5,187.7h-6.3l0.1-175.5h6.3L44.5,187.7z \t M106.2,104l14.4,0.2l0,0c2.2,0,4-1.8,4-4s-1.7-4-4-4L106.2,96V12.2h36.3v175.5h-36.3V104z M156.5,12.2h6.4v175.5h-6.4V12.2z \t M12.5,12.2h11.7l-0.1,175.5H12.5V12.2z M188,187.7h-11.1V12.2H188V187.7z'/> </svg>"
    },
    "hsh-strip-curtain-half": {
        "keyWords": {
            "HU": [
                "szalagfüggöny",
                "függöny"
            ],
            "EN": [
                "strip curtain",
                "curtain"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-strip-curtain-half",
        "svg": "<svg version='1.1' id='szalagfuggony_x5F_2' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' \t x='0px' y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='boda_x5F_szalagf' style='fill:currentColor;' d='M194.1,0H6C4.4,0,2.9,0.6,1.8,1.8C0.6,2.9,0,4.4,0,6l0.1,27.6c0,3.3,2.7,6,6,6 \th58.7V57l-10,2.8c-2.6,0.7-4.4,3.1-4.4,5.8l0.5,127.7c0,3.3,2.7,6,6,6h25.8c3.3,0,6-2.7,6-6l0.1-135.2c0-1.9-0.9-3.7-2.4-4.8 \ts-3.4-1.5-5.3-1l-6.4,1.8V39.6h39.5v17.1l-9.8,2.8c-2.6,0.7-4.4,3.1-4.4,5.8l0.5,127.7c0,3.3,2.7,6,6,6h25.8c3.3,0,6-2.7,6-6 \tl0.1-135.2c0-1.9-0.9-3.7-2.4-4.8s-3.4-1.5-5.3-1l-6.5,1.9V39.6h39.7v17.1l-9.8,2.8c-2.6,0.7-4.4,3.1-4.4,5.8l0.5,127.7 \tc0,3.3,2.7,6,6,6H182c3.3,0,6-2.8,6-6.1l0.1-135.1c0-1.9-0.9-3.7-2.4-4.8s-3.4-1.5-5.3-1l-6.5,1.9V39.6h20.2c3.3,0,6-2.7,6-6V6 \tC200.1,2.7,197.4,0,194.1,0z M76.7,187.3H62.9L62.4,70.1L76.8,66L76.7,187.3z M126.4,187h-13.8l-0.4-117.2l14.4-4.1L126.4,187z \t M176,187h-13.8l-0.4-117.2l14.4-4.1L176,187z M31.5,27.6L7.7,30.4V9.7l23.8-2.8V27.6z M188.1,27.6H39.5V12h148.6V27.6z'/> </svg>"
    },
    "hsh-editor": {
        "keyWords": {
            "HU": [
                "szerkesztő"
            ],
            "EN": [
                "editor"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-editor",
        "svg": "<svg version='1.1' id='szerkeszto' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_szerk'> \t<path style='fill:currentColor;' d='M192.4,67.5c-9.1-24.1-25.9-41.8-48.6-51.3c-1.1-0.5-2.3-0.4-3.4,0.1c-1,0.5-1.8,1.5-2.1,2.6 \t\tc-1.4,6-2.5,12.1-3.3,18.2c-0.8,6.8-1.3,13.7-1.3,20.6H125c0.4-11.5,1.5-23,3.1-34.3c0.7-4.6,1.4-9.3,2.3-13.9 \t\tc0.4-2-0.7-3.9-2.6-4.5c-13.1-4.5-26.3-5.8-39.3-3.8c-5,0.8-10,2-14.9,3.8c-1.9,0.7-3,2.7-2.6,4.6c1.2,5.6,2.3,11.4,3.1,17.1 \t\tc1.5,10.2,2.3,20.6,2.5,30.9h-9.5c0-6.9-0.4-13.8-0.9-20.7c-0.5-6-1.2-12-2.1-17.9c-0.2-1.2-0.9-2.3-2-2.9s-2.4-0.7-3.5-0.2 \t\tC26.9,29,13.4,51.7,7.6,68.4c-6.3,18.1-5.1,33-5,33.6c0.2,2.1,1.9,3.7,4,3.7l0,0l188.5-0.3c2.2,0,4-1.8,4-4 \t\tC199.3,100.9,199.2,85.6,192.4,67.5z'/> \t<path style='fill:currentColor;' d='M190.4,117.1H9.9c-1.9,0-3.5,1.3-3.9,3.1c-0.4,1.8,0.5,3.7,2.2,4.5c32.5,14.9,64,19.5,90.6,19.5 \t\tc14,0,26.6-1.3,37.2-3c33.5-5.4,55.1-16.1,56-16.5c1.7-0.8,2.5-2.7,2.1-4.5C193.8,118.4,192.2,117.1,190.4,117.1z'/> \t<path style='fill:currentColor;' d='M159,156.6c-0.2,0-0.4,0-0.6,0l-91.8,3.2c-3.3-4.2-7.8-6.9-12.8-7.7c-11.5-1.8-22.3,7.1-23.9,20 \t\tc0,0.3-0.1,0.6-0.1,0.8c-0.2,1.7,0.9,3.3,2.5,3.5c0.1,0,0.2,0,0.3,0c0.6,0,1.3-0.3,1.7-0.7l0,0c0.2-0.2,0.4-0.3,0.6-0.4l9.2-6.1 \t\tc1-0.7,2.2-0.9,3.4-0.6c1.2,0.3,2.2,1.1,2.8,2.3l3.6,6.7c1.3,2.4,0.6,5.5-1.6,6.9l-9.2,6.1c-0.2,0.2-0.5,0.3-0.7,0.4 \t\tc-0.7,0.3-1.3,0.8-1.6,1.7c-0.6,1.6,0,3.4,1.4,4.2c1.8,0.9,3.7,1.5,5.7,1.8c1,0.2,2,0.2,2.9,0.2c8.3,0,15.9-5.4,19.3-13.8H159 \t\tc7.1,0,12.8-6.4,12.8-14.2C171.7,163,166,156.6,159,156.6z M160,175.2c-2.2,0-3.9-2-3.9-4.4s1.8-4.4,3.9-4.4c2.2,0,3.9,2,3.9,4.4 \t\tC163.9,173.3,162.2,175.2,160,175.2z'/> </g> </svg>"
    },
    "hsh-terrace": {
        "keyWords": {
            "HU": [
                "terasz"
            ],
            "EN": [
                "terrace",
                "balcony"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-terrace",
        "svg": "<svg version='1.1' id='teracce' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='teracce_x5F_elements' style='fill:currentColor;' d='M195.3,78.7c-3.2-0.9-6.6,1-7.5,4.2l-7.8,27.7l-39.3,0 \tc-3.4,0-6.1,2.7-6.1,6.1c0,3.4,2.7,6.1,6.1,6.1c0,0,0,0,0,0l35.8,0l-5.7,20h-34.6c-2.8,0-5.3,2-5.9,4.7l-7.3,32.2l-17.2-0.1l-1-72.9 \tl0.1-61.4h78.6c2.6,0,5-1.7,5.8-4.2c0.8-2.5-0.1-5.3-2.2-6.8c-0.8-0.6-20.8-15-52.6-22.3C105.1,5.3,59.9,3.7,10.8,34 \tc-2.3,1.4-3.4,4.2-2.7,6.8s3.1,4.4,5.9,4.4h78.8l-0.1,61.5l1,72.8l-16.6-0.1l-7.3-32.1c-0.6-2.8-3.1-4.7-5.9-4.7H29.2l-5.7-20 \tl35.8,0c0,0,0,0,0,0c3.4,0,6.1-2.7,6.1-6.1c0-3.4-2.7-6.1-6.1-6.1l-39.3,0l-7.8-27.7c-0.9-3.2-4.3-5.1-7.5-4.2 \tc-3.2,0.9-5.1,4.3-4.2,7.5l17.8,62.7L10.5,184c-0.4,1.8,0,3.7,1.2,5.1c1.1,1.4,2.9,2.3,4.7,2.3l167.2,0.6c0,0,0,0,0,0 \tc1.8,0,3.6-0.8,4.7-2.3c1.2-1.4,1.6-3.3,1.2-5.1l-7.9-35.6l17.8-62.8C200.4,83,198.5,79.6,195.3,78.7z M131.3,23.8 \tc11.1,2.5,20.7,6,28.4,9.4H98.9c0,0,0,0,0,0c0,0,0,0,0,0c0,0,0,0,0,0H38.4C68.4,19.8,99.5,16.6,131.3,23.8z M29.5,154.8H59l5.6,24.7 \tl-40.5-0.1L29.5,154.8z M135.4,179.7l5.6-24.8h29.5l5.5,25L135.4,179.7z'/> </svg>"
    },
    "hsh-wc": {
        "keyWords": {
            "HU": [
                "wc",
                "toalett"
            ],
            "EN": [
                "wc",
                "toalett"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-wc",
        "svg": "<svg version='1.1' id='toilette' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='budi_x5F_shape'> \t<path style='fill:currentColor;' d='M90.2,97.9h83.5c3.3,0,6-2.7,6-6s-2.7-6-6-6H90.2c-3.3,0-6,2.7-6,6S86.9,97.9,90.2,97.9z'/> \t<path style='fill:currentColor;' d='M166,103.5h-53c-0.2,0-0.4,0-0.7,0c-0.3,0-0.5,0-0.7,0H56.7c-8.1,0-14.7,6.6-14.7,14.7v1.1 \t\tc0,11.5,6.7,22,17.1,26.9c0.7,0.6,7.8,7.3,8.4,37.5v5.6c0,0.7,0.1,1.3,0.2,1.9c0,0.1,0,0.2,0.1,0.3c1,4.7,5.3,8.2,10.1,8.2h69.5 \t\tc3.3,0,5.9-2.6,6-5.9c0.4-18.2,8-23.9,10-25.1c0,0,0,0,0.1,0c0.2-0.1,0.3-0.2,0.5-0.2c0.1-0.1,0.2-0.1,0.4-0.2 \t\tc10.8-5.7,18.3-16.6,19.6-28.5c0.1-1.2,0.1-2.3,0.1-3.3v-15.5C184,111.3,175.9,103.5,166,103.5z M172,136.3c0,0.8,0,1.5-0.1,2.1 \t\tc-0.8,7.8-5.9,15.2-13.1,19c-0.2,0.1-0.5,0.2-0.8,0.4c-0.4,0.2-0.7,0.4-0.8,0.5c0,0,0,0,0,0c-4.2,2.6-13.5,10.3-15.5,29.2H79.5v-4 \t\tc0,0,0-0.1,0-0.1c-0.7-37.1-10.8-45.9-14.6-47.8c0,0,0,0,0,0l-0.1,0c0,0,0,0,0,0l-0.1,0c-0.1,0-0.1-0.1-0.2-0.1 \t\tc-6.4-2.9-10.5-9.2-10.5-16.1v-1.1c0-1.4,1.2-2.7,2.7-2.7h54.9l0.1,0c0.2,0,0.3,0,0.5,0c0,0,0,0,0,0c0,0,0.1,0,0.1,0c0,0,0,0,0,0 \t\tc0.1,0,0.1,0,0.2,0c0.1,0,0.2,0,0.4,0l53.1,0c3.2,0,6,2.5,6,5.4V136.3z'/> \t<path style='fill:currentColor;' d='M71.2,93.6V6.5c0-3.3-2.7-6-6-6H22c-3.3,0-6,2.7-6,6v87.1c0,3.3,2.7,6,6,6h43.2 \t\tC68.5,99.6,71.2,96.9,71.2,93.6z M59.2,87.6H28V12.5h31.2V87.6z'/> \t<path style='fill:currentColor;' d='M43.6,40C49.4,40,54,35.3,54,29.6s-4.7-10.4-10.4-10.4c-5.7,0-10.4,4.7-10.4,10.4S37.9,40,43.6,40z \t\t M43.6,28c0.9,0,1.6,0.7,1.6,1.6s-0.7,1.6-1.6,1.6c-0.9,0-1.6-0.7-1.6-1.6S42.7,28,43.6,28z'/> </g> </svg>"
    },
    "hsh-touch-screen": {
        "keyWords": {
            "HU": [
                "érintő"
            ],
            "EN": [
                "touch"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-touch-screen",
        "svg": "<svg version='1.1' id='touchscreen' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='touchs_x5F_shape'> \t<path style='fill:currentColor;' d='M190.1,127.9C190.1,127.8,190,127.8,190.1,127.9c0-0.1-0.1-0.3-0.1-0.4c0-0.1-0.1-0.1-0.1-0.2 \t\tc0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.4c0,0,0,0,0,0l-33.6-58.3c-3.7-6.4-12.4-8.3-19.4-4.2l-1.9,1.1 \t\tc-1.3,0.8-2.5,1.7-3.5,2.7c-1.3-0.8-2.7-1.3-4.3-1.6c-3.6-0.7-7.4-0.1-10.6,1.8l-1.9,1.1c-1.8,1-3.3,2.4-4.6,4 \t\tc-3.9-1.4-8.5-1.1-12.5,1.2l-1.9,1.1c-0.9,0.5-1.7,1.1-2.4,1.7L78.1,51.7c-0.3-0.5-0.7-1-1.1-1.4c-2-1.9-4.4-3.2-7-3.8 \t\tc-5.4-1.3-9.8,0.7-11.6,1.7c-2,1-6.4,3.9-8.1,9.7c-0.8,2.6-0.8,5.3-0.2,8c0.1,0.6,0.4,1.1,0.6,1.6L72,104.3 \t\tc-1.1-0.5-2.4-0.9-3.9-1.1c-6.5-0.9-11.2,2.7-12.5,3.8c-0.1,0.1-0.2,0.2-0.3,0.2c-1.3,1.3-4.5,4.9-4.8,10.4c-0.2,4,1.1,7.1,2.2,9 \t\tc0.1,0.3,0.3,0.5,0.5,0.7l42.7,52c0.3,0.4,0.7,0.8,1.1,1.1c10.9,12.3,26.4,18.9,42,18.9c9.3,0,18.7-2.4,27-7.3 \t\tC187.9,179.5,197.9,152.4,190.1,127.9z M160,181.9c-17.7,10.4-41.2,6-54.7-10.1c-0.3-0.3-0.6-0.6-0.9-0.9l-41.5-50.6 \t\tc-0.2-0.4-0.4-1.1-0.4-1.9c0.1-1.2,0.7-2,1.1-2.4c0.4-0.3,1.6-1.1,2.9-0.9c0.7,0.1,1.3,0.4,1.7,0.7l35.6,43.4 \t\tc0.1,0.2,0.3,0.3,0.4,0.5c0,0,0.1,0.1,0.1,0.1c0.1,0.1,0.3,0.3,0.4,0.4c0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.3,0.2,0.4,0.3 \t\tc0.1,0,0.1,0.1,0.2,0.1c0.4,0.2,0.9,0.4,1.3,0.5c0.1,0,0.1,0,0.2,0c0.2,0,0.4,0.1,0.5,0.1c0.1,0,0.1,0,0.2,0c0.2,0,0.5,0,0.7,0 \t\tc0,0,0,0,0,0c0,0,0,0,0.1,0c0.2,0,0.4,0,0.6,0c0.1,0,0.1,0,0.2,0c0.2,0,0.3-0.1,0.5-0.1c0.1,0,0.1,0,0.2,0c0.2-0.1,0.5-0.1,0.7-0.2 \t\tc0,0,0,0,0,0c0.2-0.1,0.4-0.2,0.7-0.3c0,0,0,0,0.1,0c0,0,0.1-0.1,0.1-0.1c0.1-0.1,0.2-0.1,0.3-0.2c0.1-0.1,0.2-0.1,0.3-0.2 \t\tc0,0,0.1-0.1,0.1-0.1c0,0,0,0,0.1-0.1c0.1-0.1,0.2-0.2,0.3-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.2 \t\tc0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.1,0.1-0.2c0.1-0.1,0.1-0.2,0.2-0.3 \t\tc0-0.1,0.1-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0.1-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0-0.2,0.1-0.2 \t\tc0-0.1,0-0.2,0.1-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3 \t\tc0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.2 \t\tc0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0,0,0-0.1,0-0.1l-52-90c0-0.4,0-0.8,0.1-1.2 \t\tc0.4-1.5,1.9-2.3,2.1-2.4c0.1-0.1,0.2-0.1,0.3-0.2c0.3-0.2,1.5-0.8,2.9-0.5c0.4,0.1,0.8,0.3,1.1,0.5l19.2,33.2c0,0,0,0,0,0.1 \t\tl10.3,17.8c0.3,0.5,0.7,1,1.1,1.4l5.6,9.8c1.1,1.9,3.1,3,5.2,3c1,0,2-0.3,3-0.8c2.9-1.7,3.9-5.3,2.2-8.2L100,89.1 \t\tc-0.5-0.8-0.1-2.3,1.3-3.1l1.9-1.1c1.4-0.8,2.9-0.4,3.4,0.4l1.8,3.2c0,0,0,0,0,0l15.3,26.5c0.1,0.2,0.3,0.4,0.4,0.6 \t\tc0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.2,0.3,0.4,0.4c0.1,0.1,0.1,0.1,0.2,0.2c0.2,0.2,0.3,0.3,0.5,0.5c0,0,0,0,0.1,0 \t\tc0.2,0.1,0.3,0.2,0.5,0.3c0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.3,0.1,0.4,0.2c0.1,0,0.1,0.1,0.2,0.1c0.2,0.1,0.4,0.2,0.6,0.2 \t\tc0,0,0.1,0,0.1,0c0.2,0,0.4,0.1,0.6,0.1c0.1,0,0.1,0,0.2,0c0.2,0,0.3,0,0.5,0c0,0,0.1,0,0.1,0c0,0,0,0,0.1,0c0.2,0,0.5,0,0.7,0 \t\tc0,0,0.1,0,0.1,0c0.2,0,0.4-0.1,0.6-0.1c0.1,0,0.1,0,0.2-0.1c0.2,0,0.3-0.1,0.5-0.2c0.1,0,0.1,0,0.2-0.1c0.2-0.1,0.4-0.2,0.7-0.3 \t\tc2.9-1.7,3.9-5.3,2.2-8.2l-15.3-26.5c-0.2-0.3-0.1-0.8,0-1.1c0.2-0.7,0.8-1.3,1.5-1.7l1.9-1.1c0.7-0.4,1.5-0.6,2.3-0.4 \t\tc0.3,0.1,0.7,0.2,0.9,0.5l3.2,5.5c0,0,0,0,0,0l10.5,18.3l2.8,4.8c0,0,0,0,0,0l4.8,8.3c1.7,2.9,5.3,3.9,8.2,2.2 \t\tc2.9-1.7,3.9-5.3,2.2-8.2l-4.8-8.3c0,0,0,0,0,0l-13.3-23c-0.1-0.1-0.1-0.4,0.1-0.8c0.2-0.7,0.8-1.3,1.6-1.8l1.9-1.1 \t\tc1.5-0.9,2.9-0.5,3-0.2l33.3,57.7C184.6,151.2,176.8,172,160,181.9z'/> \t<path style='fill:currentColor;' d='M49.4,33.8c6.1-3.7,13.5-4.6,20.2-2.3c4.3,1.5,8.1,4.1,11,7.6c2.1,2.6,5.9,3,8.4,0.9 \t\tc2.6-2.1,3-5.9,0.9-8.4c-4.3-5.3-10-9.2-16.5-11.4c-10.1-3.4-21.2-2.1-30.3,3.4c-7.2,4.4-12.7,11.3-15.4,19.3 \t\tc-4,12-1.6,25,6.6,34.7c1.2,1.4,2.9,2.1,4.6,2.1c1.4,0,2.7-0.5,3.9-1.4c2.5-2.1,2.9-5.9,0.7-8.5c-5.5-6.5-7.1-15.1-4.4-23.2 \t\tC40.9,41.3,44.6,36.7,49.4,33.8z'/> \t<path style='fill:currentColor;' d='M36.9,87.3C22.2,76.6,16.2,57.9,22,40.7c3.5-10.5,10.9-18.9,20.8-23.9c9.9-4.9,21.1-5.7,31.6-2.2 \t\tc10.9,3.7,19.9,11.8,24.5,22.3c1.4,3,4.9,4.4,7.9,3c3-1.4,4.4-4.9,3-7.9C103.8,18.4,92.2,8,78.1,3.2C64.6-1.3,50.2-0.3,37.4,6 \t\tc-12.8,6.3-22.3,17.3-26.8,30.8C3.1,59.1,10.9,83.2,29.8,97c1.1,0.8,2.3,1.1,3.5,1.1c1.9,0,3.7-0.9,4.9-2.5 \t\tC40.2,93,39.6,89.2,36.9,87.3z'/> </g> </svg>"
    },
    "hsh-tv": {
        "keyWords": {
            "HU": [
                "tv"
            ],
            "EN": [
                "tv"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-tv",
        "svg": "<svg version='1.1' id='TV' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='frame'> \t<path style='fill:currentColor;' d='M188.7,0.3H11.6C5.2,0.3,0,5.4,0,11.8v134.8c0,6.4,5.2,11.6,11.6,11.6h177.1 \t\tc6.4,0,11.6-5.2,11.6-11.6V11.8C200.2,5.4,195.1,0.3,188.7,0.3z M188.2,146.1H12V12.3h176.2V146.1z'/> \t<path style='fill:currentColor;' d='M150,187.8l-99.9-0.3l0,0c-3.3,0-6,2.7-6,6s2.7,6,6,6l99.9,0.3l0,0c3.3,0,6-2.7,6-6 \t\tS153.3,187.8,150,187.8z'/> </g> <path id='triangle' style='fill:currentColor;' d='M137.8,74L76.3,38.5c-1.9-1.1-4.1-1.1-6,0s-3,3.1-3,5.2v71c0,2.1,1.1,4.1,3,5.2 \tc0.9,0.5,2,0.8,3,0.8s2.1-0.3,3-0.8l61.5-35.5c1.9-1.1,3-3.1,3-5.2S139.6,75.1,137.8,74z'/> </svg>"
    },
    "hsh-user": {
        "keyWords": {
            "HU": [
                "felhasználó",
                "ember"
            ],
            "EN": [
                "user",
                "man"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-user",
        "svg": "<svg version='1.1' id='user' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_user'> \t<ellipse style='fill:currentColor;' cx='99.7' cy='41.9' rx='45.2' ry='41.9'/> \t<path style='fill:currentColor;' d='M107.7,90.9H92.3c-29.8,0-54.2,19.3-54.2,43V200h123.8v-66.1C161.9,110.2,137.5,90.9,107.7,90.9z'/> </g> </svg>"
    },
    "hsh-user-add": {
        "keyWords": {
            "HU": [
                "felhasználó hozzáadás"
            ],
            "EN": [
                "user add"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-user-add",
        "svg": "<svg version='1.1' id='user_x5F_add' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='emberke'> \t<path style='fill:currentColor;' d='M81.2,86.4c25.1,0,45.5-19.1,45.5-42.6c0-23.5-20.4-42.6-45.5-42.6c-25.1,0-45.5,19.1-45.5,42.6 \t\tC35.7,67.3,56.1,86.4,81.2,86.4z M81.2,14.4c17.9,0,32.4,13.2,32.4,29.5c0,16.3-14.5,29.5-32.4,29.5c-17.9,0-32.4-13.2-32.4-29.5 \t\tC48.8,27.6,63.3,14.4,81.2,14.4z'/> \t<path style='fill:currentColor;' d='M87.8,89.8H75.1c-28.2,0-51.2,18.8-51.2,42v54.5c0,3.6,2.9,6.5,6.5,6.5h74.7 \t\tc-3.5-3.8-6.4-8.3-8.5-13.1H36.9v-48c0-15.9,17.1-28.9,38.1-28.9h12.7c13.5,0,25.3,5.3,32.1,13.3c4.1-2,8.5-3.4,13.1-4.2 \t\tC124.3,98.7,107.3,89.8,87.8,89.8z'/> </g> <path id='remove' style='fill:currentColor;' d='M138.7,121.4c-21.3,0-38.6,17.3-38.6,38.6s17.3,38.6,38.6,38.6 \tc21.3,0,38.6-17.3,38.6-38.6S160,121.4,138.7,121.4z M162.5,164.4H143v19.5c0,2.4-2,4.4-4.4,4.4c-2.4,0-4.4-1.9-4.4-4.4v-19.5h-19.5 \tc-2.4,0-4.4-1.9-4.4-4.4c0-2.4,1.9-4.4,4.4-4.4h19.5v-19.4c0-2.4,1.9-4.4,4.4-4.4c2.4,0,4.4,1.9,4.4,4.4v19.4h19.4 \tc2.4,0,4.4,1.9,4.4,4.4C166.8,162.4,164.9,164.4,162.5,164.4z'/> </svg>"
    },
    "hsh-user-remove": {
        "keyWords": {
            "HU": [
                "felhasználó törlés"
            ],
            "EN": [
                "user remove"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-user-remove",
        "svg": "<svg version='1.1' id='user_x5F_remove' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='emberke'> \t<path style='fill:currentColor;' d='M81.2,86.4c25.1,0,45.5-19.1,45.5-42.6c0-23.5-20.4-42.6-45.5-42.6c-25.1,0-45.5,19.1-45.5,42.6 \t\tC35.7,67.3,56.1,86.4,81.2,86.4z M81.2,14.4c17.9,0,32.4,13.2,32.4,29.5c0,16.3-14.5,29.5-32.4,29.5c-17.9,0-32.4-13.2-32.4-29.5 \t\tC48.8,27.6,63.3,14.4,81.2,14.4z'/> \t<path style='fill:currentColor;' d='M87.8,89.8H75.1c-28.2,0-51.2,18.8-51.2,42v54.5c0,3.6,2.9,6.5,6.5,6.5h74.7 \t\tc-3.5-3.8-6.4-8.3-8.5-13.1H36.9v-48c0-15.9,17.1-28.9,38.1-28.9h12.7c13.5,0,25.3,5.3,32.1,13.3c4.1-2,8.5-3.4,13.1-4.2 \t\tC124.3,98.7,107.3,89.8,87.8,89.8z'/> </g> <path id='remove' style='fill:currentColor;' d='M139,121.2c-21.3,0-38.6,17.3-38.6,38.6c0,21.3,17.3,38.6,38.6,38.6 \tc21.3,0,38.6-17.3,38.6-38.6C177.5,138.5,160.3,121.2,139,121.2z M162.8,164.2h-19.4h-8.7h-19.5c-2.4,0-4.4-2-4.4-4.4s2-4.4,4.4-4.4 \th19.5h8.7h19.4c2.4,0,4.4,2,4.4,4.4S165.2,164.2,162.8,164.2z'/> </svg>"
    },
    "hsh-settings": {
        "keyWords": {
            "HU": [
                "beállítás"
            ],
            "EN": [
                "setting"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-settings",
        "svg": "<svg version='1.1' id='user_x5F_settings' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='gear'> \t<path style='fill:currentColor;' d='M179.9,67.7c-3.6-0.5-7.3-1-10.9-1.5c-1.6-0.2-3.2-0.5-4.8-0.7c-1.2-4.1-2.8-8-4.8-11.7l9.5-11.9 \t\tc1.5-1.9,1.4-4.7-0.3-6.5l-15.8-16.6c-1.7-1.8-4.4-2.1-6.5-0.6l-5.5,3.9c-2.3,1.7-4.6,3.3-7,5c-4.7-2.7-9.7-4.9-14.9-6.4 \t\tc-0.4-3-0.8-6-1.2-9.1l-0.8-6.3C116.6,2.9,114.5,1,112,1L89.1,0.7l0,0c-2.4,0-4.5,1.8-4.9,4.2l-2.3,15.6c-4.6,1.3-9,3.1-13.2,5.4 \t\tl-12.8-9.7c-2-1.5-4.7-1.3-6.5,0.4L33.1,32.8c-1.7,1.7-2,4.5-0.5,6.5l4.8,6.4c1.6,2.1,3.1,4.2,4.7,6.3c-2.5,4.5-4.5,9.3-6,14.3 \t\tC30.7,67.1,25.4,68,20,68.8c-2.4,0.4-4.2,2.5-4.2,5l0.4,22.9c0,2.5,1.9,4.5,4.3,4.8c3.5,0.4,6.9,0.9,10.4,1.3 \t\tc1.8,0.2,3.6,0.4,5.3,0.7c0.4,1.3,0.8,2.5,1.2,3.7c3.1-1.4,6.6-2.1,10.2-2.1c3.5,0,6.9,0.7,9.9,2C54,100.4,52,92.8,52,84.7 \t\tc0-26.6,21.6-48.2,48.2-48.2s48.2,21.6,48.2,48.2s-21.6,48.2-48.2,48.2c-10.3,0-19.9-3.3-27.8-8.8c0.6,2.2,0.9,4.4,0.9,6.8 \t\tc0,4.8-1.3,9.3-3.6,13.2c3.8,2,7.8,3.6,11.9,4.8L84,165c0.4,2.4,2.4,4.2,4.9,4.2l0,0l22.9-0.2c2.5,0,4.5-1.9,4.9-4.3 \t\tc0.7-5.3,1.4-10.6,2.1-15.8c4.4-1.3,8.7-3,12.7-5.2l12.3,9.7c0.9,0.7,2,1.1,3.1,1.1c1.2,0,2.5-0.5,3.4-1.4l0.4-0.4 \t\tc7.2-6.9,7.2-6.9,11.3-10.9l4.8-4.6c1.8-1.7,2-4.5,0.6-6.5c-3.1-4.3-6.2-8.6-9.3-12.9c2.7-4.8,4.8-9.8,6.3-15.1l15.3-2.2 \t\tc2.4-0.3,4.3-2.4,4.3-4.9V72.7C184.2,70.1,182.3,68,179.9,67.7z'/> \t<path style='fill:currentColor;' d='M145.2,84.4c0-24.6-20-44.6-44.6-44.6S56,59.8,56,84.4S76,129,100.6,129 \t\tC125.2,128.9,145.2,108.9,145.2,84.4z M58.6,84.4c0-23.2,18.9-42.1,42.1-42.1s42.1,18.9,42.1,42.1s-18.9,42.1-42.1,42.1 \t\tC77.4,126.5,58.6,107.6,58.6,84.4z'/> </g> <g id='user'> \t<ellipse style='fill:currentColor;' cx='47.2' cy='130.9' rx='21' ry='21'/> \t<path style='fill:currentColor;' d='M50,155.6h-6c-11.6,0-21,7.7-21,17.2v26.4h48v-26.5C71,163.4,61.6,155.6,50,155.6z'/> </g> </svg>"
    },
    "hsh-ventillator": {
        "keyWords": {
            "HU": [
                "ventillátor"
            ],
            "EN": [
                "ventillator"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-ventillator",
        "svg": "<svg version='1.1' id='ventilator' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='lines'> \t<path style='fill:currentColor;' d='M180,52.3c-0.9-1.4-2.8-1.8-4.2-0.9c-1.4,0.9-1.8,2.8-0.9,4.2c12.7,19.4,16.6,43.3,10.6,65.7 \t\tc-2.5,9.3-6.6,18-12.1,25.8c-1,1.4-0.6,3.2,0.7,4.2c0.5,0.4,1.1,0.6,1.7,0.6c0.9,0,1.9-0.4,2.5-1.3c5.9-8.4,10.3-17.7,13-27.7 \t\tC197.8,98.8,193.7,73.1,180,52.3z'/> \t<path style='fill:currentColor;' d='M31.5,63.2c0.5,0.2,0.9,0.4,1.4,0.4c1.1,0,2.1-0.6,2.6-1.6C50.3,34.4,80,17.6,111.3,19.3 \t\tc1.6,0.1,3.1-1.2,3.2-2.8c0.1-1.7-1.2-3.1-2.8-3.2c-33.6-1.8-65.5,16.2-81.4,45.9C29.5,60.6,30.1,62.4,31.5,63.2z'/> \t<path style='fill:currentColor;' d='M112.1,181.3c-8.7,0.5-17.4-0.4-25.9-2.6c-21.6-5.8-40.1-20.5-50.6-40.2c-0.8-1.5-2.6-2-4.1-1.2 \t\tc-1.5,0.8-2,2.6-1.2,4.1c11.3,21.2,31.1,37,54.3,43.2c7.4,2,15,3,22.6,3c1.7,0,3.5-0.1,5.2-0.2c1.7-0.1,2.9-1.5,2.8-3.2 \t\tC115.1,182.5,113.7,181.2,112.1,181.3z'/> \t<path style='fill:currentColor;' d='M169.3,66.5c-0.8-1.4-2.6-2-4.1-1.2c-1.4,0.8-2,2.6-1.2,4.1c9,16.1,10.6,35.4,4.5,52.8 \t\tc-2.5,7.3-6.3,13.9-11.1,19.8c-1.1,1.3-0.9,3.2,0.4,4.2c0.6,0.5,1.2,0.7,1.9,0.7c0.9,0,1.7-0.4,2.3-1.1c5.3-6.4,9.4-13.7,12.2-21.6 \t\tC180.9,105.1,179.1,84.1,169.3,66.5z'/> \t<path style='fill:currentColor;' d='M116.5,30.7c-27-3.5-53.9,9.1-68.5,32.1c-0.9,1.4-0.5,3.3,0.9,4.1c0.5,0.3,1.1,0.5,1.6,0.5 \t\tc1,0,2-0.5,2.5-1.4c13.4-21,38-32.6,62.7-29.4c1.7,0.2,3.1-0.9,3.4-2.6S118.2,30.9,116.5,30.7z'/> \t<path style='fill:currentColor;' d='M42.9,129.2c7.8,17.8,22.9,31.8,41.3,38.2c7.2,2.5,14.7,3.9,22.3,4l0,0c1.6,0,3-1.3,3-3s-1.3-3-3-3 \t\tc-6.9-0.1-13.8-1.3-20.4-3.7c-16.8-5.9-30.6-18.6-37.8-35c-0.7-1.5-2.4-2.2-4-1.5C43,125.9,42.3,127.7,42.9,129.2z'/> </g> <g id='venti'> \t<path style='fill:currentColor;' d='M111.4,87c-3.8-0.9-7.8-0.3-11.2,1.8c-3.4,2.1-5.7,5.3-6.6,9.2c-0.9,3.9-0.3,7.8,1.8,11.2 \t\tc2.1,3.4,5.3,5.7,9.2,6.6c1.2,0.3,2.3,0.4,3.4,0.4c6.7,0,12.8-4.6,14.4-11.4C124.3,97,119.4,89,111.4,87z'/> \t<path style='fill:currentColor;' d='M186.3,163.5c-1.5-4.9-6.7-6.5-13.8-8.6c-9.4-2.8-23.1-7-33.1-20.1c8.9-8.4,14.4-20.2,14.4-33.3 \t\tc0-8.3-2.2-16.1-6.1-22.9c15.9-13.9,30.9-30.5,31.2-44c0.1-6.2-2.7-11.6-8-15.4c-0.9-0.6-21.4-15.7-39.1-18.3 \t\tc-4.1-0.6-7.2,0.2-9.3,2.4c-3.5,3.8-2.3,9-0.6,16.3c2.2,9.4,5.4,23-0.6,38c-4.2-1.3-8.7-2-13.3-2c-17.3,0-32.3,9.6-40.1,23.7 \t\tC48,72.5,26.2,67.9,14.5,74.4c-5.5,3-8.7,8.1-9.3,14.7c-0.1,1.1-2.9,26.4,3.6,43c1.5,3.8,3.7,6.1,6.7,6.8h0.1c5,1.1,9-2.5,14.4-7.7 \t\tc7.1-6.7,17.4-16.3,33.6-18.5c5,19.9,23,34.6,44.4,34.6c0.1,0,0.3,0,0.4,0c4.1,20.9,11,42.4,22.6,49.4c1.7,1,3.4,1.7,5.2,2.1 \t\tc3.9,0.9,8.1,0.5,12.2-1.4c1-0.4,24.3-10.7,35.4-24.7C186.4,169.5,187.2,166.4,186.3,163.5z M62.2,101.5c0,0.3,0,0.6,0,0.9 \t\tc-19.4,2.6-31.7,14.1-39.3,21.3c-1.5,1.4-3.2,3-4.5,4.1c-5.3-14.3-2.8-37.2-2.8-37.5c0.3-3.2,1.5-5.2,3.9-6.6 \t\tc5.5-3,15.7-2.3,27.7,0.6c5.3,1.3,11,2.9,16.7,4.9C62.8,93,62.2,97.2,62.2,101.5z M164.7,27.7c2.6,1.9,3.8,3.9,3.7,6.7 \t\tc-0.2,9.1-12.2,22.7-27,35.8c-3.1-3.3-6.6-6.1-10.5-8.4c7.4-18.1,3.6-34.3,1.2-44.6c-0.5-2-1-4.3-1.3-5.9 \t\tC145.8,13.8,164.4,27.5,164.7,27.7z M108,136.5c-19.3,0-35.1-15.7-35.1-35.1c0-19.3,15.7-35.1,35.1-35.1 \t\tc19.3,0,35.1,15.7,35.1,35.1S127.3,136.5,108,136.5z M144.1,187.9c-2.9,1.3-5.3,1.3-7.7-0.1c-7.9-4.7-13.7-22.3-17.6-41.8 \t\tc4.3-1.1,8.4-2.7,12.2-4.9c12,15.8,28.2,20.7,38.4,23.8c2,0.6,4.2,1.3,5.8,1.9C165.5,178.4,144.4,187.8,144.1,187.9z'/> </g> </svg>"
    },
    "hsh-welness": {
        "keyWords": {
            "HU": [
                "wellness"
            ],
            "EN": [
                "welness"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-welness",
        "svg": "<svg version='1.1' id='welness' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='health' style='fill:currentColor;' d='M199.9,66.4c-0.7-16.5-7.9-32.1-19.8-42.8C157.9,3.8,124,3.5,100.5,22.3 \tc-23.8-20-59.5-19.3-82.1,2.5C6.7,36.1,0.1,51.5,0,68.2c-0.1,16.8,6.4,32.6,18.2,44.3l77.9,77.9c1.2,1.2,2.7,1.8,4.2,1.8 \tc1.5,0,3.1-0.6,4.2-1.8l77.9-77.9c0,0,0.1-0.1,0.1-0.1C194.5,100,200.6,83.6,199.9,66.4z M26.8,33.4c9.4-9.1,21.6-13.6,33.9-13.6 \tc12.8,0,25.7,4.9,35.4,14.8c2.3,2.3,6.1,2.4,8.4,0.1c18.9-18.1,48.6-19,67.6-2.1c9.5,8.5,15.3,21,15.8,34.3 \tc0.2,3.9-0.1,7.8-0.8,11.6h-59.6c-1.7,0-3.3,0.7-4.4,2l-18,19.9L94.4,61.3c-0.6-2.2-2.4-3.9-4.7-4.3c-2.3-0.4-4.6,0.5-5.9,2.4 \tL66.8,82.4H13.9c-1.3-4.5-1.9-9.2-1.9-14.1C12.1,54.9,17.3,42.5,26.8,33.4z M174,104.1l-73.6,73.6L26.7,104 \tc-2.9-2.9-5.5-6.1-7.6-9.6h50.7c1.9,0,3.7-0.9,4.8-2.5l11.4-15.5l10.3,37.7c0.6,2.1,2.3,3.7,4.4,4.3c0.5,0.1,0.9,0.2,1.4,0.2 \tc1.7,0,3.3-0.7,4.4-2l23.6-26h53.1C181,95.4,177.9,100,174,104.1z'/> </svg>"
    },
    "hsh-wifi": {
        "keyWords": {
            "HU": [
                "wifi"
            ],
            "EN": [
                "wifi"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-wifi",
        "svg": "<svg version='1.1' id='wifi' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='line1'> \t<path style='fill:currentColor;' d='M125.6,178.8h-12v-0.2c0-38.8,31.6-70.3,70.3-70.3h0.1v12h-0.1c-32.2,0-58.3,26.2-58.3,58.3V178.8z' \t\t/> </g> <g id='line2'> \t<path style='fill:currentColor;' d='M78.7,178.8h-12c0-64.7,52.6-117.3,117.3-117.3v12C125.9,73.5,78.7,120.7,78.7,178.8z'/> </g> <g id='line3'> \t<path style='fill:currentColor;' d='M32.4,178.8h-12C20.4,88.6,93.8,15.2,184,15.2v12C100.4,27.2,32.4,95.2,32.4,178.8z'/> </g> <g id='dot'> \t<path style='fill:currentColor;' d='M184,161.7c0,9-7,16.5-16,17.1c-0.4,0-0.8,0-1.2,0c-0.4,0-0.8,0-1.2,0c-8.9-0.6-15.9-8-15.9-17.1 \t\tc0-9.5,7.7-17.1,17.1-17.1C176.3,144.5,184,152.2,184,161.7z'/> </g> </svg>"
    },
    "hsh-window": {
        "keyWords": {
            "HU": [
                "ablak"
            ],
            "EN": [
                "window"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-window",
        "svg": "<svg version='1.1' id='window' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body_x5F_window' style='fill:currentColor;' d='M190,0H10C4.5,0,0,4.5,0,10v179.9c0,5.5,4.5,10,10,10h180c5.5,0,10-4.5,10-10 \tV10C200,4.5,195.5,0,190,0z M12,12h81.9v176H12V12z M188,188h-82.1v-83.9l14.4,0.2l0,0c2.2,0,4-1.8,4-4s-1.7-4-4-4l-14.5-0.2V12H188 \tV188z'/> </svg>"
    },
    "hsh-termostat": {
        "keyWords": {
            "HU": [
                "termosztát"
            ],
            "EN": [
                "thermostat"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-termostat",
        "svg": "<svg version='1.1' id='termosztat' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='termosztat_x5F_shape'> \t<path style='fill:currentColor;' d='M94.5,159.7H31.1c-9.3,0-16.9-7.6-16.9-16.9V29.6c0-9.3,7.6-16.9,16.9-16.9h113.1 \t\tc9.3,0,16.9,7.6,16.9,16.9v45.2c0,3.3,2.7,6,6,6s6-2.7,6-6V29.6c0-15.9-13-28.9-28.9-28.9H31.1c-15.9,0-28.9,13-28.9,28.9v113.1 \t\tc0,15.9,13,28.9,28.9,28.9h63.4c3.3,0,6-2.7,6-6S97.8,159.7,94.5,159.7z'/> \t<path style='fill:currentColor;' d='M24.4,70.1l-0.1,27.6c0,1.3,0.5,2.6,1.5,3.5c0.9,0.9,2.2,1.5,3.5,1.5l27.7,0h0c2.8,0,5-2.2,5-5 \t\ts-2.2-5-5-5l-22.6,0l0.1-17.6H57c1.3,0,2.6-0.5,3.5-1.5c0.9-0.9,1.5-2.2,1.5-3.6l-0.2-27.6c0-2.7-2.3-5-5-5l-27.4,0c0,0,0,0,0,0 \t\tc-2.8,0-5,2.2-5,5c0,2.8,2.2,5,5,5l22.5,0l0.1,17.6H29.4C26.6,65.1,24.4,67.4,24.4,70.1z'/> \t<path style='fill:currentColor;' d='M84,97.7V42c0-2.8-2.2-5-5-5s-5,2.2-5,5v55.7c0,2.8,2.2,5,5,5S84,100.5,84,97.7z'/> \t<path style='fill:currentColor;' d='M111.6,31.6c0-7.9-6.4-14.2-14.2-14.2c-7.9,0-14.2,6.4-14.2,14.2s6.4,14.2,14.2,14.2 \t\tC105.2,45.8,111.6,39.4,111.6,31.6z M93.1,31.6c0-2.3,1.9-4.2,4.2-4.2s4.2,1.9,4.2,4.2s-1.9,4.2-4.2,4.2S93.1,33.9,93.1,31.6z'/> \t<path style='fill:currentColor;' d='M197.9,156.6C197.9,156.6,197.9,156.6,197.9,156.6c0-0.2-0.1-0.3-0.1-0.4c0-0.1-0.1-0.3-0.1-0.4 \t\tc0,0,0,0,0,0L181.3,113c-1.8-4.6-7.4-6.8-12.5-4.9l-1.4,0.5c-1,0.4-1.9,0.9-2.7,1.5c-2.6-2.2-6.4-2.9-10-1.5l-1.4,0.5 \t\tc-1.4,0.5-2.5,1.3-3.5,2.2c-2.5-1.4-5.6-1.7-8.5-0.6l-1.4,0.5c-0.7,0.3-1.3,0.6-1.9,1l-7.2-18.9c-0.1-0.4-0.3-0.7-0.6-1 \t\tc-1.1-1.5-2.6-2.6-4.3-3.3c-3.5-1.4-6.6-0.6-7.9-0.1c-1.4,0.5-4.7,1.9-6.4,5.6c-0.8,1.6-1.1,3.5-1,5.3c0,0.4,0.1,0.8,0.3,1.1 \t\tl10.4,27.3c-0.8-0.5-1.7-1-2.7-1.3c-4.2-1.3-7.8,0.6-8.8,1.2c-0.1,0-0.1,0.1-0.2,0.1c-1,0.7-3.5,2.8-4.3,6.4 \t\tc-0.6,2.6,0,4.9,0.5,6.3c0.1,0.2,0.2,0.4,0.3,0.5l23.1,39.6c0.2,0.3,0.4,0.6,0.7,0.9c7.1,11.2,19.4,17.6,32,17.6 \t\tc4.4,0,8.8-0.8,13-2.4C190.9,191,200.5,173.9,197.9,156.6z M172,189.8c-13.1,5.1-28.4-0.4-35.8-12.7c-0.2-0.3-0.3-0.5-0.5-0.7 \t\tl-22.5-38.5c-0.1-0.3-0.2-0.8-0.1-1.3c0.2-0.8,0.7-1.3,1-1.5c0.3-0.2,1.2-0.6,2.2-0.3c0.5,0.2,0.9,0.5,1.1,0.7l19.3,33c0,0,0,0,0,0 \t\tl0,0c0,0,0,0,0,0c0.1,0.2,0.3,0.4,0.4,0.6c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.2,0.2,0.4,0.3c0.1,0,0.1,0.1,0.2,0.1 \t\tc0.2,0.1,0.4,0.2,0.5,0.3c0,0,0,0,0.1,0c0.2,0.1,0.4,0.2,0.6,0.2c0.1,0,0.1,0,0.2,0c0.2,0,0.3,0.1,0.5,0.1c0.1,0,0.2,0,0.2,0 \t\tc0.1,0,0.1,0,0.2,0c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0.1,0,0.3-0.1,0.4-0.1c0.1,0,0.2-0.1,0.3-0.1c0,0,0,0,0.1,0 \t\tc0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.3-0.1c0,0,0,0,0.1,0c0.1-0.1,0.2-0.2,0.4-0.3c0.1-0.1,0.2-0.1,0.3-0.2 \t\tc0.1-0.1,0.2-0.2,0.3-0.3c0.1-0.1,0.2-0.2,0.2-0.3c0.1-0.1,0.1-0.2,0.2-0.3c0.1-0.1,0.1-0.2,0.2-0.3c0.1-0.1,0.1-0.2,0.1-0.4 \t\tc0-0.1,0.1-0.2,0.1-0.4c0-0.1,0-0.3,0.1-0.4c0-0.1,0-0.2,0-0.4c0-0.1,0-0.2,0-0.4c0-0.1,0-0.3,0-0.4c0-0.1-0.1-0.2-0.1-0.3 \t\tc0-0.1-0.1-0.3-0.1-0.4c0,0,0,0,0-0.1l-25.3-66.2c0-0.3,0.1-0.5,0.2-0.8c0.5-1,1.5-1.4,1.8-1.4c0.1,0,0.2-0.1,0.2-0.1 \t\tc0.3-0.1,1.2-0.4,2.1,0c0.3,0.1,0.5,0.3,0.7,0.5l14.4,37.6c0.1,0.4,0.3,0.7,0.5,1l2.8,7.2c0.6,1.6,2.1,2.6,3.7,2.6 \t\tc0.5,0,1-0.1,1.4-0.3c2.1-0.8,3.1-3.1,2.3-5.2l-7.3-19c-0.2-0.7,0.2-1.7,1.3-2.1l1.4-0.5c1-0.4,2.1,0,2.3,0.7l8.3,21.8 \t\tc0.1,0.2,0.2,0.5,0.3,0.7c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.2,0.3,0.3,0.4c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.3,0.3,0.4,0.4 \t\tc0,0,0.1,0.1,0.1,0.1c0.2,0.1,0.4,0.2,0.6,0.3c0.1,0,0.1,0,0.2,0.1c0.2,0.1,0.3,0.1,0.5,0.2c0.1,0,0.1,0,0.2,0.1 \t\tc0.2,0,0.3,0.1,0.5,0.1c0.1,0,0.1,0,0.2,0c0,0,0.1,0,0.1,0c0.1,0,0.3,0,0.4,0c0.1,0,0.2,0,0.3,0c0.3,0,0.5-0.1,0.7-0.2 \t\tc2.1-0.8,3.1-3.1,2.3-5.2l-7.4-19.4c-0.2-0.5,0.3-1.4,1.4-1.8l1.4-0.5c1.1-0.4,2.1,0,2.2,0.5l7.8,20.5l2.5,6.6 \t\tc0.8,2.1,3.1,3.1,5.2,2.3c2.1-0.8,3.1-3.1,2.3-5.2l-8.8-23.1c-0.1-0.2,0-0.4,0.1-0.6c0.3-0.5,0.7-0.8,1.3-1.1l1.4-0.5 \t\tc1.2-0.4,2.1,0,2.2,0.3l16.2,42.3C191.9,171.7,184.4,184.9,172,189.8z'/> \t<path style='fill:currentColor;' d='M129.1,34.5c-6.5,0-11.8,5.3-11.8,11.8v12.5c0,6.5,5.3,11.8,11.8,11.8h12.5 \t\tc6.5,0,11.8-5.3,11.8-11.8V46.3c0-6.5-5.3-11.8-11.8-11.8H129.1z M143.3,46.3v12.5c0,0.9-0.8,1.8-1.8,1.8h-12.5 \t\tc-0.9,0-1.8-0.8-1.8-1.8V46.3c0-0.9,0.8-1.8,1.8-1.8h12.5C142.5,44.5,143.3,45.3,143.3,46.3z'/> \t<path style='fill:currentColor;' d='M35.9,149.3h48.6c4.5,0,8.2-3.7,8.2-8.2v-11.6c0-4.5-3.7-8.2-8.2-8.2H35.9c-4.5,0-8.2,3.7-8.2,8.2 \t\tv11.6C27.8,145.6,31.4,149.3,35.9,149.3z M37.8,131.3h44.9v7.9H37.8V131.3z'/> </g> </svg>"
    },
    "hsh-close": {
        "keyWords": {
            "HU": [
                "bezárás"
            ],
            "EN": [
                "close"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-close",
        "svg": "<svg id='X' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 198.79 198.79'><title>X</title><g id='X_shape'><path d='M149.88,50.08a5,5,0,0,0-7.07,0L100,92.93,57.11,50.08A5,5,0,0,0,50,57.15L92.9,100,50.08,142.84a5,5,0,1,0,7.07,7.07L100,107.08l42.84,42.83a5,5,0,0,0,7.07,0,5,5,0,0,0,0-7.07L107,100l42.84-42.85A5,5,0,0,0,149.88,50.08Z' transform='translate(-0.61 -0.61)' style='fill:currentColor'/><path d='M100,.61A99.39,99.39,0,1,0,199.39,100,99.49,99.49,0,0,0,100,.61Zm0,188.78A89.39,89.39,0,1,1,189.39,100,89.49,89.49,0,0,1,100,189.39Z' transform='translate(-0.61 -0.61)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-add-fill": {
        "keyWords": {
            "HU": [
                "hozzáadás"
            ],
            "EN": [
                "add"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-add-fill",
        "svg": "<svg version='1.1' id='add' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='add_x5F_shape' style='fill:currentColor;' d='M142,21.6H58.2c-19.9,0-36.1,16.2-36.1,36.1v83.8c0,19.9,16.2,36.1,36.1,36.1H142 \tc19.9,0,36.1-16.2,36.1-36.1V57.7C178.1,37.8,161.9,21.6,142,21.6z M149.8,106.9h-43v42.9c0,3.9-3.1,7-7,7c-3.9,0-7-3.1-7-7v-42.9 \tH49.9c-3.9,0-7-3.1-7-7c0-3.9,3.1-7,7-7h42.9v-43c0-3.9,3.1-7,7-7c3.9,0,7,3.1,7,7v43h43c3.9,0,7,3.1,7,7 \tC156.8,103.8,153.6,106.9,149.8,106.9z'/> </svg>"
    },
    "hsh-add": {
        "keyWords": {
            "HU": [
                "hozzáadás"
            ],
            "EN": [
                "add"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-add",
        "svg": "<svg version='1.1' id='add_x5F_line' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='add_x5F_line_1_'> \t<path style='fill:currentColor;' d='M143.8,18.5H56.2c-20.8,0-37.7,16.9-37.7,37.7v87.6c0,20.8,16.9,37.7,37.7,37.7h87.6 \t\tc20.8,0,37.7-16.9,37.7-37.7V56.2C181.5,35.4,164.6,18.5,143.8,18.5z M166.8,143.8c0,12.7-10.3,23.1-23.1,23.1H56.2 \t\tc-12.7,0-23.1-10.3-23.1-23.1V56.2c0-12.7,10.3-23.1,23.1-23.1h87.6c12.7,0,23.1,10.3,23.1,23.1V143.8z'/> \t<path style='fill:currentColor;' d='M151.9,93H107V48.1c0-4-3.3-7.3-7.3-7.3c-4,0-7.3,3.3-7.3,7.3V93H47.5c-4,0-7.3,3.3-7.3,7.3 \t\tc0,4,3.3,7.3,7.3,7.3h44.9v44.9c0,4,3.3,7.3,7.3,7.3c4,0,7.3-3.3,7.3-7.3v-44.9h44.9c4,0,7.3-3.3,7.3-7.3 \t\tC159.2,96.2,155.9,93,151.9,93z'/> </g> </svg>"
    },
    "hsh-user_add": {
        "keyWords": {
            "HU": [
                "felhasználó hozzáadása"
            ],
            "EN": [
                "user add"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-user_add",
        "svg": "<svg id='user_add' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 176.57 198.78'><title>add_user</title><g id='emberke'><path d='M70.9,88.35c25.78,0,46.75-19.62,46.75-43.73S96.68.9,70.9.9,24.14,20.52,24.14,44.62,45.11,88.35,70.9,88.35Zm0-75.45c19.16,0,34.75,14.23,34.75,31.72S90.06,76.35,70.9,76.35,36.14,62.11,36.14,44.62,51.73,12.9,70.9,12.9Z' transform='translate(-11.76 -0.9)' style='fill:currentColor'/><path d='M77.84,93.51H64.55c-29.11,0-52.79,19.34-52.79,43.1v57.07a6,6,0,0,0,6,6H124.63a6,6,0,0,0,6-6V136.57C130.63,112.83,107,93.51,77.84,93.51Zm40.79,94.17H23.76V136.61c0-17.15,18.3-31.1,40.79-31.1H77.84c22.49,0,40.79,13.93,40.79,31.06Z' transform='translate(-11.76 -0.9)' style='fill:currentColor'/></g><path id='plusz' d='M182.34,23.59H164.53V7.1a6,6,0,1,0-12,0V23.59H134.72a6,6,0,1,0,0,12h17.81V54.71a6,6,0,1,0,12,0V35.59h17.81a6,6,0,0,0,0-12Z' transform='translate(-11.76 -0.9)' style='fill:currentColor'/></svg>"
    },
    "hsh-temperature-analog": {
        "keyWords": {
            "HU": [
                "hőmérő"
            ],
            "EN": [
                "thermometer"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-temperature-analog",
        "svg": "<svg version='1.1' id='termosztat_x5F_1' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='frame1' style='fill:currentColor;' d='M105.9,117.9V29.7c0-0.1,0-0.3,0-0.4c0-0.4,0-0.8,0-1c0-15.2-12.4-27.6-27.6-27.6 \tS50.7,13.1,50.7,28.3c0,0.2,0,0.5,0,0.7s0,0.5,0,0.7v88.2c-10.9,8.5-17.3,21.5-17.3,35.4c0,24.7,20.1,44.9,44.9,44.9 \ts44.9-20.1,44.9-44.9C123.1,139.4,116.7,126.4,105.9,117.9z M78.3,186.1c-18.1,0-32.9-14.7-32.9-32.9c0-11,5.5-21.2,14.6-27.3l0,0 \tc0.2-0.1,0.3-0.2,0.5-0.4c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.2-0.3l0.1-0.1 \tc0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.1,0.1-0.2s0.1-0.2,0.1-0.3c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3 \tc0-0.1,0-0.1,0-0.2s0.1-0.3,0.1-0.4s0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.2,0-0.4,0-0.6l0,0V29.7c0-0.2,0-0.5,0-0.7s0-0.5,0-0.7 \tc0-8.6,7-15.6,15.6-15.6s15.6,7,15.6,15.6c0,0.3,0,0.6,0,0.8c0,0.4,0,0.8,0,1.3V121l0,0c0,0.2,0,0.4,0,0.6c0,0.1,0,0.2,0,0.3 \tc0,0.1,0,0.2,0,0.3c0,0.1,0.1,0.2,0.1,0.4c0,0.1,0,0.1,0,0.2s0.1,0.2,0.1,0.3c0,0.1,0,0.1,0.1,0.2c0,0.1,0.1,0.2,0.1,0.3 \tc0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.2,0.2,0.3c0,0.1,0.1,0.1,0.1,0.1c0.1,0.1,0.2,0.2,0.2,0.3l0.1,0.1 \tc0.1,0.1,0.2,0.2,0.3,0.3c0.1,0.1,0.1,0.1,0.2,0.2s0.1,0.1,0.2,0.2c0.2,0.1,0.3,0.2,0.5,0.4l0,0c9.1,6.1,14.6,16.3,14.6,27.3 \tC111.1,171.4,96.4,186.1,78.3,186.1z'/> <path id='line1' style='fill:currentColor;' d='M88,131.5V33.3c0-2.6-1-5-2.9-6.9c-1.8-1.8-4.3-2.9-6.9-2.9c-5.4,0-9.8,4.4-9.8,9.8v98.1 \tc-8.8,3.8-14.5,12.4-14.5,22.1c0,13.3,10.8,24.1,24.1,24.1s24.1-10.8,24.1-24.1C102.2,143.9,96.6,135.4,88,131.5z M78.1,171.5 \tc-10,0-18.1-8.1-18.1-18.1c0-7.8,5-14.8,12.4-17.2h0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.2-0.1c0.1-0.1,0.2-0.1,0.2-0.2 \tc0.1-0.1,0.2-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.2c0-0.1,0.1-0.2,0.1-0.2 \tc0-0.1,0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0-0.2,0.1-0.3c0-0.1,0-0.2,0-0.3v-0.1V33.3c0-2.1,1.7-3.8,3.8-3.8c1,0,1.9,0.4,2.6,1.1 \ts1.1,1.7,1.1,2.7v100.3v0.1c0,0.1,0,0.2,0,0.3s0,0.2,0,0.3s0.1,0.2,0.1,0.3s0.1,0.2,0.1,0.3s0.1,0.2,0.1,0.2c0,0.1,0.1,0.2,0.2,0.3 \ts0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.2,0.1,0.2,0.2c0.1,0,0.2,0.1,0.2,0.1 \tc0.1,0.1,0.2,0.1,0.3,0.1h0.1c7.2,2.5,12.1,9.4,12.1,17.1C96.2,163.4,88,171.5,78.1,171.5z'/> <g id='scale1'> \t<path style='fill:currentColor;' d='M165.8,50.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h27.8c3.3,0,6-2.7,6-6S169.2,50.9,165.8,50.9z'/> \t<path style='fill:currentColor;' d='M171.4,32.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h33.3c3.3,0,6-2.7,6-6S174.7,32.9,171.4,32.9z'/> \t<path style='fill:currentColor;' d='M178,14.2h-40c-3.3,0-6,2.7-6,6s2.7,6,6,6h40c3.3,0,6-2.7,6-6S181.3,14.2,178,14.2z'/> \t<path style='fill:currentColor;' d='M160.9,69H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h22.9c3.3,0,6-2.7,6-6S164.2,69,160.9,69z'/> </g> </svg>"
    },
    "hsh-temperature-low": {
        "keyWords": {
            "HU": [
                "hőmérséklet alacsony"
            ],
            "EN": [
                "temperature low"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-temperature-low",
        "svg": "<svg version='1.1' id='termosztat_x5F_2' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='frame2' style='fill:currentColor;' d='M105.9,117.9V29.7c0-0.1,0-0.3,0-0.4c0-0.4,0-0.8,0-1c0-15.2-12.4-27.6-27.6-27.6 \tS50.7,13.1,50.7,28.3c0,0.2,0,0.5,0,0.7s0,0.5,0,0.7v88.2c-10.9,8.5-17.3,21.5-17.3,35.4c0,24.7,20.1,44.9,44.9,44.9 \ts44.9-20.1,44.9-44.9C123.1,139.4,116.7,126.4,105.9,117.9z M78.3,186.1c-18.1,0-32.9-14.7-32.9-32.9c0-11,5.5-21.2,14.6-27.3l0,0 \tc0.2-0.1,0.3-0.2,0.5-0.4c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.2-0.3l0.1-0.1 \tc0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.1,0.1-0.2s0.1-0.2,0.1-0.3c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3 \tc0-0.1,0-0.1,0-0.2s0.1-0.3,0.1-0.4s0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.2,0-0.4,0-0.6l0,0V29.7c0-0.2,0-0.5,0-0.7s0-0.5,0-0.7 \tc0-8.6,7-15.6,15.6-15.6s15.6,7,15.6,15.6c0,0.3,0,0.6,0,0.8c0,0.4,0,0.8,0,1.3V121l0,0c0,0.2,0,0.4,0,0.6c0,0.1,0,0.2,0,0.3 \tc0,0.1,0,0.2,0,0.3c0,0.1,0.1,0.2,0.1,0.4c0,0.1,0,0.1,0,0.2s0.1,0.2,0.1,0.3c0,0.1,0,0.1,0.1,0.2c0,0.1,0.1,0.2,0.1,0.3 \tc0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.2,0.2,0.3c0,0.1,0.1,0.1,0.1,0.1c0.1,0.1,0.2,0.2,0.2,0.3l0.1,0.1 \tc0.1,0.1,0.2,0.2,0.3,0.3c0.1,0.1,0.1,0.1,0.2,0.2s0.1,0.1,0.2,0.2c0.2,0.1,0.3,0.2,0.5,0.4l0,0c9.1,6.1,14.6,16.3,14.6,27.3 \tC111.1,171.4,96.4,186.1,78.3,186.1z'/> <path id='line2' style='fill:currentColor;' d='M88,131.5V33.3c0-2.6-1-5-2.9-6.9c-1.8-1.8-4.3-2.9-6.9-2.9c-5.4,0-9.8,4.4-9.8,9.8v98.1 \tc-8.8,3.8-14.5,12.4-14.5,22.1c0,13.3,10.8,24.1,24.1,24.1s24.1-10.8,24.1-24.1C102.2,143.9,96.5,135.4,88,131.5z M78.1,171.5 \tc-10,0-18.1-8.1-18.1-18.1c0-7.8,5-14.8,12.4-17.2h0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.2-0.1c0.1,0,0.2-0.1,0.2-0.2 \tc0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2s0.1-0.2,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.2,0.1-0.3 \tc0.1-0.1,0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0-0.2,0-0.3s0-0.2,0-0.3v-0.1v-100c0-2.1,1.7-3.8,3.8-3.8c1,0,1.9,0.4,2.6,1.1 \ts1.1,1.7,1.1,2.7v100.3v0.1c0,0.1,0,0.2,0,0.3s0,0.2,0,0.3s0,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.3s0.1,0.2,0.1,0.2 \tc0,0.1,0.1,0.2,0.2,0.3s0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2s0.2,0.1,0.2,0.2c0.1,0,0.2,0.1,0.2,0.1 \tc0.1,0.1,0.2,0.1,0.3,0.1h0.1c7.3,2.5,12.1,9.4,12.1,17.1C96.2,163.4,88,171.5,78.1,171.5z'/> <path id='scale_x5F_down' style='fill:currentColor;' d='M96.2,153.4c0,10-8.1,18.1-18.1,18.1S60,163.4,60,153.4c0-7.8,5-14.8,12.4-17.2 \th0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.2-0.1c0.1,0,0.2-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2 \ts0.1-0.2,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.2,0.1-0.3c0.1-0.1,0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0-0.2,0-0.3s0-0.2,0-0.3 \tv-0.1V128H82v5.5v0.1c0,0.1,0,0.2,0,0.3s0,0.2,0,0.3s0,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.3s0.1,0.2,0.1,0.2c0,0.1,0.1,0.2,0.2,0.3 \ts0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2s0.2,0.1,0.2,0.2c0.1,0,0.2,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.1 \th0.1C91.3,138.9,96.2,145.8,96.2,153.4z'/> <g id='scale2'> \t<path style='fill:currentColor;' d='M165.8,50.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h27.8c3.3,0,6-2.7,6-6S169.2,50.9,165.8,50.9z'/> \t<path style='fill:currentColor;' d='M171.4,32.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h33.3c3.3,0,6-2.7,6-6S174.7,32.9,171.4,32.9z'/> \t<path style='fill:currentColor;' d='M178,14.2h-40c-3.3,0-6,2.7-6,6s2.7,6,6,6h40c3.3,0,6-2.7,6-6S181.3,14.2,178,14.2z'/> \t<path style='fill:currentColor;' d='M160.9,69H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h22.9c3.3,0,6-2.7,6-6S164.2,69,160.9,69z'/> </g> </svg>"
    },
    "hsh-temperature-half": {
        "keyWords": {
            "HU": [
                "hőmérséklet közepes"
            ],
            "EN": [
                "temperature half"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-temperature-half",
        "svg": "<svg version='1.1' id='termosztat_x5F_3' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='frame3' style='fill:currentColor;' d='M105.9,117.9V29.7c0-0.1,0-0.3,0-0.4c0-0.4,0-0.8,0-1c0-15.2-12.4-27.6-27.6-27.6 \tS50.7,13.1,50.7,28.3c0,0.2,0,0.5,0,0.7s0,0.5,0,0.7v88.2c-10.9,8.5-17.3,21.5-17.3,35.4c0,24.7,20.1,44.9,44.9,44.9 \ts44.9-20.1,44.9-44.9C123.1,139.4,116.7,126.4,105.9,117.9z M78.3,186.1c-18.1,0-32.9-14.7-32.9-32.9c0-11,5.5-21.2,14.6-27.3l0,0 \tc0.2-0.1,0.3-0.2,0.5-0.4c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.2-0.3l0.1-0.1 \tc0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.1,0.1-0.2s0.1-0.2,0.1-0.3c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3 \tc0-0.1,0-0.1,0-0.2s0.1-0.3,0.1-0.4s0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.2,0-0.4,0-0.6l0,0V29.7c0-0.2,0-0.5,0-0.7s0-0.5,0-0.7 \tc0-8.6,7-15.6,15.6-15.6s15.6,7,15.6,15.6c0,0.3,0,0.6,0,0.8c0,0.4,0,0.8,0,1.3V121l0,0c0,0.2,0,0.4,0,0.6c0,0.1,0,0.2,0,0.3 \tc0,0.1,0,0.2,0,0.3c0,0.1,0.1,0.2,0.1,0.4c0,0.1,0,0.1,0,0.2s0.1,0.2,0.1,0.3c0,0.1,0,0.1,0.1,0.2c0,0.1,0.1,0.2,0.1,0.3 \tc0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.2,0.2,0.3c0,0.1,0.1,0.1,0.1,0.1c0.1,0.1,0.2,0.2,0.2,0.3l0.1,0.1 \tc0.1,0.1,0.2,0.2,0.3,0.3c0.1,0.1,0.1,0.1,0.2,0.2s0.1,0.1,0.2,0.2c0.2,0.1,0.3,0.2,0.5,0.4l0,0c9.1,6.1,14.6,16.3,14.6,27.3 \tC111.1,171.4,96.4,186.1,78.3,186.1z'/> <path id='line3' style='fill:currentColor;' d='M88,131.5V33.3c0-2.6-1-5-2.9-6.9c-1.8-1.8-4.3-2.9-6.9-2.9c-5.4,0-9.8,4.4-9.8,9.8v98.1 \tc-8.8,3.8-14.5,12.4-14.5,22.1c0,13.3,10.8,24.1,24.1,24.1s24.1-10.8,24.1-24.1C102.2,143.9,96.5,135.4,88,131.5z M78.1,171.5 \tc-10,0-18.1-8.1-18.1-18.1c0-7.8,5-14.8,12.4-17.2h0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.2-0.1c0.1,0,0.2-0.1,0.2-0.2 \tc0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2s0.1-0.2,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.2,0.1-0.3 \tc0.1-0.1,0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0-0.2,0-0.3s0-0.2,0-0.3v-0.1v-100c0-2.1,1.7-3.8,3.8-3.8c1,0,1.9,0.4,2.6,1.1 \ts1.1,1.7,1.1,2.7v100.3v0.1c0,0.1,0,0.2,0,0.3s0,0.2,0,0.3s0,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.3s0.1,0.2,0.1,0.2 \tc0,0.1,0.1,0.2,0.2,0.3s0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2s0.2,0.1,0.2,0.2c0.1,0,0.2,0.1,0.2,0.1 \tc0.1,0.1,0.2,0.1,0.3,0.1h0.1c7.3,2.5,12.1,9.4,12.1,17.1C96.2,163.4,88,171.5,78.1,171.5z'/> <path id='scale_x5F_half' style='fill:currentColor;' d='M84,136.4C84,136.3,84,136.3,84,136.4c-0.2-0.1-0.3-0.1-0.4-0.2 \tc-0.1,0-0.2-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.2-0.2s-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2 \ts-0.1-0.2-0.2-0.3c0-0.1-0.1-0.2-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3s-0.1-0.2-0.1-0.3s0-0.2,0-0.3s0-0.2,0-0.3v-0.1V128V81h-7.5v47v5.4 \tv0.1c0,0.1,0,0.2,0,0.3s0,0.2,0,0.3s-0.1,0.2-0.1,0.3s-0.1,0.2-0.1,0.3s-0.1,0.2-0.1,0.3c-0.1,0.1-0.1,0.2-0.2,0.3 \tc0,0.1-0.1,0.2-0.2,0.2s-0.1,0.1-0.2,0.2c-0.1,0.1-0.2,0.1-0.2,0.2c-0.1,0.1-0.2,0.1-0.2,0.2c-0.1,0-0.2,0.1-0.2,0.1 \tc-0.1,0-0.2,0.1-0.3,0.1h-0.1C65,138.7,60,145.6,60,153.4c0,10,8.1,18.1,18.1,18.1s18.1-8.1,18.1-18.1 \tC96.2,145.8,91.3,138.9,84,136.4z'/> <g id='scale3'> \t<path style='fill:currentColor;' d='M165.8,50.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h27.8c3.3,0,6-2.7,6-6S169.2,50.9,165.8,50.9z'/> \t<path style='fill:currentColor;' d='M171.4,32.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h33.3c3.3,0,6-2.7,6-6S174.7,32.9,171.4,32.9z'/> \t<path style='fill:currentColor;' d='M178,14.2h-40c-3.3,0-6,2.7-6,6s2.7,6,6,6h40c3.3,0,6-2.7,6-6S181.3,14.2,178,14.2z'/> \t<path style='fill:currentColor;' d='M160.9,69H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h22.9c3.3,0,6-2.7,6-6S164.2,69,160.9,69z'/> </g> </svg>"
    },
    "hsh-temperature-filled": {
        "keyWords": {
            "HU": [
                "hőmérséklet magas"
            ],
            "EN": [
                "temperature high"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-temperature-filled",
        "svg": "<svg version='1.1' id='termosztat_x5F_4' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='frame4' style='fill:currentColor;' d='M105.9,117.9V29.7c0-0.1,0-0.3,0-0.4c0-0.4,0-0.8,0-1c0-15.2-12.4-27.6-27.6-27.6 \tS50.7,13.1,50.7,28.3c0,0.2,0,0.5,0,0.7s0,0.5,0,0.7v88.2c-10.9,8.5-17.3,21.5-17.3,35.4c0,24.7,20.1,44.9,44.9,44.9 \ts44.9-20.1,44.9-44.9C123.1,139.4,116.7,126.4,105.9,117.9z M78.3,186.1c-18.1,0-32.9-14.7-32.9-32.9c0-11,5.5-21.2,14.6-27.3l0,0 \tc0.2-0.1,0.3-0.2,0.5-0.4c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.3-0.3l0.1-0.1c0.1-0.1,0.2-0.2,0.2-0.3l0.1-0.1 \tc0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.1,0.1-0.2s0.1-0.2,0.1-0.3c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3 \tc0-0.1,0-0.1,0-0.2s0.1-0.3,0.1-0.4s0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.2,0-0.4,0-0.6l0,0V29.7c0-0.2,0-0.5,0-0.7s0-0.5,0-0.7 \tc0-8.6,7-15.6,15.6-15.6s15.6,7,15.6,15.6c0,0.3,0,0.6,0,0.8c0,0.4,0,0.8,0,1.3V121l0,0c0,0.2,0,0.4,0,0.6c0,0.1,0,0.2,0,0.3 \tc0,0.1,0,0.2,0,0.3c0,0.1,0.1,0.2,0.1,0.4c0,0.1,0,0.1,0,0.2s0.1,0.2,0.1,0.3c0,0.1,0,0.1,0.1,0.2c0,0.1,0.1,0.2,0.1,0.3 \tc0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.2,0.2,0.3c0,0.1,0.1,0.1,0.1,0.1c0.1,0.1,0.2,0.2,0.2,0.3l0.1,0.1 \tc0.1,0.1,0.2,0.2,0.3,0.3c0.1,0.1,0.1,0.1,0.2,0.2s0.1,0.1,0.2,0.2c0.2,0.1,0.3,0.2,0.5,0.4l0,0c9.1,6.1,14.6,16.3,14.6,27.3 \tC111.1,171.4,96.4,186.1,78.3,186.1z'/> <path id='line4' style='fill:currentColor;' d='M88,131.5V33.3c0-2.6-1-5-2.9-6.9c-1.8-1.8-4.3-2.9-6.9-2.9c-5.4,0-9.8,4.4-9.8,9.8v98.1 \tc-8.8,3.8-14.5,12.4-14.5,22.1c0,13.3,10.8,24.1,24.1,24.1s24.1-10.8,24.1-24.1C102.2,143.9,96.5,135.4,88,131.5z M78.1,171.5 \tc-10,0-18.1-8.1-18.1-18.1c0-7.8,5-14.8,12.4-17.2h0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.2-0.1c0.1,0,0.2-0.1,0.2-0.2 \tc0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2s0.1-0.2,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.3c0-0.1,0.1-0.2,0.1-0.3 \tc0.1-0.1,0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0-0.2,0-0.3s0-0.2,0-0.3v-0.1v-100c0-2.1,1.7-3.8,3.8-3.8c1,0,1.9,0.4,2.6,1.1 \ts1.1,1.7,1.1,2.7v100.3v0.1c0,0.1,0,0.2,0,0.3s0,0.2,0,0.3s0,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.3s0.1,0.2,0.1,0.2 \tc0,0.1,0.1,0.2,0.2,0.3s0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2s0.2,0.1,0.2,0.2c0.1,0,0.2,0.1,0.2,0.1 \tc0.1,0.1,0.2,0.1,0.3,0.1h0.1c7.3,2.5,12.1,9.4,12.1,17.1C96.2,163.4,88,171.5,78.1,171.5z'/> <path id='scale_x5F_up' style='fill:currentColor;' d='M84,136.4C84,136.3,84,136.3,84,136.4c-0.2-0.1-0.3-0.1-0.4-0.2 \tc-0.1,0-0.2-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.2-0.2s-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2 \ts-0.1-0.2-0.2-0.3c0-0.1-0.1-0.2-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3s-0.1-0.2-0.1-0.3s0-0.2,0-0.3s0-0.2,0-0.3v-0.1V81V33.3 \tc0-1-0.4-1.9-1.1-2.7c-0.7-0.7-1.6-1.1-2.6-1.1c-2.1,0-3.8,1.7-3.8,3.8V81v52.4v0.1c0,0.1,0,0.2,0,0.3s0,0.2,0,0.3s-0.1,0.2-0.1,0.3 \ts-0.1,0.2-0.1,0.3s-0.1,0.2-0.1,0.3c-0.1,0.1-0.1,0.2-0.2,0.3c0,0.1-0.1,0.2-0.2,0.2s-0.1,0.1-0.2,0.2c-0.1,0.1-0.2,0.1-0.2,0.2 \tc-0.1,0.1-0.2,0.1-0.2,0.2c-0.1,0-0.2,0.1-0.2,0.1c-0.1,0-0.2,0.1-0.3,0.1h-0.1C65,138.7,60,145.6,60,153.4c0,10,8.1,18.1,18.1,18.1 \ts18.1-8.1,18.1-18.1C96.2,145.8,91.3,138.9,84,136.4z'/> <g id='scale4'> \t<path style='fill:currentColor;' d='M165.8,50.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h27.8c3.3,0,6-2.7,6-6S169.2,50.9,165.8,50.9z'/> \t<path style='fill:currentColor;' d='M171.4,32.9H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h33.3c3.3,0,6-2.7,6-6S174.7,32.9,171.4,32.9z'/> \t<path style='fill:currentColor;' d='M178,14.2h-40c-3.3,0-6,2.7-6,6s2.7,6,6,6h40c3.3,0,6-2.7,6-6S181.3,14.2,178,14.2z'/> \t<path style='fill:currentColor;' d='M160.9,69H138c-3.3,0-6,2.7-6,6s2.7,6,6,6h22.9c3.3,0,6-2.7,6-6S164.2,69,160.9,69z'/> </g> </svg>"
    },
    "hsh-apply": {
        "keyWords": {
            "HU": [
                "elfogadva"
            ],
            "EN": [
                "apply"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-apply",
        "svg": "<svg id='apply' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 191.97 199.35'><title>apply</title><g id='apply_shape'><path d='M9.17,77.31a6.12,6.12,0,0,0,1.83.28,6,6,0,0,0,5.71-4.17A87.75,87.75,0,0,1,126.89,16.64a6,6,0,0,0,3.65-11.43A99.75,99.75,0,0,0,5.28,69.76,6,6,0,0,0,9.17,77.31Z' transform='translate(-4.12 -0.46)' style='fill:currentColor'/><path d='M191.16,123a6,6,0,0,0-7.54,3.89A87.75,87.75,0,0,1,73.44,183.63a6,6,0,1,0-3.65,11.43,99.58,99.58,0,0,0,125.26-64.57A6,6,0,0,0,191.16,123Z' transform='translate(-4.12 -0.46)' style='fill:currentColor'/><path d='M70.81,144.26l80.36-80.35A5.78,5.78,0,0,0,143,55.73L68.75,130l-10.48-25.3A5.77,5.77,0,1,0,47.6,109.1l13.78,33.29a5.8,5.8,0,0,0,4.22,3.46,6.07,6.07,0,0,0,1.12.11A5.78,5.78,0,0,0,70.81,144.26Z' transform='translate(-4.12 -0.46)' style='fill:currentColor'/><path d='M184.31,75.8a6,6,0,0,0,7.41,4.14l.05,0a6,6,0,0,0,4.09-7.39,99.72,99.72,0,0,0-25-42.83,6,6,0,1,0-8.53,8.44A87.58,87.58,0,0,1,184.31,75.8Z' transform='translate(-4.12 -0.46)' style='fill:currentColor'/><path d='M15.88,124.37a6,6,0,0,0-7.44-4.07h0a6,6,0,0,0-4.08,7.44,99.87,99.87,0,0,0,24.81,42.05,6,6,0,0,0,5.95,1.54,5.86,5.86,0,0,0,2.53-1.49,6,6,0,0,0,.05-8.48A87.87,87.87,0,0,1,15.88,124.37Z' transform='translate(-4.12 -0.46)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-armchair": {
        "keyWords": {
            "HU": [
                "fotel"
            ],
            "EN": [
                "armchair"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-armchair",
        "svg": "<svg version='1.1' id='armchair' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body_x5F_armchair' style='fill:currentColor;' d='M182.9,54.7h-10.4V30.6c0-15.9-13.2-28.8-29.4-28.8H56.9 \tc-16.2,0-29.4,12.9-29.4,28.8v24.1H17.1C7.5,54.7,0,63.9,0,75.7v73.8c0,11.7,7.5,20.9,17.2,20.9h16.3l0,0h0.1h7.7v10.4 \tc0,9.6,7.8,17.4,17.3,17.4h9.7c9.5,0,17.3-7.8,17.3-17.4v-10.4h28.9v10.4c0,9.6,7.8,17.4,17.3,17.4h9.7c9.5,0,17.3-7.8,17.3-17.4 \tv-10.4h7.7l0,0l0,0h16.3c9.6,0,17.2-9.2,17.2-20.9V75.7C200,63.9,192.5,54.7,182.9,54.7z M39.4,158.4l0.1-62.8l121,0.6v4v58.3 \tL39.4,158.4L39.4,158.4z M39.5,30.7c0-9.3,7.8-16.8,17.4-16.8h86.2c9.6,0,17.4,7.5,17.4,16.8v53.5l-121-0.6V30.7z M12,149.5V75.7 \tc0-5.1,2.7-8.9,5.2-8.9h10.4v21.9v0.5c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0,0.3l-0.1,68.6H17.1C14.7,158.4,12,154.6,12,149.5z \t M73.5,180.8c0,3-2.4,5.4-5.3,5.4h-9.7c-2.9,0-5.3-2.4-5.3-5.4v-10.4h20.3V180.8z M146.7,180.8c0,3-2.4,5.4-5.3,5.4h-9.7 \tc-2.9,0-5.3-2.4-5.3-5.4v-10.4h20.3V180.8z M188,149.5c0,5.1-2.7,8.9-5.2,8.9h-10.4v-58.3v-9.9V66.7h10.4c2.4,0,5.2,3.8,5.2,8.9 \tV149.5z'/> </svg>"
    },
    "hsh-bar": {
        "keyWords": {
            "HU": [
                "bár",
                "pult"
            ],
            "EN": [
                "bar"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bar",
        "svg": "<svg version='1.1' id='bar' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='coctail' style='fill:currentColor;' d='M135.5,91.7C135.5,91.7,135.5,91.7,135.5,91.7l28.8-36.7c1.4-1.8,1.7-4.2,0.7-6.3 \tc-1-2.1-3.1-3.4-5.4-3.4c-14.8-0.1-29.8-0.2-44.7-0.2l15.3-29l26.1,16.1c2.8,1.7,6.5,0.9,8.3-2c1.7-2.8,0.9-6.5-2-8.3L131.1,2.6 \tc-1.4-0.9-3.1-1.1-4.7-0.7c-1.6,0.4-2.9,1.5-3.7,3l-21.3,40.2c-0.4,0-0.9,0-1.3,0c-19.8,0-39.9,0.1-59.7,0.2c-2.3,0-4.4,1.3-5.4,3.4 \ts-0.7,4.5,0.7,6.3l38.6,49c0,0,0,0,0,0l19.6,25v53.6H67.2c-3.3,0-6,2.7-6,6s2.7,6,6,6h67.7c3.3,0,6-2.7,6-6s-2.7-6-6-6l-28.9,0 \tv-53.4L135.5,91.7z M88.5,95.1c6.8,0.3,14.3,0.5,21.3,0.5c2.6,0,5.1,0,7.4-0.1L100,117.4L86.1,99.7L88.5,95.1z M147.3,57.3 \tl-20.1,25.5c-4.7,0.9-17.6,1-32.4,0.5l13.8-26.1C121.5,57.2,134.4,57.2,147.3,57.3z M95,57.2L81.5,82.7c-3.1-0.2-6.2-0.3-9.2-0.5 \tL52.7,57.3C66.8,57.2,81,57.2,95,57.2z'/> </svg>"
    },
    "hsh-bathroom": {
        "keyWords": {
            "HU": [
                "fürdőszoba"
            ],
            "EN": [
                "bathroom"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bathroom",
        "svg": "<svg version='1.1' id='bathroom' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shower_x5F_shape'> \t<path style='fill:currentColor;' d='M187.7,106.1H57l0-91.4h36.9l0,11.1c-5.4,1.5-9.4,6.5-9.4,12.4v1.3c0,3.3,2.7,6,6,6h18.3 \t\tc3.3,0,6-2.7,6-6v-1.3c0-5.7-3.8-10.6-8.9-12.3l0-17.2c0-1.6-0.6-3.1-1.8-4.2c-1.1-1.1-2.7-1.8-4.2-1.8H51c-1.6,0-3.1,0.6-4.2,1.8 \t\tS45,7.1,45,8.7l0,97.4H12.3c-3.3,0-6,2.7-6,6s2.7,6,6,6h4.3l0,33c0,16.8,14.6,30.9,34.2,34.9l-3.2,4.2c-2,2.6-1.5,6.4,1.2,8.4 \t\tc1.1,0.8,2.4,1.2,3.6,1.2c1.8,0,3.6-0.8,4.8-2.4l7.8-10.3h66.3l7.8,10.3c1.2,1.6,3,2.4,4.8,2.4c1.3,0,2.5-0.4,3.6-1.2 \t\tc2.6-2,3.2-5.8,1.2-8.4l-2.8-3.7c21.2-3,37.3-17.8,37.3-35.5v-32.9h4.4c3.3,0,6-2.7,6-6S191,106.1,187.7,106.1z M171.3,151 \t\tc0,13.3-15,24.1-33.4,24.1H62.1c-18.4,0-33.4-10.8-33.4-24l0-32.9h142.7V151z'/> \t<path style='fill:currentColor;' d='M90.5,60.8c1.1,0,2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2v8C88.5,59.9,89.4,60.8,90.5,60.8z'/> \t<path style='fill:currentColor;' d='M99.6,61.5c1.1,0,2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2v8C97.6,60.6,98.5,61.5,99.6,61.5z'/> \t<path style='fill:currentColor;' d='M108.8,60.8c1.1,0,2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2v8C106.8,59.9,107.7,60.8,108.8,60.8z'/> \t<path style='fill:currentColor;' d='M88.5,76.5c0,1.1,0.9,2,2,2s2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2V76.5z'/> \t<path style='fill:currentColor;' d='M97.6,77.3c0,1.1,0.9,2,2,2s2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2V77.3z'/> \t<path style='fill:currentColor;' d='M106.8,76.5c0,1.1,0.9,2,2,2s2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2V76.5z'/> \t<path style='fill:currentColor;' d='M90.7,97c1.1,0,2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2v8C88.7,96.1,89.6,97,90.7,97z'/> \t<path style='fill:currentColor;' d='M99.9,97.7c1.1,0,2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2v8C97.9,96.8,98.8,97.7,99.9,97.7z'/> \t<path style='fill:currentColor;' d='M109,97c1.1,0,2-0.9,2-2v-8c0-1.1-0.9-2-2-2s-2,0.9-2,2v8C107,96.1,107.9,97,109,97z'/> </g> </svg>"
    },
    "hsh-bed-double": {
        "keyWords": {
            "HU": [
                "franciaágy"
            ],
            "EN": [
                "double bed"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bed-double",
        "svg": "<svg version='1.1' id='bed' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body_x5F_bed' style='fill:currentColor;' d='M200,81.6V11.4c0-6.1-5-11.1-11.1-11.1H99.5l0,0H11c-6.1,0-11,5-11,11.1v65v5.2 \tv5.1v3.1v103.8c0,3.3,2.7,6,6,6h188c3.3,0,6-2.7,6-6V86.7c0-0.5-0.1-0.9-0.2-1.3v-1.9C199.9,82.8,200,82.2,200,81.6z M12,12.4h81.5 \tl0.2,38.2H12V12.4z M187.9,80.7H12v-18h175.9V80.7z M187.9,50.6h-82.1l-0.2-38.2h82.3V50.6z'/> </svg>"
    },
    "hsh-bed-single": {
        "keyWords": {
            "HU": [
                "ágy"
            ],
            "EN": [
                "bed"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bed-single",
        "svg": "<svg version='1.1' id='bed_x5F_simple' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='simplebed_x5F_body' style='fill:currentColor;' d='M146.1,0.1H62.9c-5.9,0-10.8,4.8-10.8,10.8v65.9c0,0.6,0.1,1.1,0.1,1.7v6.2 \tc-0.1,0.5-0.1,1.1-0.1,1.6V194c0,3.3,2.7,6,6,6h92.7c3.3,0,6-2.7,6-6V86.2c0-0.6-0.1-1.1-0.1-1.7v-6.2c0.1-0.5,0.1-1.1,0.1-1.7V10.8 \tC156.9,4.9,152.1,0.1,146.1,0.1z M144.9,75.4H109H64.1V59.1h80.7v16.3H144.9z M144.9,12.1v35H64.2v-35 \tC64.2,12.1,144.9,12.1,144.9,12.1z'/> </svg>"
    },
    "hsh-bedroom": {
        "keyWords": {
            "HU": [
                "hálószoba"
            ],
            "EN": [
                "bedroom"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bedroom",
        "svg": "<svg version='1.1' id='bedroom' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='bed_x5F_shape' style='fill:currentColor;' d='M194.8,108.6v-3.2c0-5.5-2.6-10.4-6.6-13.4V28.4c0-3.3-2.7-6-6-6 \tc-3,0-5.5,2.2-5.9,5.1l-150.5,0c-0.4-2.9-2.9-5.1-5.9-5.1c-3.3,0-6,2.7-6,6v62.2c-5.2,2.8-8.7,8.4-8.7,14.8v3.2 \tc-2.8,0.5-4.8,3-4.8,5.9v26.5v23.5c0,3.3,2.7,6,6,6h27.1c3.3,0,6-2.7,6-6v-17.5h121v17.5c0,3.3,2.7,6,6,6h27.3c3.3,0,6-2.7,6-6 \tv-23.5v-26.5C199.7,111.6,197.6,109.1,194.8,108.6z M169.3,88.7V59.2c0-5.7-4.4-10.4-9.8-10.4H118c-5.4,0-9.8,4.7-9.8,10.4v29.5 \tH93.4V59.2c0-5.7-4.4-10.4-9.8-10.4H42.1c-5.4,0-9.8,4.7-9.8,10.4v29.5h-6.4V39.5l150.3,0v49.2H169.3z M157.3,88.7h-37.2V60.8h37.2 \tV88.7z M44.2,88.7V60.8h37.2v27.9H44.2z M17.2,105.4c0-2.6,2-4.8,4.4-4.8h156.9c2.4,0,4.4,2.1,4.4,4.8v3.1H17.2V105.4z M187.7,158.6 \th-15.3v-17.5c0,0,0-0.1,0-0.1c0-3.3-2.7-6-6-6h-133c-3.1,0-5.7,2.4-6,5.4c0,0.2,0,0.4,0,0.6v17.5H12.3v-17.5v-20.5h175.4v20.5V158.6 \tz'/> </svg>"
    },
    "hsh-bike": {
        "keyWords": {
            "HU": [
                "bicikli",
                "transzport",
                "jármű"
            ],
            "EN": [
                "bicicle",
                "transport",
                "vehicle"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bike",
        "svg": "<svg version='1.1' id='bike' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_bike'> \t<path style='fill:currentColor;' d='M185,25.2c-8.2-8.7-19.3-13.6-31.3-14c-12-0.3-23.3,4-32,12.2c-3.3,3.1-6.1,6.7-8.3,10.6l-17.3-7.7 \t\tl-12.4-6.1l13.8-13c1.7-1.6,1.7-4.2,0.2-5.9c-1.6-1.7-4.2-1.7-5.9-0.2L73.6,18.3c-1,0.9-1.5,2.3-1.2,3.6c0.2,1.3,1.1,2.5,2.3,3.1 \t\tl12.5,6.1L27.5,87.7c-0.1,0.1-0.1,0.1-0.2,0.2L27.2,88c-0.2,0.2-0.3,0.4-0.4,0.6c0,0,0,0.1-0.1,0.1c-0.1,0.2-0.2,0.4-0.3,0.6 \t\tc0,0,0,0.1-0.1,0.1c-0.1,0.2-0.1,0.4-0.2,0.7c0,0.1,0,0.1,0,0.2c0,0.2,0,0.4,0,0.6V91c0,0.2,0,0.4,0.1,0.6v0.1c0,0,0,0,0,0.1 \t\tl5.7,21.5c-5.5,2-10.8,5.2-15.3,9.5c-17.9,17-18.7,45.3-1.7,63.2c8.8,9.3,20.6,14,32.5,14c11,0,22.1-4.1,30.7-12.2 \t\tc16.9-16,18.5-42.1,4.5-60.1l12.2-11.6c0.1-0.1,0.1-0.1,0.2-0.2l0,0c0.6-0.7,1-1.5,1.1-2.5l0,0c0-0.1,0-0.1,0-0.2l2.1-76.8 \t\tl11.7,5.2c-1.4,4.2-2.2,8.6-2.3,13.1c-0.3,11.9,4,23.3,12.2,32c8.8,9.3,20.6,14,32.5,14c11,0,22.1-4.1,30.7-12.2 \t\tC201.1,71.4,201.9,43.1,185,25.2z M83.9,156.3c-0.3,9.7-4.3,18.8-11.4,25.5C57.9,195.6,34.8,195,21,180.4 \t\tc-13.8-14.6-13.2-37.7,1.4-51.5c3.5-3.3,7.5-5.8,11.7-7.5l9.3,35c0.5,1.9,2.2,3.1,4,3.1c0.4,0,0.7,0,1.1-0.1c1.1-0.3,2-1,2.5-1.9 \t\tc0.4-0.2,0.8-0.4,1.2-0.8l24.4-23.2C81.6,140,84.2,147.9,83.9,156.3z M49.8,147.5l-7.5-28.3c1.7-0.3,3.5-0.4,5.3-0.4 \t\tc8.4,0,16.7,2.9,23.5,8.5L49.8,147.5z M77,121.6c-10.4-9.1-24-12.6-36.9-10.5l-3.7-13.9l47.9,17.4L77,121.6z M88.1,107.2l-50-18.1 \t\tL89.9,40L88.1,107.2z M177.5,82.4C162.9,96.2,139.8,95.5,126,81c-6.7-7.1-10.2-16.3-10-26c0.1-3.4,0.7-6.8,1.7-9.9l33.1,14.7 \t\tc0.5,0.2,1.1,0.4,1.7,0.4c1.6,0,3.1-0.9,3.8-2.5c0.9-2.1,0-4.5-2.1-5.5l-33.1-14.7c1.7-2.9,3.8-5.6,6.3-7.9c6.8-6.5,15.7-10,25-10 \t\tc0.3,0,0.7,0,1,0c9.7,0.3,18.8,4.3,25.5,11.4C192.7,45.5,192.1,68.6,177.5,82.4z'/> \t<path style='fill:currentColor;' d='M10.6,97.2c1,0,2.1-0.4,2.9-1.1l17.9-16.9c1.7-1.6,1.7-4.2,0.2-5.9c-1.6-1.7-4.2-1.7-5.9-0.2L7.7,90 \t\tC6,91.6,6,94.2,7.5,95.9C8.4,96.7,9.5,97.2,10.6,97.2z'/> </g> </svg>"
    },
    "hsh-bush": {
        "keyWords": {
            "HU": [
                "bokor",
                "fű",
                "növény"
            ],
            "EN": [
                "bush",
                "grass",
                "plant"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bush",
        "svg": "<svg version='1.1' id='bush' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_bush'> \t<path style='fill:currentColor;' d='M177.1,185.9l-160-0.5l0,0c-3.3,0-6,2.7-6,6s2.7,6,6,6l160,0.5l0,0c3.3,0,6-2.7,6-6 \t\tC183.1,188.6,180.4,186,177.1,185.9z'/> \t<path style='fill:currentColor;' d='M181.6,80.3c7.1-6.4,11.2-15.5,11.2-25.3c0-18.8-15.3-34.1-34.1-34.1c-1.8,0-3.6,0.1-5.3,0.4 \t\tc-4.6-8.2-13.3-13.4-23-13.4c-5.5,0-10.8,1.7-15.2,4.8C107.5,6,97.7,2.2,87.4,2.2c-13.7,0-26.2,6.6-34.1,17.5 \t\tc-3-1.2-6.2-1.8-9.5-1.8c-8.1,0-15.6,3.6-20.6,10c-0.1,0.2-0.3,0.3-0.4,0.5l0,0l-0.1,0.1l0,0c0,0,0,0.1-0.1,0.1c0,0,0,0.1-0.1,0.1 \t\tc-3.3,4.5-5,9.8-5,15.4c0,3.9,0.8,7.6,2.4,11C11.5,61.9,6.5,72.2,6.5,83.3c0,11.5,5.5,22.1,14.4,28.8c-2.6,3.8-4.1,8.3-4.1,13 \t\tc0,8.4,4.5,15.7,11.3,19.7c-3,3.6-4.8,8.2-4.8,13.2c0,11.3,9.2,20.6,20.6,20.6c0.6,0,1.3,0,2-0.1l109.1,0.2l0,0c0.2,0,0.4,0,0.6,0 \t\tc0.1,0,0.1,0,0.2,0c0.1,0,0.2,0,0.3,0c12.1-0.5,21.5-10.5,21.5-22.6c0-5.1-1.8-9.9-4.7-13.8c12.5-6.5,20.7-19.5,20.7-34.2 \t\tC193.5,97.5,189.1,87.5,181.6,80.3z M27.3,31.7l0.1,0.1l0,0L27.3,31.7L27.3,31.7z M160.8,134.4L160.8,134.4c-0.1,0-0.2,0-0.3,0 \t\ts-0.3,0-0.4,0c-0.1,0-0.1,0-0.2,0c-0.1,0-0.3,0-0.4,0c-0.1,0-0.1,0-0.2,0c-0.1,0-0.3,0-0.4,0.1c-0.1,0-0.1,0-0.2,0 \t\tc-0.1,0-0.3,0.1-0.4,0.1c-0.1,0-0.1,0-0.2,0.1c-0.1,0-0.3,0.1-0.4,0.1c-0.1,0-0.1,0-0.2,0.1c-0.2,0.1-0.3,0.1-0.4,0.2H157l0,0 \t\tc-0.2,0.1-0.3,0.2-0.5,0.3l-0.1,0.1c-0.1,0.1-0.2,0.2-0.3,0.3c-0.1,0-0.1,0.1-0.2,0.1c-0.1,0.1-0.2,0.2-0.3,0.3 \t\tc0,0.1-0.1,0.1-0.1,0.2c-0.1,0.1-0.2,0.2-0.3,0.3c0,0.1-0.1,0.1-0.1,0.2c-0.1,0.1-0.2,0.2-0.2,0.4c0,0.1-0.1,0.1-0.1,0.2 \t\tc-0.1,0.1-0.1,0.3-0.2,0.4c0,0,0,0.1-0.1,0.1c-0.1,0.1-0.1,0.3-0.2,0.5v0.1c-0.1,0.2-0.1,0.4-0.1,0.6c0,0.2-0.1,0.4-0.1,0.5 \t\tc0,0.2,0,0.4,0,0.6v0.1c0,0.2,0,0.3,0,0.5c0,0.1,0,0.1,0,0.2c0,0.1,0,0.3,0.1,0.4c0,0.1,0,0.1,0,0.2c0,0.1,0.1,0.3,0.1,0.4 \t\tc0,0.1,0,0.1,0.1,0.2c0,0.1,0.1,0.3,0.1,0.4c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.2,0.2,0.4c0,0.1,0.1,0.1,0.1,0.2 \t\tc0.1,0.1,0.2,0.3,0.3,0.4c0,0,0,0,0,0.1c0.1,0.2,0.2,0.3,0.4,0.5l0,0l0.1,0.1c0.1,0.1,0.2,0.2,0.3,0.3l0.1,0.1 \t\tc0.1,0.1,0.2,0.2,0.3,0.2s0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.2c0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.2 \t\tc0.1,0,0.1,0.1,0.2,0.1c0.1,0,0.2,0.1,0.3,0.1s0.2,0.1,0.2,0.1c0.1,0,0.2,0.1,0.3,0.1s0.2,0,0.3,0.1h0.1h0.1c0.1,0,0.3,0,0.4,0 \t\tc0.1,0,0.1,0,0.2,0c3.7,1.8,6.2,5.6,6.2,9.9c0,5.9-4.6,10.7-10.4,10.9c-0.1,0-0.2,0-0.3,0s-0.2,0-0.3,0l-49.1-0.1l0.1-48.4 \t\tc0.3-1.1,0.3-2.2,0-3.3v-12.6l29-30.6c2.2-2.3,2.1-6-0.2-8.2s-6-2.1-8.2,0.2l-11.2,11.8L95.5,61.4c-2.6-1.9-6.2-1.3-8.1,1.3 \t\tc-1.9,2.6-1.3,6.2,1.3,8.1l18.6,13.6L95.9,96.3c-1,1.1-1.6,2.5-1.6,4v4.5L76.3,91c-2.5-2-6.2-1.5-8.2,1s-1.5,6.2,1,8.2l25.1,19.4 \t\tl0,47.4l-48.7-0.1c-0.2,0-0.4,0-0.6,0c-0.5,0-0.8,0.1-1.2,0.1c-4.9,0-9-4-9-8.9c0-4.4,3.3-8.3,7.7-8.9c0.1,0,0.2,0,0.2,0 \t\tc0.1,0,0.2,0,0.3-0.1c0.1,0,0.2,0,0.2-0.1c0.1,0,0.2-0.1,0.3-0.1s0.2-0.1,0.2-0.1c0.1,0,0.2-0.1,0.3-0.1s0.2-0.1,0.2-0.1 \t\tc0.1,0,0.2-0.1,0.3-0.1s0.2-0.1,0.2-0.1c0.1-0.1,0.2-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.2-0.1,0.2-0.2 \t\tc0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.2 \t\tc0.1-0.1,0.1-0.2,0.2-0.2c0-0.1,0.1-0.2,0.1-0.2c0-0.1,0.1-0.2,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3 \t\ts0.1-0.2,0.1-0.3s0-0.2,0.1-0.3c0-0.1,0-0.2,0.1-0.3s0-0.2,0-0.3s0-0.2,0-0.3s0-0.2,0-0.3s0-0.2,0-0.3s0-0.2,0-0.3s0-0.2,0-0.3 \t\tl-0.2-1.3l0,0l0,0c0-0.1,0-0.2,0-0.2c0-0.1,0-0.2-0.1-0.3c0-0.1,0-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.3s-0.1-0.2-0.1-0.2 \t\tc0-0.1-0.1-0.2-0.1-0.3s-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3 \t\tc0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.2-0.2-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.1 \t\tc-0.1-0.1-0.2-0.1-0.3-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.3-0.2c-0.1,0-0.2-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.3-0.1 \t\ts-0.2-0.1-0.3-0.1s-0.2-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.3-0.1s-0.2-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.3-0.1s-0.1,0-0.2,0 \t\tc-0.1,0-0.2,0-0.4,0c-0.1,0-0.1,0-0.2,0c-0.1,0-0.2,0-0.4,0c-0.1,0-0.2,0-0.2,0c-0.1,0-0.2,0-0.3,0s-0.1,0-0.2,0l0,0c0,0,0,0-0.1,0 \t\tc-0.3,0-0.7,0.1-1.1,0.1c-6.2,0-11.2-5-11.2-11.2c0-3.8,1.9-7.3,5-9.4c0.2-0.1,0.4-0.3,0.5-0.4l0.1-0.1c0.1-0.1,0.3-0.3,0.4-0.4 \t\tl0.1-0.1c0.2-0.2,0.3-0.4,0.5-0.6c0,0,0-0.1,0.1-0.1c0.1-0.2,0.2-0.4,0.3-0.6c0,0,0,0,0-0.1c0,0,0,0,0-0.1s0.1-0.2,0.1-0.3 \t\tc0-0.1,0.1-0.1,0.1-0.2s0.1-0.2,0.1-0.3c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0-0.1,0-0.2s0-0.2,0.1-0.4c0-0.1,0-0.1,0-0.2s0-0.3,0-0.4 \t\ts0-0.2,0-0.2c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.1,0-0.2s-0.1-0.3-0.1-0.4c0,0,0-0.1,0-0.2s-0.1-0.2-0.1-0.4 \t\tc0-0.1,0-0.1-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.2c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0,0,0,0,0-0.1 \t\tl-0.1-0.1c-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.2-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2 \t\tc-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.2-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.2-0.1-0.3-0.2c-0.1,0-0.1-0.1-0.2-0.1 \t\tc-0.1-0.1-0.2-0.1-0.3-0.2c0,0-0.1,0-0.1-0.1c-8.8-3.9-14.5-12.7-14.5-22.3c0-8.9,4.8-17.1,12.6-21.4c1.5-0.8,2.6-2.3,2.9-4 \t\ts-0.1-3.4-1.2-4.8c-2.1-2.6-3.2-5.7-3.2-9.1c0-3.2,1-6.2,2.8-8.6l0.1-0.2l0.1-0.1c2.8-3.6,7-5.6,11.5-5.6c3,0,5.8,0.9,8.2,2.6 \t\tc1.4,1,3.1,1.3,4.7,0.9c1.6-0.4,3-1.5,3.8-3c5.3-10,15.5-16.2,26.8-16.2c8.9,0,17.3,3.9,23,10.6l0.1,0.1c0.1,0.1,0.1,0.2,0.2,0.2 \t\tc0.1,0.1,0.1,0.1,0.2,0.2l0.1,0.1l0.1,0.1c0.1,0.1,0.2,0.1,0.3,0.2c0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.2 \t\tc0.1,0,0.2,0.1,0.2,0.1c0.1,0,0.2,0.1,0.3,0.1c0.1,0,0.2,0.1,0.3,0.1c0.1,0,0.2,0.1,0.3,0.1c0.1,0,0.2,0.1,0.3,0.1 \t\tc0.1,0,0.2,0,0.2,0.1c0.1,0,0.2,0,0.3,0.1c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0 \t\tc0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3-0.1c0.1,0,0.2,0,0.3-0.1 \t\tc0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.2-0.1,0.3-0.1c0.1,0,0.1-0.1,0.2-0.1 \t\tc0.1-0.1,0.2-0.1,0.3-0.2c0.1,0,0.1-0.1,0.2-0.1c0.1-0.1,0.2-0.1,0.3-0.2l0.1-0.1l0.1-0.1c0.1-0.1,0.2-0.1,0.2-0.2 \t\tc0.1-0.1,0.1-0.1,0.2-0.2l0.1-0.1c2.8-3.2,6.8-5,11.1-5c6.5,0,12.1,4.1,14.1,10.3l0,0l0,0c0.1,0.3,0.2,0.5,0.3,0.8 \t\tc0,0.1,0.1,0.1,0.1,0.2c0.1,0.2,0.3,0.5,0.4,0.7l0.1,0.1c0.2,0.2,0.3,0.4,0.5,0.6l0.1,0.1c0.2,0.2,0.4,0.4,0.6,0.5l0.1,0.1 \t\tc0.2,0.2,0.4,0.3,0.7,0.4c0,0,0,0,0.1,0c0.2,0.1,0.5,0.2,0.7,0.3c0.1,0,0.1,0,0.2,0.1c0.2,0.1,0.5,0.1,0.8,0.2c0.1,0,0.1,0,0.2,0 \t\tc0.2,0,0.5,0.1,0.7,0.1h0.1l0,0c0.3,0,0.5,0,0.8-0.1c0.1,0,0.1,0,0.2,0c0.3,0,0.5-0.1,0.8-0.2l0,0l0,0l0,0c2.2-0.7,4.5-1.1,6.9-1.1 \t\tc12.4,0,22.5,10.1,22.5,22.5c0,8.4-4.6,16-12,19.9c0,0-0.1,0-0.1,0.1c-0.1,0.1-0.2,0.1-0.3,0.2c-0.1,0-0.1,0.1-0.2,0.1 \t\tc-0.1,0.1-0.2,0.1-0.3,0.2c-0.1,0-0.1,0.1-0.2,0.2c-0.1,0.1-0.2,0.1-0.2,0.2c-0.1,0.1-0.1,0.1-0.2,0.2c-0.1,0.1-0.1,0.1-0.2,0.2 \t\tc-0.1,0.1-0.1,0.2-0.2,0.2c-0.1,0.1-0.1,0.1-0.1,0.2c-0.1,0.1-0.1,0.2-0.2,0.3c0,0,0,0.1-0.1,0.1c0,0,0,0.1-0.1,0.1 \t\tc-0.1,0.1-0.1,0.2-0.2,0.3c0,0.1-0.1,0.2-0.1,0.3c0,0.1-0.1,0.2-0.1,0.2c0,0.1-0.1,0.2-0.1,0.3c0,0.1,0,0.1-0.1,0.2 \t\tc0,0.1-0.1,0.2-0.1,0.3c0,0.1,0,0.1,0,0.2s0,0.2-0.1,0.3c0,0.1,0,0.2,0,0.2c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0,0.3 \t\tc0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0,0.2c0,0.1,0,0.2,0.1,0.3c0,0.1,0,0.2,0.1,0.2c0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.3 \t\tc0,0.1,0.1,0.2,0.1,0.2c0,0.1,0.1,0.2,0.1,0.3v0.1c0,0,0,0,0,0.1c0.1,0.2,0.2,0.4,0.4,0.6l0,0c0.1,0.2,0.3,0.4,0.5,0.6l0.1,0.1 \t\tc0.1,0.1,0.3,0.2,0.4,0.4c0.1,0,0.1,0.1,0.2,0.1c0.2,0.1,0.4,0.3,0.6,0.4c8.2,4.9,13.1,13.5,13.1,23.1 \t\tC181.9,120.8,173.1,131.7,160.8,134.4z'/> </g> </svg>"
    },
    "hsh-car": {
        "keyWords": {
            "HU": [
                "autó",
                "kocsi",
                "jármű"
            ],
            "EN": [
                "auto",
                "car",
                "vehicle"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-car",
        "svg": "<svg version='1.1' id='car' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_car'> \t<path style='fill:currentColor;' d='M30.3,155.3l-2-1.3v15.5c0,5.3,5.6,9.7,12.4,9.7h6.5c6.8,0,12.4-4.3,12.4-9.7v-9H48.1 \t\tC41.5,160.5,35.2,158.7,30.3,155.3z'/> \t<path style='fill:currentColor;' d='M168.1,156.3l-0.3,0.2c-4.7,2.7-10.2,4.1-16,4.1h-11.4v9c0,5.3,5.6,9.7,12.4,9.7h6.5 \t\tc6.8,0,12.4-4.3,12.4-9.7v-15.7l-2,1.4C169.2,155.6,168.6,155.9,168.1,156.3z'/> \t<path style='fill:currentColor;' d='M199,71.9c-0.4-1.2-1.1-2.2-2-3.1c-1.6-1.6-3.7-2.4-5.9-2.4H182c-3.6,0-6.6,2.2-7.8,5.4h-4.1l0,0 \t\tL165.7,40c-1.1-5.6-4.2-10.6-8.6-14.1c-6.5-5.2-13.9-5.3-16.9-5H59.9c-3.2-0.3-9.1-0.1-14.9,3.8C37.9,29.6,36,37,35.5,40l-5.2,31.7 \t\tl0,0h-4.7c-0.4-0.9-0.9-1.7-1.6-2.4c-1.6-1.6-3.7-2.4-5.9-2.4H8.8c-4.6,0-8.4,3.7-8.4,8.4c0,2.2,0.9,4.3,2.4,5.9 \t\tc1.6,1.6,3.7,2.4,5.9,2.4H18c3.4,0,6.4-2.1,7.6-5.1h2.7c-5.6,5.7-8.8,13.4-8.8,21.4v24.4c0,8.9,3.9,17.3,10.6,23.2 \t\tc5.6,4.9,12.7,7.6,20.1,7.6h99.5c6.6,0,13-2.1,18.4-6.1c0.1-0.1,0.2-0.2,0.3-0.3c0.5-0.4,1.1-0.8,1.5-1.3 \t\tc6.6-5.9,10.5-14.3,10.5-23V99.9c0-8-3.2-15.7-8.8-21.4h2.9c0.4,0.7,0.9,1.4,1.5,2c1.6,1.6,3.7,2.4,5.9,2.4h9.2 \t\tc3.7,0,6.8-2.4,7.9-5.8c0.3-0.8,0.4-1.7,0.4-2.6v-0.1l0,0C199.5,73.6,199.4,72.7,199,71.9z M52.6,33.7c2.2-1.1,4.5-1.8,7-2.1 \t\tc0.1,0,0.2,0,0.3,0c0.6,0,58.7-0.2,80.5,0c5.4,0,9.9,2.1,13.4,6s5.5,9.2,6.7,14.7c0.8,3.5,1.2,7.1,1.4,10.4c0,0.6,0.1,1.3,0.1,1.9 \t\tc0,0.5,0,1,0,1.5c0.1,2.7,0,5-0.1,6.6c0,0.5,0,1-0.1,1.4c0,0.8-0.1,1.3-0.1,1.4c-0.2,1.8-1.6,3.1-3.4,3.1h-114 \t\tc-1.7,0-3.1-1.2-3.4-2.9C37.6,55.5,42.1,39.4,52.6,33.7z M71.3,97.9c-0.5,0.5-1.1,0.9-1.7,1.1c-0.6,0.3-1.3,0.4-2,0.4h-30 \t\tc-2.8,0-5.2-2.3-5.2-5.2c0-1.1,0.4-2.2,1-3c0.2-0.2,0.3-0.4,0.5-0.6c0.9-1,2.3-1.5,3.7-1.5h30c2.9,0,5.2,2.3,5.2,5.2 \t\tC72.8,95.6,72.2,96.9,71.3,97.9z M166.2,97.8c-1,0.9-2.2,1.5-3.7,1.5h-30c-0.5,0-0.9-0.1-1.4-0.2c-0.1,0-0.2-0.1-0.3-0.1 \t\tc-0.4-0.1-0.8-0.3-1.2-0.6c-0.3-0.2-0.6-0.4-0.8-0.7c-0.2-0.1-0.3-0.3-0.4-0.5c-0.1-0.2-0.2-0.3-0.3-0.5c-0.1-0.1-0.1-0.2-0.2-0.3 \t\tc-0.1-0.1-0.2-0.3-0.2-0.5c-0.1-0.2-0.2-0.4-0.2-0.6c-0.1-0.3-0.1-0.6-0.2-0.9c0-0.2,0-0.3,0-0.5c0-1.4,0.6-2.7,1.5-3.7 \t\tc0.9-1,2.3-1.5,3.7-1.5h30c0.2,0,0.5,0,0.7,0c0.3,0,0.5,0.1,0.8,0.2c0.1,0,0.2,0,0.2,0.1c0.9,0.3,1.7,0.8,2.3,1.5 \t\tc0.1,0.2,0.3,0.3,0.4,0.5c0.1,0.2,0.3,0.4,0.3,0.6c0.3,0.5,0.4,1,0.5,1.5c0,0.3,0.1,0.5,0.1,0.8C167.7,95.6,167.1,96.9,166.2,97.8z \t\t'/> \t<path style='fill:currentColor;' d='M45,74.6h110.5c1.4,0,2.5-1.1,2.5-2.5s-1.1-2.5-2.5-2.5H45c-1.4,0-2.5,1.1-2.5,2.5 \t\tS43.6,74.6,45,74.6z'/> </g> </svg>"
    },
    "hsh-child": {
        "keyWords": {
            "HU": [
                "gyerek"
            ],
            "EN": [
                "children"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-child",
        "svg": "<svg version='1.1' id='child' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_child'> \t<path style='fill:currentColor;' d='M99.9,20.8c-4.2,0-8.4,0.3-12.4,0.9c2.4-18,17.2-21.2,17.2-21.2C87.3-1.3,78,13.4,73.4,24.7 \t\tc-21.3-8.6-38.9,4-38.9,4c10.4-3,18.6-0.5,23.8,2.3c-28.4,15-47.8,44.8-47.8,79.1c0,49.3,40.1,89.4,89.4,89.4s89.3-40.1,89.3-89.4 \t\tC189.3,60.9,149.2,20.8,99.9,20.8z M99.9,187.8c-41.4,0-75.4-32.7-77.4-73.6c-0.1-1.3-0.1-2.6-0.1-4c0-0.9,0-1.9,0.1-2.8 \t\tc0,0,0,0,0.1,0C39.1,99.1,53.1,78,59.6,67c14,12.8,53.2,43.8,105.5,43.8c4,0,8-0.2,12.1-0.6c0.1,0,0.2,0,0.3,0 \t\tc0,2.2-0.1,4.4-0.3,6.6C173.8,156.6,140.4,187.8,99.9,187.8z'/> \t<ellipse style='fill:currentColor;' cx='67.8' cy='120.2' rx='10.2' ry='10.2'/> \t<ellipse style='fill:currentColor;' cx='131.3' cy='120.2' rx='10.2' ry='10.2'/> \t<path style='fill:currentColor;' d='M115.4,158c-16.5,12.4-32.2,0.6-32.9,0c-2.2-1.7-5.3-1.3-7,0.8c-1.7,2.2-1.3,5.3,0.8,7 \t\tc4.5,3.5,13.1,7.7,23,7.7c6.9,0,14.6-2,22-7.6c2.2-1.7,2.6-4.8,1-7C120.7,156.8,117.6,156.4,115.4,158z'/> </g> </svg>"
    },
    "hsh-toy": {
        "keyWords": {
            "HU": [
                "játék",
                "gyerek"
            ],
            "EN": [
                "game",
                "children"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-toy",
        "svg": "<svg version='1.1' id='toy' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_toy'> \t<path style='fill:currentColor;' d='M88.3,103.5H7.6c-3.6,0-6.5,2.9-6.5,6.5v80.7c0,3.6,2.9,6.5,6.5,6.5h80.7c3.6,0,6.5-2.9,6.5-6.5V110 \t\tC94.8,106.4,91.9,103.5,88.3,103.5z M81.7,184.1H14.1v-67.6h67.6V184.1z'/> \t<path style='fill:currentColor;' d='M192.4,103.4h-80.7c-3.6,0-6.5,2.9-6.5,6.5v80.7c0,3.6,2.9,6.5,6.5,6.5h80.7c3.6,0,6.5-2.9,6.5-6.5 \t\tv-80.7C198.9,106.3,196,103.4,192.4,103.4z M185.9,184.1h-67.6v-67.6h67.6V184.1z'/> \t<path style='fill:currentColor;' d='M61.4,96.5H142c3.6,0,6.5-2.9,6.5-6.5V9.3c0-3.6-2.9-6.5-6.5-6.5H61.4c-3.6,0-6.5,2.9-6.5,6.5V90 \t\tC54.8,93.6,57.7,96.5,61.4,96.5z M67.9,15.9h67.6v67.6H67.9V15.9z'/> \t<path style='fill:currentColor;' d='M104.8,34.1c-1.4-2.4-4.9-2.4-6.3,0l-13.3,23c-1.4,2.4,0.3,5.4,3.1,5.4H115c2.8,0,4.5-3,3.1-5.4 \t\tL104.8,34.1z'/> \t<path style='fill:currentColor;' d='M33.9,171.9l14-10.2l14,10.2l-5.4-16.5l14-10.2H53.3c-1.8-5.5-3.6-11-5.4-16.5 \t\tc-1.8,5.5-3.6,11-5.4,16.5H25.3l14,10.2L33.9,171.9z'/> \t \t\t<ellipse transform='matrix(0.7071 -0.7071 0.7071 0.7071 -61.7473 151.5571)' style='fill:currentColor;' cx='152.1' cy='150.3' rx='18.5' ry='18.5'/> </g> </svg>"
    },
    "hsh-bed-children": {
        "keyWords": {
            "HU": [
                "gyerek ágy"
            ],
            "EN": [
                "children bed"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-bed-children",
        "svg": "<svg version='1.1' id='gyerekagy' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_gyerekagy'> \t<path style='fill:currentColor;' d='M193.3,47.9c-3.3,0-6,2.7-6,6V61H12.7l0-7.2c0-3.3-2.7-6-6-6c0,0,0,0,0,0c-3.3,0-6,2.7-6,6l0,12.4 \t\tc0,0.2,0,0.4,0,0.7c0,0.2,0,0.5,0,0.7l0.1,18.6l-0.1,50.1c0,0.2,0,0.4,0,0.6c0,0.2,0,0.4,0,0.6l0,23.6c0,0,0,0,0,0c0,0,0,0,0,0 \t\tl0.1,31.2c0,3.3,2.7,6,6,6c0,0,0,0,0,0c3.3,0,6-2.7,6-6l-0.1-25.1h174.5l0.1,25.2c0,3.3,2.7,6,6,6c0,0,0,0,0,0c3.3,0,6-2.7,6-6 \t\tl-0.1-31.1l0-23.4c0-0.3,0.1-0.6,0.1-0.9c0-0.3,0-0.6-0.1-0.9l0.1-49.9c0,0,0,0,0,0c0,0,0,0,0,0V53.9 \t\tC199.3,50.5,196.6,47.9,193.3,47.9z M139.8,131.1V92.3h20.1l0,38.7H139.8z M105.9,131.1l-0.2-38.7h22.1v38.7H105.9z M40.2,131.1 \t\tl-0.1-38.7h20.8v38.7H40.2z M12.8,92.3h15.3l0.1,38.7H12.8L12.8,92.3z M72.9,92.3h20.7l0.2,38.7h-21V92.3z M171.9,92.3h15.4 \t\tl-0.1,38.7h-15.4L171.9,92.3z M187.3,73v7.3H34.2c0,0,0,0-0.1,0c0,0,0,0,0,0c0,0,0,0-0.1,0H12.8l0-7.3H187.3z M12.7,155.3l0-12.3 \t\th21.5c0,0,0,0,0,0h65.7c0,0,0,0,0,0h65.9c0,0,0,0,0,0h21.3l0,12.3H12.7z'/> \t<path style='fill:currentColor;' d='M69.4,26.5l-2.6,8.1c-0.3,0.8,0,1.7,0.7,2.2c0.7,0.5,1.7,0.5,2.4,0l6.9-5l6.9,5 \t\tc0.4,0.3,0.8,0.4,1.2,0.4s0.8-0.1,1.2-0.4c0.7-0.5,1-1.4,0.7-2.2L84,26.5l6.9-5c0.7-0.5,1-1.4,0.7-2.2c-0.3-0.8-1-1.4-1.9-1.4h-8.5 \t\tl-2.6-8.1c-0.3-0.8-1-1.4-1.9-1.4c-0.9,0-1.6,0.6-1.9,1.4l-2.6,8.1h-8.5c-0.9,0-1.6,0.6-1.9,1.4c-0.3,0.8,0,1.7,0.7,2.2L69.4,26.5z \t\t'/> \t<path style='fill:currentColor;' d='M108.5,38.7l-1.5,4.5c-0.3,0.8,0,1.7,0.7,2.2c0.7,0.5,1.7,0.5,2.4,0l3.9-2.8l3.9,2.8 \t\tc0.4,0.3,0.8,0.4,1.2,0.4s0.8-0.1,1.2-0.4c0.7-0.5,1-1.4,0.7-2.2l-1.5-4.5l3.9-2.8c0.7-0.5,1-1.4,0.7-2.2c-0.3-0.8-1-1.4-1.9-1.4 \t\th-4.8l-1.5-4.5c-0.3-0.8-1-1.4-1.9-1.4s-1.6,0.6-1.9,1.4l-1.5,4.5h-4.8c-0.9,0-1.6,0.6-1.9,1.4c-0.3,0.8,0,1.7,0.7,2.2L108.5,38.7z \t\t'/> \t<path style='fill:currentColor;' d='M126,14.3l-1.6,5c-0.3,0.8,0,1.7,0.7,2.2c0.7,0.5,1.7,0.5,2.4,0l4.3-3.1l4.3,3.1 \t\tc0.4,0.3,0.8,0.4,1.2,0.4s0.8-0.1,1.2-0.4c0.7-0.5,1-1.4,0.7-2.2l-1.6-5l4.3-3.1c0.7-0.5,1-1.4,0.7-2.2c-0.3-0.8-1-1.4-1.9-1.4 \t\th-5.3l-1.6-5c-0.3-0.8-1-1.4-1.9-1.4s-1.6,0.6-1.9,1.4l-1.6,5h-5.3c-0.9,0-1.6,0.6-1.9,1.4c-0.3,0.8,0,1.7,0.7,2.2L126,14.3z'/> </g> </svg>"
    },
    "hsh-controller": {
        "keyWords": {
            "HU": [
                "Kontroller",
                "gyerek"
            ],
            "EN": [
                "controller",
                "children"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-controller",
        "svg": "<svg version='1.1' id='child_x5F_room3' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='gamepad'> \t<path style='fill:currentColor;' d='M162.5,23.9c-0.1,0-0.1,0-0.2,0H38c-0.1,0-0.1,0-0.2,0C16.7,24.1,0.3,54.3,0.3,92.7 \t\tc0,38.6,16.6,68.9,37.7,68.9c16,0,29.8-17.4,35.3-43.9c8.4-0.7,15.4-6.5,17.8-14.4H111c2.2,7.2,8.3,12.7,15.9,14.1 \t\tc5.5,27,19,44.1,35.3,44.1c21.2,0,37.7-30.3,37.7-68.9C200,54.3,183.6,24.1,162.5,23.9z M85.7,35.9h28.4v21.5H85.7V35.9z \t\t M162.3,149.6c-10.5,0-20.8-16.3-24.4-38.8c-0.5-3.2-3.5-5.4-6.7-5c-0.2,0-0.4,0-0.7,0c-4.7,0-8.5-3.8-8.5-8.5c0,0,0,0,0,0 \t\tc0-0.4,0-0.8-0.1-1.2c-0.6-2.7-3-4.8-5.9-4.8c0,0-0.1,0-0.1,0H86.1c0,0-0.1,0-0.1,0c-3.3,0-6,2.7-6,6c0,4.7-3.8,8.5-8.5,8.5 \t\tc-0.6,0-1.2-0.1-1.8-0.2c-0.2,0-0.3-0.1-0.5-0.1c-3.1-0.5-6.1,1.5-6.8,4.6c0,0,0,0,0,0c0,0,0,0,0,0c0,0.1-0.1,0.2-0.1,0.4 \t\tc-3.6,22.7-13.8,39.1-24.4,39.1c-12.2,0-25.7-23.4-25.7-56.9c0-33.5,13.6-56.9,25.7-56.9c0,0,0,0,0,0h13.5c0,0,0,0,0,0h22.1v27.5 \t\tc0,3.3,2.7,6,6,6h40.4c3.3,0,6-2.7,6-6V35.9h21.1c0,0,0,0,0,0h15.1c0,0,0,0,0,0c12.2,0,25.7,23.4,25.7,56.9 \t\tC188,126.3,174.5,149.6,162.3,149.6z'/> \t<path style='fill:currentColor;' d='M60.3,68.7c2.8,0,5-2.2,5-5s-2.2-5-5-5h-8.9v-8.9c0-2.8-2.2-5-5-5s-5,2.2-5,5v8.9h-8.9 \t\tc-2.8,0-5,2.2-5,5s2.2,5,5,5h8.9l-0.1,8.8c0,2.8,2.2,5,4.9,5.1c0,0,0,0,0.1,0c2.7,0,5-2.2,5-4.9l0.1-8.9H60.3z'/> \t<path style='fill:currentColor;' d='M157.6,58.5c3.6,0,6.5-2.9,6.5-6.5s-2.9-6.5-6.5-6.5c-3.6,0-6.5,2.9-6.5,6.5S154,58.5,157.6,58.5z' \t\t/> \t<path style='fill:currentColor;' d='M146.6,70.1c3.6,0,6.5-2.9,6.5-6.5s-2.9-6.5-6.5-6.5c-3.6,0-6.5,2.9-6.5,6.5S143.1,70.1,146.6,70.1z \t\t'/> \t<path style='fill:currentColor;' d='M168.8,56.9c-3.6,0-6.5,2.9-6.5,6.5s2.9,6.5,6.5,6.5c3.6,0,6.5-2.9,6.5-6.5S172.4,56.9,168.8,56.9z' \t\t/> \t<path style='fill:currentColor;' d='M157.7,68.5c-3.6,0-6.5,2.9-6.5,6.5s2.9,6.5,6.5,6.5c3.6,0,6.5-2.9,6.5-6.5S161.3,68.5,157.7,68.5z' \t\t/> \t \t\t<ellipse transform='matrix(0.9871 -0.1602 0.1602 0.9871 -13.5257 11.6012)' style='fill:currentColor;' cx='65.2' cy='89.7' rx='11.6' ry='11.6'/> \t \t\t<ellipse transform='matrix(0.9871 -0.1602 0.1602 0.9871 -12.5967 23.1264)' style='fill:currentColor;' cx='137.1' cy='89.7' rx='11.6' ry='11.6'/> </g> </svg>"
    },
    "hsh-cloudy-two": {
        "keyWords": {
            "HU": [
                "felhős"
            ],
            "EN": [
                "cloudy"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-cloudy-two",
        "svg": "<svg version='1.1' id='cloud_x5F_complex' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shapes' style='fill:currentColor;' d='M160.3,66c-2.8-21.5-21.5-38.2-44-38.2c-14.7,0-28.4,7.3-36.7,19.1 \tc-20.7,1.9-37.3,17.8-40,38c-21.8,2.7-38.8,21.2-38.8,43.5c0,24.2,19.9,43.9,44.4,43.9h0.1H122h0.1c15.2,0,28.7-7.6,36.7-19.1 \tc22.5-2.1,40.3-21,40.3-43.6C199.1,87.2,182.2,68.7,160.3,66z M122.2,160.2C122.2,160.2,122.1,160.2,122.2,160.2H45.3c0,0,0,0-0.1,0 \tc-17.8,0-32.4-14.3-32.4-31.9s14.5-31.9,32.4-31.9c3.3,0,6-2.7,6-6c0-17.6,14.5-31.9,32.4-31.9S116,72.8,116,90.4c0,3.3,2.7,6,6,6 \tc17.9,0,32.4,14.3,32.4,31.9C154.5,145.9,140,160.2,122.2,160.2z M165,139.6c1-3.6,1.5-7.3,1.5-11.2c0-22.3-16.9-40.8-38.8-43.5 \tc-2.3-18-15.7-32.5-33.2-36.9c5.9-5.2,13.6-8.3,21.7-8.3c17.9,0,32.4,14.3,32.4,31.9c0,3.3,2.7,6,6,6c17.9,0,32.4,14.3,32.4,31.9 \tC187.1,123.4,177.8,135.3,165,139.6z'/> </svg>"
    },
    "hsh-cloudy-one": {
        "keyWords": {
            "HU": [
                "felhős"
            ],
            "EN": [
                "cloudy"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-cloudy-one",
        "svg": "<svg version='1.1' id='cloud_x5F_SIMPLE' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='Shape' style='fill:currentColor;' d='M152.3,71c-2.8-26.3-25.2-46.9-52.3-46.9S50.5,44.7,47.7,71C21.3,73.8,0.8,96.2,0.8,123.3 \tc0,29,23.6,52.6,52.6,52.6h0.1h93.1h0.1c29,0,52.6-23.6,52.6-52.6C199.3,96.2,178.7,73.8,152.3,71z M146.7,163.9 \tC146.7,163.9,146.6,163.9,146.7,163.9H53.4c0,0,0,0-0.1,0c-22.4,0-40.6-18.2-40.6-40.6s18.2-40.6,40.6-40.6c3.3,0,6-2.7,6-6 \tc0-22.4,18.2-40.6,40.6-40.6s40.6,18.2,40.6,40.6c0,3.3,2.7,6,6,6c22.4,0,40.6,18.2,40.6,40.6C187.3,145.7,169.1,163.9,146.7,163.9z \t'/> </svg>"
    },
    "hsh-cloud-sun": {
        "keyWords": {
            "HU": [
                "felhős napos"
            ],
            "EN": [
                "sunny cloudy"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-cloud-sun",
        "svg": "<svg version='1.1' id='cloud_x5F_sun' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='beams'> \t<path style='fill:currentColor;' d='M35.6,32.6c-2.4-2.3-6.2-2.2-8.5,0.1c-2.3,2.4-2.2,6.2,0.1,8.5l18,17.4c1.2,1.1,2.7,1.7,4.2,1.7 \t\tc1.6,0,3.1-0.6,4.3-1.8c2.3-2.4,2.2-6.2-0.1-8.5L35.6,32.6z'/> \t<path style='fill:currentColor;' d='M91.7,5.9L91.7,5.9c-3.3,0-6,2.7-6,6v25c0,3.3,2.7,6,6,6l0,0c3.3,0,6-2.7,6-6v-25 \t\tC97.7,8.6,95,5.9,91.7,5.9z'/> \t<path style='fill:currentColor;' d='M156.1,32.6c-2.4-2.3-6.1-2.3-8.5,0l-17.9,18c-2.3,2.3-2.3,6.1,0,8.5c1.2,1.2,2.7,1.7,4.2,1.7 \t\ts3.1-0.6,4.3-1.8l17.9-18C158.5,38.8,158.5,35,156.1,32.6z'/> \t<path style='fill:currentColor;' d='M42.2,135.7l-18,17.5c-2.4,2.3-2.4,6.1-0.1,8.5c1.2,1.2,2.7,1.8,4.3,1.8c1.5,0,3-0.6,4.2-1.7 \t\tl18-17.5c2.4-2.3,2.4-6.1,0.1-8.5C48.3,133.5,44.5,133.4,42.2,135.7z'/> \t<path style='fill:currentColor;' d='M31.4,103.2c3.3,0,6-2.7,6-6s-2.7-6-6-6h-25l0,0c-3.3,0-6,2.7-6,6s2.7,6,6,6H31.4L31.4,103.2z'/> </g> <g id='shape'> \t<path style='fill:none;' d='M54.8,96.9c0,7.1,2,13.8,5.7,19.6c6.1-9.1,15.9-15.4,27.2-17.1c2.1-14.7,12.3-26.8,25.9-31.7 \t\tc-6.3-4.8-14-7.5-22.2-7.5C71.2,60.3,54.8,76.7,54.8,96.9z'/> \t<path style='fill:none;' d='M160.4,111c-3.3,0-6-2.7-6-6c0-15.2-12.4-27.6-27.6-27.6S99.2,89.8,99.2,105c0,3.3-2.7,6-6,6 \t\tc-15.2,0-27.6,12.4-27.6,27.6s12.4,27.6,27.5,27.6l0,0h67.2l0,0c15.2,0,27.5-12.4,27.5-27.6C188,123.4,175.6,111,160.4,111z'/> \t<path style='fill:currentColor;' d='M54.8,96.9c0-20.2,16.4-36.6,36.6-36.6c8.2,0,15.9,2.7,22.2,7.5c4.2-1.5,8.6-2.3,13.3-2.3 \t\tc0.5,0,1.1,0,1.6,0c-9.2-10.8-22.8-17.2-37.1-17.2c-26.8,0-48.6,21.8-48.6,48.6c0,12,4.3,23.2,12.1,32c1.1-4.5,3-8.7,5.6-12.5 \t\tC56.8,110.7,54.8,104,54.8,96.9z'/> \t<path style='fill:currentColor;' d='M166,99.4c-2.7-18.7-18.4-33.2-37.6-33.9c-0.5,0-1.1,0-1.6,0c-4.7,0-9.1,0.8-13.3,2.3 \t\tc-13.6,4.9-23.8,17-25.9,31.7c-11.3,1.6-21.1,8-27.2,17.1c-2.5,3.8-4.4,8-5.6,12.5c-0.8,3.1-1.2,6.3-1.2,9.7 \t\tc0,21.8,17.8,39.6,39.6,39.6c0,0,0,0,0.1,0h67c0,0,0,0,0.1,0c21.8,0,39.6-17.8,39.6-39.6C200,118.7,185.2,102.2,166,99.4z \t\t M160.5,166.2C160.4,166.2,160.4,166.2,160.5,166.2H93.3l0,0c-15.2,0-27.5-12.4-27.5-27.6c0-15.2,12.4-27.6,27.6-27.6 \t\tc3.3,0,6-2.7,6-6c0-15.2,12.4-27.6,27.6-27.6s27.6,12.4,27.6,27.6c0,3.3,2.7,6,6,6c15.2,0,27.6,12.4,27.6,27.6 \t\tC188,153.8,175.6,166.2,160.5,166.2z'/> </g> </svg>"
    },
    "hsh-corridoor": {
        "keyWords": {
            "HU": [
                "folyosó"
            ],
            "EN": [
                "corridor"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-corridoor",
        "svg": "<svg version='1.1' id='corridoor' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shape_x5F_corridoor' style='fill:currentColor;' d='M196.1,0.7c-2.2-0.9-4.8-0.4-6.5,1.3l-45.3,45.3H55.8L10.5,2 \tC8.8,0.3,6.2-0.2,3.9,0.7C1.7,1.6,0.2,3.8,0.2,6.2v187.5c0,2.4,1.5,4.6,3.7,5.5c0.7,0.3,1.5,0.5,2.3,0.5c1.6,0,3.1-0.6,4.2-1.8 \tl45.3-45.3h88.5l45.3,45.3c1.1,1.1,2.7,1.8,4.2,1.8c0.8,0,1.6-0.1,2.3-0.5c2.2-0.9,3.7-3.1,3.7-5.5V6.2 \tC199.8,3.8,198.3,1.6,196.1,0.7z M140.7,140.7h-21.9V83.6c0-1.7-1.3-3-3-3H82c-1.7,0-3,1.3-3,3v57.2H59.3V59.3h81.5V140.7z \t M12.2,20.7l35,35v88.5l-12.2,12.2v-72c0-0.4-0.2-0.9-0.5-1.1l-10.8-9.2c-0.4-0.4-1.1-0.5-1.6-0.2c-0.5,0.2-0.9,0.8-0.9,1.4v95 \tl-9.1,9.1V20.7z M187.8,179.3l-9-9V75.1c0-0.6-0.3-1.1-0.9-1.4c-0.5-0.2-1.2-0.2-1.6,0.2l-10.8,9.3c-0.3,0.3-0.5,0.7-0.5,1.1v72 \tl-12.2-12.2V55.8l35-35V179.3z'/> </svg>"
    },
    "hsh-couch": {
        "keyWords": {
            "HU": [
                "kanapé"
            ],
            "EN": [
                "couch"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-couch",
        "svg": "<svg version='1.1' id='couch' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body_x5F_couch' style='fill:currentColor;' d='M180.7,62.8h-8.3V29.3c0-15.2-12.6-27.5-28.1-27.5H56 \tc-15.5,0-28.1,12.3-28.1,27.5v33.5h-8.3C9,62.8,0.4,71.3,0.4,81.7v13.9v54.3c0,7.6,4.6,14.1,11.2,17.1v13c0,9.4,7.8,17,17.3,17h10 \tc9.5,0,17.3-7.6,17.3-17v-11.2h87.3v11.4c0,9.4,7.8,17,17.3,17h11.4c9.5,0,17.3-7.6,17.3-17v-13.5c6.2-3.1,10.5-9.5,10.5-16.8V95.6 \tV81.7C199.9,71.3,191.3,62.8,180.7,62.8z M187.9,81.7v13.9v54.3c0,3.8-3.2,6.9-7.2,6.9H173v-70v-0.1v-0.1l-0.3-11.8h8.1 \tC184.7,74.8,187.9,77.9,187.9,81.7z M39.9,156.8v-64h121v64H39.9z M160.5,29.3v39.5c0,0.1,0,0.1,0,0.2l0.3,11.8h-54.6v-67h38.2 \tC153.3,13.8,160.5,20.8,160.5,29.3z M39.9,29.3c0-8.5,7.2-15.5,16.1-15.5h38.2v67H39.9V29.3z M12.5,81.7c0-3.8,3.2-6.9,7.2-6.9H28 \tv12v70h-8.3c-4,0-7.2-3.1-7.2-6.9V95.6C12.5,95.6,12.5,81.7,12.5,81.7z M44.2,180c0,2.8-2.4,5-5.3,5H29c-2.9,0-5.3-2.2-5.3-5v-11.2 \th20.5V180z M172.2,185.2h-11.4c-2.9,0-5.3-2.2-5.3-5v-11.4h22v11.4C177.5,183,175.1,185.2,172.2,185.2z'/> </svg>"
    },
    "hsh-back-delete": {
        "keyWords": {
            "HU": [
                "vissza"
            ],
            "EN": [
                "back"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-back-delete",
        "svg": "<svg id='delete1' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 199.71 199.81'><title>delete1</title><g id='delete'><path d='M194,.09H33.73A6,6,0,0,0,28,4.47L.51,98.27a6,6,0,0,0,0,3.37l27.46,94v0a6.39,6.39,0,0,0,.31.83l.09.17a4.82,4.82,0,0,0,.41.69,1.33,1.33,0,0,0,.14.19,6.12,6.12,0,0,0,.4.49l.18.19c.17.16.35.31.53.46l.24.17a6.33,6.33,0,0,0,.61.39l.25.12a3.89,3.89,0,0,0,.51.21l.28.1a5.06,5.06,0,0,0,.67.17l.38.06c.14,0,.29,0,.43,0a3.16,3.16,0,0,0,.32,0H194a6,6,0,0,0,6-6V6.09A6,6,0,0,0,194,.09ZM188,187.9H38.22L12.52,100,38.23,12.09H188Z' transform='translate(-0.27 -0.09)' style='fill:currentColor'/><path d='M105.36,99.66l-35.3,34.68a6,6,0,1,0,8.41,8.57l35.46-34.85,35.31,34.69a6,6,0,1,0,8.41-8.56L122.35,99.5l34.54-34.33a6,6,0,1,0-8.46-8.51L113.78,91.11,79.28,56.82a6,6,0,1,0-8.46,8.51Z' transform='translate(-0.27 -0.09)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-detect": {
        "keyWords": {
            "HU": [
                "detektálás"
            ],
            "EN": [
                "detect"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-detect",
        "svg": "<svg id='detektal' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 198.67 198.67'><title>detektal</title><g id='papirlap'><path d='M97.73,38.94a6,6,0,0,0,6-6V6.67a6,6,0,0,0-6-6H6.66a6,6,0,0,0-6,6V183.8a6,6,0,0,0,6,6l91.06.33h0a6,6,0,0,0,0-12l-85.09-.31V12.67H91.73V32.94A6,6,0,0,0,97.73,38.94Z' transform='translate(-0.66 -0.67)' style='fill:currentColor'/><path d='M59.74,38.94a6,6,0,0,0,.08-12l-27.15-.33h-.08a6,6,0,0,0-.07,12l27.15.33Z' transform='translate(-0.66 -0.67)' style='fill:currentColor'/><path d='M32.66,50.12h-.07a6,6,0,0,0-.05,12l19.59.19h.07a6,6,0,0,0,.06-12Z' transform='translate(-0.66 -0.67)' style='fill:currentColor'/></g><g id='nagyito'><path d='M197.58,189.09,144,135.46a50.47,50.47,0,1,0-8.48,8.49l53.62,53.63a6,6,0,0,0,8.49-8.49ZM65.74,104.26a38.51,38.51,0,1,1,38.51,38.5A38.55,38.55,0,0,1,65.74,104.26Z' transform='translate(-0.66 -0.67)' style='fill:currentColor'/><path d='M120.19,92.11l-22.49,18-2.61-6.84a4,4,0,1,0-7.47,2.84l4.56,12a4,4,0,0,0,2.68,2.43,3.82,3.82,0,0,0,1.06.15,4,4,0,0,0,2.49-.88l26.77-21.42a4,4,0,1,0-5-6.24Z' transform='translate(-0.66 -0.67)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-dining": {
        "keyWords": {
            "HU": [
                "étkező",
                "étkészlet"
            ],
            "EN": [
                "dining"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-dining",
        "svg": "<svg version='1.1' id='dining_x5F_room' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='kes_x5F_villa'> \t<path style='fill:currentColor;' d='M35.6,87.5c-2.5,0-4.5,2-4.5,4.5v88.8c0,2.2-1.8,3.9-3.9,3.9h-0.8c-2.2,0-3.9-1.8-3.9-3.9V76.5 \t\tc0-0.1,0-0.2,0-0.3c0-0.2,0-0.4-0.1-0.5c0-0.1-0.1-0.3-0.1-0.4c0-0.1-0.1-0.3-0.1-0.4c-0.1-0.1-0.1-0.3-0.2-0.4 \t\tc-0.1-0.1-0.1-0.3-0.2-0.4c-0.1-0.1-0.2-0.2-0.3-0.3c-0.1-0.1-0.2-0.2-0.3-0.3c-0.1-0.1-0.2-0.2-0.3-0.3c-0.1-0.1-0.2-0.2-0.3-0.3 \t\tc-0.1-0.1-0.3-0.2-0.5-0.3c-0.1,0-0.2-0.1-0.3-0.2c-1.9-0.8-3.5-2-5-3.5c-3.2-3.2-5-7.4-5-11.9V12.6c0-2.5-2-4.5-4.5-4.5 \t\ts-4.5,2-4.5,4.5V57c0,6.9,2.7,13.4,7.6,18.3c1.5,1.5,3.2,2.8,5,3.9V98c0,1,0,1.9,0,2.9s0,1.9,0,2.9v77c0,7.1,5.8,12.9,12.9,12.9 \t\th0.8c7.1,0,12.9-5.8,12.9-12.9V92C40.1,89.5,38.1,87.5,35.6,87.5z'/> \t<path style='fill:currentColor;' d='M52.7,12.6c0-2.5-2-4.5-4.5-4.5s-4.5,2-4.5,4.5v21.5c0,0,0,0.1,0,0.1V57c0,6.6-3.9,12.7-10,15.4 \t\tc-2.3,1-3.3,3.7-2.2,6c0.8,1.7,2.4,2.6,4.1,2.6c0.6,0,1.3-0.1,1.9-0.4c9.3-4.2,15.3-13.5,15.3-23.6V12.6z'/> \t<path style='fill:currentColor;' d='M19.5,59.3C19.5,59.3,19.5,59.3,19.5,59.3c2.5,0,4.5-2,4.5-4.5l0-41.9c0-2.5-2-4.5-4.5-4.5 \t\tc0,0,0,0,0,0c-2.5,0-4.5,2-4.5,4.5l0,41.9C15,57.3,17,59.3,19.5,59.3z'/> \t<path style='fill:currentColor;' d='M34.3,59.3C34.3,59.3,34.3,59.3,34.3,59.3c2.5,0,4.5-2,4.5-4.5l0-41.9c0-2.5-2-4.5-4.5-4.5 \t\tc0,0,0,0,0,0c-2.5,0-4.5,2-4.5,4.5l0,41.9C29.8,57.3,31.8,59.3,34.3,59.3z'/> \t<path style='fill:currentColor;' d='M199,96.8l0.1-84.1c0-2.5-2-4.5-4.5-4.5c0,0,0,0,0,0c0,0,0,0,0,0h-5.8c-16.1,0-29.2,13.1-29.2,29.2 \t\tv66.8c0,2.5,2,4.5,4.5,4.5s4.5-2,4.5-4.5V37.3c0-11.1,9.1-20.2,20.2-20.2h1.4L190,96.7c0,0,0,0,0,0c0,0.1,0,0.1,0,0.2l0,8.3 \t\tc0,0.1,0,0.2,0,0.2c0,0,0,0,0,0l0,17.9v61.2c-0.3,0.4-1.7,1.4-3.9,1.4h-0.8c-2.2,0-3.7-1-3.9-1.4v-71.9c0-2.5-2-4.5-4.5-4.5 \t\ts-4.5,2-4.5,4.5v72c0,5.8,5.7,10.3,12.9,10.3h0.8c7.2,0,12.9-4.5,12.9-10.3v-61.3l0-18c0.1-1.5,0.1-3,0.1-4.5 \t\tC199.1,99.6,199.1,98.2,199,96.8z'/> \t<path style='fill:currentColor;' d='M66.1,35.7c12-7.4,25.9-11.3,40.1-11.3c14.7,0,29,4.2,41.3,12.1c0.8,0.5,1.8,0.8,2.7,0.8 \t\tc1.6,0,3.3-0.8,4.2-2.3c1.5-2.3,0.8-5.4-1.5-6.9c-13.9-9-30.1-13.7-46.8-13.7c-16.1,0-31.8,4.4-45.4,12.8c-2.4,1.4-3.1,4.5-1.6,6.9 \t\tC60.7,36.4,63.8,37.1,66.1,35.7z'/> \t<path style='fill:currentColor;' d='M157.5,157.7c-14.1,12.7-32.3,19.7-51.3,19.7c-19.3,0-37.8-7.2-51.9-20.3c-2-1.9-5.2-1.8-7.1,0.3 \t\tc-1.9,2-1.8,5.2,0.3,7.1c16,14.8,36.9,23,58.7,23c21.5,0,42.1-7.9,58-22.3c2-1.9,2.2-5,0.4-7.1C162.8,156,159.6,155.9,157.5,157.7z \t\t'/> \t<path style='fill:currentColor;' d='M106,151.9c22,0,41.4-14,48.4-34.8c0.9-2.6-0.5-5.5-3.2-6.3c-2.6-0.9-5.5,0.5-6.3,3.2 \t\tc-5.6,16.7-21.3,28-38.9,28c-22.6,0-41-18.4-41-41s18.4-41,41-41c13.6,0,26.3,6.7,34,18c1.5,2.3,4.7,2.9,6.9,1.3 \t\tc2.3-1.5,2.9-4.7,1.3-6.9c-9.5-14-25.3-22.4-42.3-22.4c-28.1,0-51,22.9-51,51C54.9,129,77.8,151.9,106,151.9z'/> </g> </svg>"
    },
    "hsh-door-closed": {
        "keyWords": {
            "HU": [
                "ajtó",
                "zárva"
            ],
            "EN": [
                "door",
                "closed"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-door-closed",
        "svg": "<svg version='1.1' id='door_x5F_close' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_door'> \t<path style='fill:currentColor;' d='M174.7,0.4H25.3c-3.3,0-6,2.7-6,6v1.3v185.9l0,0c0,3.2,2.5,5.8,5.6,6c0.1,0,0.3,0,0.4,0h149.5 \t\tc0.1,0,0.3,0,0.4,0c3.1-0.2,5.6-2.8,5.6-6l0,0V7.7V6.4C180.7,3.1,178,0.4,174.7,0.4z M168.7,13.7v173.8H31.3V13.7H168.7z'/> \t<path style='fill:currentColor;' d='M39.3,182.3h121.9l0,0h2.3V18.4h-2.3l0,0H39.3l0,0H36v163.9L39.3,182.3L39.3,182.3z M144.6,90.1 \t\tc5.6,0,10.2,4.6,10.2,10.2v0.3c0,1.1-0.2,2.1-0.6,3c0,0.1,0,0.1-0.1,0.2c-1.4,3.9-5.2,6.6-9.6,6.6c-5.6,0-10.2-4.6-10.2-10.2 \t\tC134.4,94.7,139,90.1,144.6,90.1z'/> </g> </svg>"
    },
    "hsh-door-opened": {
        "keyWords": {
            "HU": [
                "ajtó",
                "nyitva"
            ],
            "EN": [
                "door",
                "open"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-door-opened",
        "svg": "<svg version='1.1' id='door_x5F_open' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body_x5F_door' style='fill:currentColor;' d='M174.7,0H25.4h-0.1l0,0l0,0c-0.4,0-0.7,0-1,0.1h-0.1c-0.3,0.1-0.6,0.2-1,0.3 \tc0,0-0.1,0-0.1,0.1c-0.5,0.2-1,0.5-1.5,0.9c-0.1,0.1-0.1,0.1-0.2,0.2l-0.1,0.1C21,1.8,20.8,2,20.6,2.3c0,0,0,0.1-0.1,0.1 \tc-0.2,0.2-0.3,0.5-0.5,0.7c0,0.1-0.1,0.1-0.1,0.2c-0.1,0.3-0.3,0.6-0.4,0.9c0,0.1,0,0.1-0.1,0.2c-0.1,0.3-0.2,0.6-0.2,0.9l0,0l0,0 \tc0,0.2,0,0.5,0,0.7v187.9c0,0.2,0,0.5,0,0.7l0,0v0.1c0,0.3,0.1,0.6,0.2,0.9c0,0.1,0,0.1,0.1,0.2c0.1,0.3,0.2,0.6,0.4,0.9 \tc0,0.1,0.1,0.1,0.1,0.2c0.1,0.3,0.3,0.5,0.5,0.7c0,0,0,0,0,0.1c0.2,0.3,0.4,0.5,0.7,0.7l0.1,0.1c0.1,0.1,0.1,0.1,0.2,0.2 \tc0.1,0.1,0.2,0.1,0.3,0.2c0.1,0.1,0.2,0.2,0.3,0.2c0.2,0.1,0.4,0.2,0.6,0.3c0.1,0.1,0.2,0.1,0.4,0.2c0.2,0.1,0.4,0.1,0.6,0.2 \tc0.1,0,0.2,0.1,0.4,0.1c0.3,0.1,0.7,0.1,1,0.1l0,0h149.5c3.3,0,6-2.7,6-6.1V6.1C180.7,2.7,178,0,174.7,0z M118.5,99.4 \tc0,6.4-2.7,11.5-6.1,11.5s-6.1-5.2-6.1-11.5c0-6.4,2.7-11.5,6.1-11.5S118.5,93,118.5,99.4z M168.7,187.9H72.3 \tc20.2-5.3,40.4-10.6,60.6-15.9c0.6-0.2,1.1-0.4,1.6-0.7c1.8-1.1,2.9-3,2.9-5.2V32.2c0-0.7-0.1-1.4-0.3-2c-0.1-0.3-0.2-0.6-0.4-0.8 \tv-0.1c-0.1-0.1-0.1-0.2-0.2-0.3c-0.8-1.3-2.1-2.3-3.7-2.7l-18.5-4.6c-13-3.2-26-6.4-39-9.6h93.5v175.8H168.7z'/> </svg>"
    },
    "hsh-connector": {
        "keyWords": {
            "HU": [
                "konnektor"
            ],
            "EN": [
                "connector"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-connector",
        "svg": "<svg version='1.1' id='dugalj' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_dugalj'> \t<path style='fill:currentColor;' d='M188.1,0H12.4C5.9,0,0.6,5.3,0.6,11.9v175.7c0,6.6,5.3,11.9,11.9,11.9h175.7 \t\tc6.6,0,11.9-5.3,11.9-11.9V11.9C200,5.3,194.7,0,188.1,0z M190.5,182.5c0,2.8-2.3,5-5,5H15.1c-2.8,0-5-2.3-5-5v-168 \t\tc0-2.8,2.3-5,5-5h170.4c2.8,0,5,2.3,5,5V182.5z'/> \t<path style='fill:currentColor;' d='M159.1,26.9h-117c-7.7,0-13.9,6.1-13.9,13.7v110.3c0,7.6,6.2,13.7,13.9,13.7h117 \t\tc7.7,0,13.9-6.1,13.9-13.7V40.6C173.1,33.1,166.8,26.9,159.1,26.9z M163.1,147c0,4.3-3.5,7.8-7.9,7.8h-109c-4.4,0-7.9-3.5-7.9-7.8 \t\tV44.5c0-4.3,3.5-7.8,7.9-7.8h109c4.4,0,7.9,3.5,7.9,7.8V147z'/> \t<path style='fill:currentColor;' d='M119.9,86.6c-5,0-9.1,4.1-9.1,9.1s4.1,9.1,9.1,9.1s9.1-4.1,9.1-9.1S125,86.6,119.9,86.6z'/> \t<path style='fill:currentColor;' d='M80,86.4c-5,0-9.1,4.1-9.1,9.1s4.1,9.1,9.1,9.1s9.1-4.1,9.1-9.1S85,86.4,80,86.4z'/> \t<path style='fill:currentColor;' d='M100,40.8c-29.9,0-54.3,24.4-54.3,54.3s24.4,54.3,54.3,54.3s54.3-24.4,54.3-54.3 \t\tC154.3,65.1,129.9,40.8,100,40.8z M144.2,93.1c0,0.7,0.1,1.3,0.1,2s0,1.4-0.1,2.1h-5.1v18.6c-6.5,12.2-18.4,21-32.5,23.1v-1.8 \t\tc0-1.8-1.7-3.3-3.9-3.3h-4.1c-2.1,0-3.9,1.5-3.9,3.3v2c-14-1.7-25.9-9.8-32.8-21.4v-21h-6.2c0-0.5,0-1.1,0-1.6s0-1,0-1.5h6.2V72.5 \t\tc6.5-11,17.7-18.9,30.8-21.1v5.5c0,1.6,1.3,2.9,2.9,2.9h10c1.6,0,2.9-1.3,2.9-2.9v-5.2c13.2,2.6,24.4,11.2,30.5,22.7v18.7 \t\tC139,93.1,144.2,93.1,144.2,93.1z'/> </g> </svg>"
    },
    "hsh-edit": {
        "keyWords": {
            "HU": [
                "szerkeszt"
            ],
            "EN": [
                "edit"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-edit",
        "svg": "<svg id='edit' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 198.67 198.33'><title>edit</title><g id='pencil_paper'><path d='M178.92,101.24a6,6,0,0,0-6,6v73.1a6.84,6.84,0,0,1-6.83,6.83H20a6.84,6.84,0,0,1-6.83-6.83V34.22A6.84,6.84,0,0,1,20,27.4h73.1a6,6,0,1,0,0-12H20A18.85,18.85,0,0,0,1.14,34.22V180.34A18.86,18.86,0,0,0,20,199.17H166.09a18.86,18.86,0,0,0,18.83-18.83v-73.1A6,6,0,0,0,178.92,101.24Z' transform='translate(-1.14 -0.83)' style='fill:currentColor'/><path d='M198,25.43,175,2.58a6,6,0,0,0-8.46,0L86.41,82.52l0,0-.27.29L86,83l-.2.27-.15.22-.15.24c0,.09-.11.18-.16.28l0,.05-24.79,48.4a6,6,0,0,0,5.34,8.74,6.06,6.06,0,0,0,2.77-.68l48.23-25.16a5.74,5.74,0,0,0,.53-.32h0a5.94,5.94,0,0,0,.94-.77l79.73-80.32a6,6,0,0,0,0-8.49ZM148.22,37.82l14.64,14.53L114,101.53,99.15,86.76Zm-56,59L104,108.5,79.78,121.14Zm79.08-53-14.6-14.5,14.08-14,14.53,14.42Z' transform='translate(-1.14 -0.83)' style='fill:currentColor'/><path d='M81.41,50.21a6,6,0,0,0-6-6H30.51a6,6,0,1,0,0,12h44.9A6,6,0,0,0,81.41,50.21Z' transform='translate(-1.14 -0.83)' style='fill:currentColor'/><path d='M30.51,64.48a6,6,0,0,0,0,12h22a6,6,0,1,0,0-12Z' transform='translate(-1.14 -0.83)' style='fill:currentColor'/><path d='M150.15,155.29h0a6,6,0,0,0,0-12l-29.22,0h0a6,6,0,0,0,0,12Z' transform='translate(-1.14 -0.83)' style='fill:currentColor'/><path d='M100.47,169.87a6,6,0,0,0,6,6H150.2a6,6,0,0,0,0-12H106.47A6,6,0,0,0,100.47,169.87Z' transform='translate(-1.14 -0.83)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-motor": {
        "keyWords": {
            "HU": [
                "motor"
            ],
            "EN": [
                "motor"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-motor",
        "svg": "<svg version='1.1' id='electro_x5F_motor1' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_em1'> \t<path style='fill:currentColor;' d='M188,46.2h-14.1v-6.1c0-9.4-7.6-17-17-17H42.8c-9.4,0-17,7.6-17,17v37H11.4c-6.3,0-11.3,5.4-11.3,12 \t\tv16.2c0,6.6,5.1,12,11.3,12h14.4v36.9c0,9.4,7.6,17,17,17h114.1c9.4,0,17-7.6,17-17v-6H188c6.5,0,11.8-5.3,11.8-11.8V58 \t\tC199.8,51.5,194.5,46.2,188,46.2z M11.4,107.3c-0.5,0-1.3-0.8-1.3-2V89.1c0-1.2,0.8-2,1.3-2h14.4v20.3L11.4,107.3L11.4,107.3z \t\t M163.9,154.2c0,3.9-3.1,7-7,7H42.8c-3.9,0-7-3.1-7-7V40.1c0-3.9,3.1-7,7-7h114.1c3.9,0,7,3.1,7,7V154.2z M189.8,136.4 \t\tc0,1-0.8,1.8-1.8,1.8h-14.1v-82H188c1,0,1.8,0.8,1.8,1.8V136.4z'/> \t<path style='fill:currentColor;' d='M51.1,53.3h97.7l0,0c2.8,0,5-2.2,5-5s-2.2-5-5-5H51.1l0,0c-2.8,0-5,2.2-5,5 \t\tC46.1,51.1,48.3,53.3,51.1,53.3z'/> \t<path style='fill:currentColor;' d='M148.5,67.8H65.3l0,0c-2.8,0-5,2.2-5,5s2.2,5,5,5h83.2l0,0c2.8,0,5-2.2,5-5S151.3,67.8,148.5,67.8z' \t\t/> \t<path style='fill:currentColor;' d='M148.8,92.2H51.1l0,0c-2.8,0-5,2.2-5,5s2.2,5,5,5h97.7l0,0c2.8,0,5-2.2,5-5 \t\tC153.8,94.4,151.6,92.2,148.8,92.2z'/> \t<path style='fill:currentColor;' d='M148.6,118.5H65.3l0,0c-2.8,0-5,2.2-5,5s2.2,5,5,5h83.3l0,0c2.8,0,5-2.2,5-5 \t\tS151.4,118.5,148.6,118.5z'/> \t<path style='fill:currentColor;' d='M148.5,142.1H50.8l0,0c-2.8,0-5,2.2-5,5s2.2,5,5,5h97.7l0,0c2.8,0,5-2.2,5-5 \t\tC153.5,144.4,151.3,142.1,148.5,142.1z'/> </g> </svg>"
    },
    "hsh-hmv": {
        "keyWords": {
            "HU": [
                "hmv"
            ],
            "EN": [
                "hmv"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-hmv",
        "svg": "<svg version='1.1' id='electro_x5F_motor2' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='frame'> \t<path style='fill:currentColor;' d='M154.9,199.2h-110C28,199.2,13.1,186,8.6,167C3,143.4,0.4,119.1,0.8,94.7c0.4-20.6,3-41.2,7.7-61.1 \t\tC13,14.5,28,1.2,44.9,1.2h110c17,0,31.6,12.9,36.3,32.1c5.1,20.6,7.8,41.9,8,63.2c0.3,23.8-2.4,47.6-8,70.5 \t\tC186.5,186,171.6,199.2,154.9,199.2z M44.9,13.2c-11.3,0-21.5,9.6-24.7,23.2c-4.5,19.1-7,38.8-7.4,58.5 \t\tc-0.4,23.4,2.1,46.7,7.4,69.3c3.2,13.5,13.4,22.9,24.7,22.9h110c11.2,0,21.4-9.4,24.7-23c5.4-22,8-44.7,7.7-67.5 \t\tc-0.3-20.5-2.9-40.8-7.7-60.5c-3.3-13.5-13.5-23-24.7-23L44.9,13.2L44.9,13.2z'/> </g> <g id='gear_x5F_em'> \t<path style='fill:currentColor;' d='M174.3,89.5c0-2-1.5-3.6-3.4-3.9l-12.6-1.8c-1.3-4.8-3.2-9.3-5.7-13.6l7.6-10.2 \t\tc1.2-1.6,1-3.8-0.4-5.2c-4.5-4.6-9.1-9.1-13.6-13.7c-1.4-1.4-3.6-1.6-5.2-0.4l-10.3,7.4c-4.8-2.8-9.9-5-15.2-6.4 \t\tc-0.6-4.2-1.3-8.5-1.9-12.7c-0.3-2-2-3.4-4-3.4l0,0H90.3c-2,0-3.6,1.4-3.9,3.4c-0.7,4.2-1.3,8.4-2,12.6c-5.6,1.5-10.9,3.7-15.8,6.7 \t\tc-3.4-2.4-6.9-4.9-10.3-7.3c-1.6-1.1-3.8-0.9-5.2,0.5L39.7,55.3c-1.4,1.4-1.5,3.6-0.3,5.2c2.6,3.4,5.1,6.8,7.7,10.2 \t\tc-2.7,4.8-4.7,9.9-6,15.2l-12.5,2.2c-1.9,0.3-3.3,2-3.3,4l0.3,19.3c0,2,1.5,3.6,3.5,3.9l12.7,1.6c1.3,4.7,3.3,9.2,5.7,13.5 \t\tc-2.5,3.4-5,6.9-7.6,10.3c-1.2,1.6-1,3.8,0.4,5.2l13.5,13.7c1.4,1.4,3.6,1.6,5.2,0.4c3.4-2.5,6.9-5,10.3-7.6 \t\tc4.8,2.8,9.8,4.9,15.2,6.3c0.7,4.2,1.3,8.3,2,12.5c0.3,1.9,2,3.4,3.9,3.4h19.3l0,0c2,0,3.7-1.4,4-3.4c0.6-4.2,1.2-8.4,1.9-12.5 \t\tc5.3-1.4,10.4-3.5,15.2-6.4l10.4,7.5c1.6,1.2,3.8,1,5.2-0.5c4.5-4.6,9-9.2,13.4-13.8c1.4-1.4,1.5-3.6,0.3-5.2 \t\tc-2.5-3.4-5.1-6.8-7.6-10.2c2.8-4.8,4.8-10,6.2-15.4c3.6-0.6,7.1-1.2,10.7-1.8l1.9-0.3c2-0.3,3.4-2,3.3-4L174.3,89.5z M154.8,107.4 \t\tc-1.6,0.3-2.9,1.5-3.3,3.2c-1.3,6.3-3.7,12.3-7.1,17.8c-0.9,1.4-0.8,3.2,0.2,4.5c2.4,3.2,4.8,6.4,7.2,9.6c-2.9,3-5.8,5.9-8.7,8.9 \t\tl-9.8-7.1c-1.3-1-3.2-1-4.5-0.1c-5.4,3.5-11.3,6-17.5,7.4c-1.6,0.4-2.9,1.7-3.1,3.3l-0.2,1.3c-0.5,3.5-1,7-1.5,10.4H94.1 \t\tc-0.5-3.2-1-6.4-1.5-9.5l-0.4-2.2c-0.3-1.6-1.5-2.9-3.1-3.3c-6.3-1.3-12.2-3.8-17.5-7.3c-1.4-0.9-3.2-0.9-4.5,0.1 \t\tc-3.2,2.4-6.5,4.7-9.7,7.1l-8.7-8.8c2.4-3.2,4.8-6.5,7.1-9.7c1-1.3,1-3.1,0.1-4.5c-3.2-4.9-5.5-10.4-6.8-16.1 \t\tc-0.4-1.6-1.7-2.8-3.4-3l-11.9-1.6l-0.2-12.4l11.8-2.1c1.6-0.3,2.9-1.6,3.2-3.2c1.2-6.3,3.5-12.2,6.9-17.6c0.9-1.4,0.8-3.2-0.2-4.5 \t\tc-2.4-3.2-4.8-6.4-7.3-9.6l8.7-8.9c3,2.1,6,4.3,9,6.4l0.7,0.5c1.4,1,3.2,1,4.5,0.1c5.5-3.7,11.6-6.3,18.1-7.7 \t\tc1.6-0.3,2.8-1.6,3.1-3.3c0.6-4,1.3-8,1.9-11.9h12.4c0.6,4,1.2,8,1.8,11.9c0.2,1.7,1.5,3,3.1,3.3c6.3,1.4,12.2,3.8,17.6,7.4 \t\tc1.4,0.9,3.2,0.9,4.5-0.1l9.7-7c2.9,2.9,5.8,5.9,8.7,8.8l-7.2,9.6c-1,1.3-1.1,3.1-0.2,4.5c3.2,5,5.4,10.4,6.8,16.2 \t\tc0.4,1.6,1.7,2.8,3.3,3.1l11.9,1.7l0.2,12.4C162.7,106.1,158.8,106.8,154.8,107.4z'/> \t<path style='fill:currentColor;' d='M100,67.9c-17.8,0-32.3,14.5-32.3,32.3s14.5,32.3,32.3,32.3s32.3-14.5,32.3-32.3 \t\tS117.8,67.9,100,67.9z M100,126.4c-14.5,0-26.3-11.8-26.3-26.3S85.5,73.9,100,73.9s26.3,11.8,26.3,26.3S114.5,126.4,100,126.4z'/> \t<path style='fill:currentColor;' d='M100.1,78.7c-11.9,0-21.6,9.7-21.6,21.6s9.7,21.6,21.6,21.6s21.6-9.7,21.6-21.6 \t\tS112.1,78.7,100.1,78.7z'/> </g> </svg>"
    },
    "hsh-floor": {
        "keyWords": {
            "HU": [
                "emelet"
            ],
            "EN": [
                "floor"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-floor",
        "svg": "<svg version='1.1' id='emelet' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='arrow222' style='fill:currentColor;' d='M174,92.4l-15.4-15.4l6.2,0c0,0,0,0,0,0c3.3,0,6-2.7,6-6c0-3.3-2.7-6-6-6l-20.6,0 \tc0,0,0,0,0,0c-1.7,0-3.2,0.7-4.3,1.9c-1.2,1.1-1.9,2.7-1.9,4.3l0,20.7c0,3.3,2.7,6,6,6c0,0,0,0,0,0c3.3,0,6-2.7,6-6l0-6.2l15.3,15.4 \tc2.3,2.3,6.1,2.4,8.5,0c0,0,0.1-0.1,0.1-0.1c0,0,0.1,0,0.1-0.1C176.4,98.6,176.4,94.8,174,92.4z'/> <g id='stairs222'> \t<path style='fill:currentColor;' d='M8.3,167.8C8.3,167.8,8.3,167.8,8.3,167.8l141.4-0.1c3.3,0,6-2.7,6-6v-47.2c0-3.3-2.7-6-6-6h-41 \t\tl-0.1-41.3c0-3.3-2.7-6-6-6l-41.2-0.3V20.1c0-3.3-2.7-6-6-6H8.3c-3.3,0-6,2.7-6,6v141.8c0,1.6,0.6,3.1,1.8,4.2 \t\tC5.2,167.2,6.7,167.8,8.3,167.8z M14.3,26.1h35.2v40.8c0,3.3,2.7,6,6,6l41.2,0.3l0.1,41.3c0,3.3,2.7,6,6,6h41v35.2l-129.4,0.1V26.1 \t\tz'/> \t<path style='fill:currentColor;' d='M193.6,176.7H6.4c-3.3,0-6,2.7-6,6s2.7,6,6,6h187.2c3.3,0,6-2.7,6-6S196.9,176.7,193.6,176.7z'/> </g> </svg>"
    },
    "hsh-builder": {
        "keyWords": {
            "HU": [
                "építő"
            ],
            "EN": [
                "builder"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-builder",
        "svg": "<svg version='1.1' id='epito' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='epito_x5F_body'> \t<path style='fill:currentColor;' d='M18.7,103.3h50.9c9.9,0,18-8.1,18-18V34.4c0-9.9-8.1-18-18-18H18.7c-9.9,0-18,8.1-18,18v50.9 \t\tC0.7,95.2,8.8,103.3,18.7,103.3z M12.7,34.4c0-3.3,2.7-6,6-6h50.9c3.3,0,6,2.7,6,6v50.9c0,3.3-2.7,6-6,6H18.7c-3.3,0-6-2.7-6-6 \t\tC12.7,85.3,12.7,34.4,12.7,34.4z'/> \t<path style='fill:currentColor;' d='M70.5,108.3h-51c-9.9,0-18,8.1-18,18v50.9c0,9.9,8.1,18,18,18h50.9c9.9,0,18-8.1,18-18v-50.9 \t\tC88.5,116.4,80.4,108.3,70.5,108.3z M76.5,177.3c0,3.3-2.7,6-6,6h-51c-3.3,0-6-2.7-6-6v-50.9c0-3.3,2.7-6,6-6h50.9c3.3,0,6,2.7,6,6 \t\tL76.5,177.3L76.5,177.3z'/> \t<path style='fill:currentColor;' d='M163.4,110.5h-50.9c-9.9,0-18,8.1-18,18v50.9c0,9.9,8.1,18,18,18h50.9c9.9,0,18-8.1,18-18v-50.9 \t\tC181.4,118.6,173.4,110.5,163.4,110.5z M169.4,179.4c0,3.3-2.7,6-6,6h-50.9c-3.3,0-6-2.7-6-6v-50.9c0-3.3,2.7-6,6-6h50.9 \t\tc3.3,0,6,2.7,6,6V179.4z'/> \t<path style='fill:currentColor;' d='M196.7,52.4L168.9,9.7C163.5,1.4,152.4-1,144,4.4l-42.7,27.8C93,37.6,90.6,48.8,96,57.1l27.8,42.7 \t\tc3.4,5.3,9.2,8.2,15.1,8.2c3.4,0,6.8-0.9,9.8-2.9l42.7-27.8C199.8,71.9,202.1,60.7,196.7,52.4z M142.2,95c-2.8,1.8-6.5,1-8.3-1.8 \t\tl-27.8-42.7c-1.8-2.8-1-6.5,1.8-8.3l42.7-27.8c1-0.7,2.1-1,3.3-1c2,0,3.9,1,5,2.7l27.8,42.7c1.8,2.8,1,6.5-1.8,8.3L142.2,95z'/> \t<path style='fill:currentColor;' d='M32.8,84.7h22.8C63,84.7,69,78.6,69,71.2V48.4c0-7.4-6-13.5-13.5-13.5H32.8 \t\tc-7.4,0-13.5,6.1-13.5,13.5v22.8C19.3,78.6,25.3,84.7,32.8,84.7z M22.3,48.4c0-5.8,4.7-10.5,10.5-10.5h22.8 \t\tc5.8,0,10.5,4.7,10.5,10.5v22.8c0,5.8-4.7,10.5-10.5,10.5H32.8c-5.8,0-10.5-4.7-10.5-10.5V48.4z'/> \t<path style='fill:currentColor;' d='M55.5,127.6H32.8c-7.4,0-13.5,6.1-13.5,13.5v22.8c0,7.4,6.1,13.5,13.5,13.5h22.8 \t\tc7.4,0,13.5-6.1,13.5-13.5v-22.8C69,133.6,63,127.6,55.5,127.6z M66,163.8c0,5.8-4.7,10.5-10.5,10.5H32.8 \t\tc-5.8,0-10.5-4.7-10.5-10.5V141c0-5.8,4.7-10.5,10.5-10.5h22.8c5.8,0,10.5,4.7,10.5,10.5L66,163.8L66,163.8z'/> \t<path style='fill:currentColor;' d='M149.4,129.1h-22.8c-7.4,0-13.5,6.1-13.5,13.5v22.8c0,7.4,6.1,13.5,13.5,13.5h22.8 \t\tc7.4,0,13.5-6.1,13.5-13.5v-22.8C162.9,135.1,156.8,129.1,149.4,129.1z M159.9,165.3c0,5.8-4.7,10.5-10.5,10.5h-22.8 \t\tc-5.8,0-10.5-4.7-10.5-10.5v-22.8c0-5.8,4.7-10.5,10.5-10.5h22.8c5.8,0,10.5,4.7,10.5,10.5V165.3z'/> \t<path style='fill:currentColor;' d='M161,31.6c-4.1-6.2-12.4-8-18.7-4L123.2,40c-3,2-5.1,5-5.8,8.5c-0.7,3.5-0.1,7.1,1.9,10.2l12.4,19.1 \t\tc2.6,4,6.9,6.1,11.3,6.1c2.5,0,5.1-0.7,7.3-2.2l19.1-12.4c3-2,5.1-5,5.8-8.5s0.1-7.1-1.9-10.2L161,31.6z M172.4,60.3 \t\tc-0.6,2.8-2.2,5.1-4.5,6.6l-19.1,12.4c-4.9,3.2-11.4,1.8-14.5-3.1l-12.4-19.1c-1.5-2.3-2-5.1-1.5-7.9c0.6-2.8,2.2-5.1,4.5-6.6 \t\tL144,30.2c1.8-1.1,3.7-1.7,5.7-1.7c3.4,0,6.8,1.7,8.8,4.8l12.4,19.1C172.5,54.7,173,57.5,172.4,60.3z'/> </g> </svg>"
    },
    "hsh-fillagory": {
        "keyWords": {
            "HU": [
                "filagória"
            ],
            "EN": [
                "filagory"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-fillagory",
        "svg": "<svg version='1.1' id='filagoria' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_filagoria'> \t<path style='fill:currentColor;' d='M173.2,111.7l-19.4,23.2v-23.2h-11.3V135L123,111.7h-14.7l34.1,40.7l0,0l-0.2,42.3l0,0l0,0 \t\tc0,2.7,2.5,4.9,5.6,4.9s5.6-2.2,5.6-4.9l0.2-42.3l34.1-40.8h-14.5V111.7z'/> \t<path style='fill:currentColor;' d='M57.5,152.5l34.1-40.7H76.9L57.5,135v-23.2H46.3V135l-19.5-23.2H12.1l34.2,40.8v41.6 \t\tc0,0.2-0.1,0.5-0.1,0.7c0,2.8,2.6,5.1,5.7,5.1s5.7-2.3,5.7-5.1c0-0.4,0-0.7-0.1-1.1L57.5,152.5L57.5,152.5z'/> \t<path style='fill:currentColor;' d='M197.5,101.2L189,65.4c0-0.2-0.1-0.4-0.2-0.6L174.5,4.5c-0.6-2.6-2.8-4.4-5.4-4.4l0,0L31,0.2 \t\tc-2.6,0-4.8,1.8-5.4,4.4l-23,96.6c-0.4,1.7,0,3.6,1,5c1.1,1.4,2.7,2.2,4.4,2.2h184.1c1.7,0,3.3-0.8,4.4-2.2 \t\tC197.5,104.8,197.9,102.9,197.5,101.2z M28.1,42h143.8l4.4,18.7L23.6,60.8L28.1,42z M35.3,11.9l129.4-0.1l4.4,18.5H30.9L35.3,11.9z \t\t M15.1,96.7l5.8-24.2l158.3-0.2l5.8,24.4C185,96.7,15.1,96.7,15.1,96.7z'/> </g> </svg>"
    },
    "hsh-factory-reset": {
        "keyWords": {
            "HU": [
                "gyári beállítás visszaállítása"
            ],
            "EN": [
                "factory reset"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-factory-reset",
        "svg": "<svg version='1.1' id='fact_x5F_reset' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='gear'> \t<path style='fill:currentColor;' d='M138.1,89.2l-1.1-0.1c-0.5-1.7-1-3.3-1.7-4.9l0.8-0.7c4-3.5,4.4-9.6,0.9-13.6l-2.9-3.3 \t\tc-3.5-4-9.6-4.4-13.6-0.9l-0.8,0.7c-2-1.2-4.1-2.2-6.3-3l0-1c0.3-5.3-3.8-9.8-9.1-10.1L99.9,52c-5.3-0.3-9.8,3.8-10.1,9.1l-0.1,1.2 \t\tc-1.7,0.5-3.3,1.1-4.9,1.8l-0.6-0.7c-3.5-4-9.6-4.4-13.6-0.9l-3.3,2.9c-1.9,1.7-3.1,4-3.3,6.6c-0.2,2.6,0.7,5.1,2.4,7l0.8,0.9 \t\tc-1.1,1.9-2.1,4-2.8,6.1l-0.9,0c-5.3-0.3-9.8,3.8-10.1,9.1l-0.2,4.4c-0.1,2.6,0.8,5,2.5,6.9s4.1,3,6.7,3.2l1.3,0.1 \t\tc0.5,1.7,1.1,3.3,1.8,4.9l-0.7,0.6c-4,3.5-4.4,9.6-0.9,13.6l2.9,3.3c3.5,4,9.6,4.4,13.6,0.9l1-0.9c1.7,1,3.6,1.9,5.4,2.6l-0.1,1 \t\tc-0.1,2.6,0.8,5,2.5,6.9c1.7,1.9,4.1,3,6.7,3.2l4.4,0.2c0.2,0,0.3,0,0.5,0c5.1,0,9.4-4,9.6-9.2l0.1-1.1c1.7-0.5,3.3-1,4.9-1.7 \t\tl0.7,0.8c1.7,1.9,4,3.1,6.6,3.3c2.6,0.2,5.1-0.7,7-2.4l3.3-2.9c4-3.5,4.4-9.6,0.9-13.6l-0.7-0.8c1.1-1.8,2-3.7,2.8-5.7l1.1,0.1 \t\tc5.3,0.3,9.8-3.8,10.1-9.1l0.2-4.4C147.5,94,143.4,89.4,138.1,89.2z M141,103.4c0,1-0.5,1.9-1.2,2.5s-1.6,1-2.6,0.9l-3.3-0.2 \t\tc-1.3-0.1-2.6,0.8-3,2.1c-0.9,2.9-2.3,5.7-4,8.3c-0.8,1.1-0.7,2.6,0.2,3.7l2.2,2.5c1.3,1.5,1.2,3.8-0.3,5.1l-3.3,2.9 \t\tc-0.7,0.6-1.7,1-2.6,0.9c-1-0.1-1.9-0.5-2.5-1.2l-2.2-2.5c-0.9-1-2.4-1.3-3.6-0.7c-2.5,1.3-5.1,2.2-7.9,2.8 \t\tc-1.3,0.3-2.3,1.4-2.4,2.8l-0.2,3.4c-0.1,2-1.8,3.5-3.8,3.5l-4.4-0.2h0c-1,0-1.9-0.5-2.5-1.2c-0.7-0.7-1-1.7-0.9-2.6l0.2-3.3 \t\tc0.1-1.4-0.8-2.6-2.1-3c-2.9-0.9-5.6-2.2-8.1-3.8c-0.5-0.3-1.1-0.5-1.7-0.5c-0.7,0-1.4,0.2-2,0.7l-2.6,2.3 \t\tc-1.5,1.3-3.8,1.2-5.1-0.3l-2.9-3.3c-1.3-1.5-1.2-3.8,0.3-5.1l2.4-2.1c1-0.9,1.3-2.4,0.7-3.7c-1.3-2.5-2.3-5.1-2.9-7.8 \t\tc-0.3-1.3-1.4-2.3-2.8-2.3l-3.5-0.2c-1,0-1.9-0.5-2.5-1.2s-1-1.7-0.9-2.6l0.2-4.4c0-1,0.5-1.9,1.2-2.5c0.7-0.7,1.7-1,2.6-0.9 \t\tl3.2,0.2c1.4,0.1,2.6-0.8,3-2.2c0.9-3.1,2.3-6,4-8.6c0.8-1.1,0.7-2.6-0.2-3.6l-2.3-2.6c-0.6-0.7-1-1.7-0.9-2.6 \t\tc0.1-1,0.5-1.9,1.2-2.5l3.3-2.9c1.5-1.3,3.8-1.2,5.1,0.3l2.1,2.4c0.9,1,2.4,1.3,3.6,0.7c2.5-1.3,5.1-2.2,7.8-2.8 \t\tc1.3-0.3,2.3-1.4,2.4-2.8l0.2-3.5c0.1-2,1.8-3.5,3.8-3.5l4.4,0.2c2,0.1,3.6,1.8,3.5,3.8l-0.2,3.2c-0.1,1.4,0.8,2.6,2.1,3 \t\tc3.2,0.9,6.1,2.4,8.9,4.2c1.1,0.8,2.6,0.7,3.7-0.2l2.5-2.2c1.5-1.3,3.8-1.2,5.1,0.3l2.9,3.3c1.3,1.5,1.2,3.8-0.3,5.1l-2.5,2.2 \t\tc-1,0.9-1.3,2.4-0.7,3.6c1.2,2.5,2.2,5.1,2.7,7.9c0.3,1.3,1.4,2.3,2.8,2.4l3.3,0.2c2,0.1,3.6,1.8,3.5,3.8L141,103.4z'/> \t<path style='fill:currentColor;' d='M101.3,76.8C89,76.2,78.5,85.7,77.9,98c-0.3,5.9,1.7,11.7,5.7,16.1c4,4.4,9.5,7,15.4,7.3 \t\tc0.4,0,0.8,0,1.1,0c11.8,0,21.7-9.3,22.3-21.2C123.1,87.9,113.6,77.4,101.3,76.8z M99.4,115.4c-4.3-0.2-8.3-2.1-11.3-5.3 \t\tc-2.9-3.2-4.4-7.4-4.2-11.7c0.4-8.7,7.6-15.5,16.3-15.5c0.3,0,0.5,0,0.8,0c9,0.4,15.9,8.1,15.5,17.1 \t\tC116,108.9,108.3,115.8,99.4,115.4z'/> </g> <path id='arrow' style='fill:currentColor;' d='M170.8,93.9c-3.3,0-6,2.7-6,6c0,35.7-29,64.7-64.7,64.7c-35.7,0-64.7-29-64.7-64.7 \tc0-30.6,21.4-56.3,50-63l-1,1.2c-2.2,2.5-1.9,6.3,0.7,8.5c1.1,1,2.5,1.4,3.9,1.4c1.7,0,3.4-0.7,4.6-2.1l10.9-12.8 \tc1.9-2.2,1.9-5.3,0.2-7.5c0-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c0,0-0.1-0.1-0.1-0.1c0,0-0.1-0.1-0.1-0.1l0,0 \tc0,0-0.1,0-0.1-0.1c0,0-0.1-0.1-0.1-0.1c0,0-0.1-0.1-0.1-0.1L93,15.5l-1.1-1c-2.5-2.2-6.3-1.9-8.5,0.6c-2.2,2.5-1.9,6.3,0.6,8.5 \tl1.2,1c-35.2,7-61.8,38.1-61.8,75.2c0,42.3,34.4,76.7,76.7,76.7s76.7-34.4,76.7-76.7C176.8,96.6,174.1,93.9,170.8,93.9z'/> </svg>"
    },
    "hsh-flower-vase": {
        "keyWords": {
            "HU": [
                "virág",
                "váza",
                "dekorációü"
            ],
            "EN": [
                "flower",
                "vase",
                "decoration"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-flower-vase",
        "svg": "<svg version='1.1' id='flower' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='flower_x5F_body'> \t<path style='fill:currentColor;' d='M147.6,98h-40c2.5-7.2,4.6-17.8,0.8-27.5c-1.2-3.1-4.7-4.6-7.8-3.4c-3.1,1.2-4.6,4.7-3.4,7.8 \t\tc3.2,8.2-0.3,18.2-2.5,23.1h-47c-1.6,0-3.1,0.6-4.2,1.8c-1.1,1.1-1.8,2.7-1.8,4.3v18c0,3.3,2.7,6,6,6h7.5l9.4,67.2 \t\tc0.4,3,3,5.2,5.9,5.2l0,0l54-0.1c3,0,5.5-2.2,5.9-5.1l9.9-67.1h7.1c3.3,0,6-2.7,6-6v-18C153.6,100.7,151,98,147.6,98z M119.5,188.3 \t\tl-43.6,0.1L67.4,128h61L119.5,188.3z M141.6,116h-6.3H60.5h-6.8v-6h44.7l0,0l0,0h43.2V116z'/> \t<path style='fill:currentColor;' d='M158.4,39.1c0-0.1,0-0.2,0-0.3s0-0.2,0-0.3s0-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.3s-0.1-0.2-0.1-0.3 \t\ts-0.1-0.2-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2 \t\tc-0.1-0.1-0.2-0.1-0.2-0.2c-0.1,0-0.2-0.1-0.3-0.1s-0.2-0.1-0.3-0.1s-0.2-0.1-0.3-0.1s-0.1,0-0.2,0h-0.1h-0.1 \t\tc-37.6-2.7-42.2,33-42.2,33.8l0,0l0,0l0,0c0,0.1,0,0.2,0,0.2c0,0.1,0,0.3,0,0.4s0,0.2,0.1,0.3c0,0.1,0,0.2,0.1,0.3 \t\tc0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.2,0.2,0.3c0,0.1,0.1,0.2,0.1,0.2c0.1,0.1,0.1,0.1,0.2,0.2 \t\ts0.1,0.1,0.2,0.2s0.2,0.1,0.2,0.2c0.1,0.1,0.2,0.1,0.2,0.2c0.1,0,0.2,0.1,0.3,0.1c0.1,0,0.2,0.1,0.3,0.1c0.1,0,0.2,0,0.3,0.1 \t\tc0.1,0,0.2,0.1,0.3,0.1l0,0l0,0l0,0c0.1,0,1.2,0.1,2.9,0.1c8.8,0,34.6-2.7,39.4-33.8v-0.1v-0.1C158.4,39.2,158.4,39.2,158.4,39.1z' \t\t/> \t<path style='fill:currentColor;' d='M99.9,63.9L99.9,63.9L99.9,63.9C99.9,63.9,100,63.9,99.9,63.9c0.1,0,0.2,0,0.3,0.1 \t\tc0.1,0,0.1,0,0.2,0s0.3,0,0.4,0c0.2,0,0.3,0,0.5,0c0.1,0,0.2,0,0.2-0.1c0.1,0,0.2,0,0.2-0.1c0.1,0,0.2-0.1,0.2-0.1 \t\tc0.1,0,0.1,0,0.2-0.1c0.1,0,0.1-0.1,0.2-0.1s0.1-0.1,0.2-0.1c0.1-0.1,0.1-0.1,0.2-0.2c0.1,0,0.1-0.1,0.2-0.1 \t\tc0.1-0.1,0.1-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2c0-0.1,0.1-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.2s0-0.1,0.1-0.2 \t\tc0-0.1,0.1-0.2,0.1-0.3c0.1-0.5,12.7-45.3-33.2-60.7h-0.1h-0.1c-0.1,0-0.1,0-0.2,0s-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0 \t\tc-0.1,0-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0.1c-0.1,0-0.2,0-0.3,0.1c-0.1,0-0.2,0.1-0.3,0.1c-0.1,0-0.2,0.1-0.3,0.1 \t\tc-0.1,0-0.2,0.1-0.2,0.2c-0.1,0.1-0.2,0.1-0.2,0.2C67.5,2,67.5,2,67.4,2.1c-0.1-0.1-0.2-0.1-0.3,0c0,0.1-0.1,0.2-0.1,0.2 \t\tc-0.1,0.1-0.1,0.2-0.1,0.2c0,0.1-0.1,0.2-0.1,0.3S66.7,2.9,66.7,3v0.1v0.1C55,50.1,99.2,63.7,99.9,63.9z'/> \t<path style='fill:currentColor;' d='M46.4,64c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0.1,0.3c0,0.1,0,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.2 \t\tc0,0.1,0.1,0.2,0.1,0.3l0,0l0,0l0,0c3.3,5.2,11,12.4,21.6,12.4c4.3,0,9.1-1.2,14.3-4.1c0,0,0,0,0.1-0.1c0,0,0.1,0,0.1-0.1l0.1-0.1 \t\tc0.1-0.1,0.2-0.1,0.2-0.2c0.1-0.1,0.1-0.1,0.2-0.2s0.1-0.2,0.2-0.2c0.1-0.1,0.1-0.2,0.2-0.2c0-0.1,0.1-0.2,0.1-0.3 \t\tc0-0.1,0.1-0.2,0.1-0.3c0-0.1,0.1-0.2,0.1-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3 \t\tc0-0.1,0-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.3c0-0.1,0-0.1-0.1-0.2l-0.1-0.1c0,0,0-0.1-0.1-0.1 \t\tC72,52.4,55.1,56.7,47.8,61.3l0,0l0,0l0,0c-0.1,0-0.1,0.1-0.2,0.1c-0.1,0.1-0.2,0.1-0.3,0.2c-0.1,0.1-0.1,0.1-0.1,0.2 \t\tC47.1,61.9,47,62,47,62.1s-0.1,0.1-0.1,0.2c-0.1,0.1-0.1,0.2-0.2,0.3c0,0.1,0,0.1-0.1,0.2c0,0.1-0.1,0.2-0.1,0.3s0,0.2,0,0.2 \t\tc0,0.1,0,0.2,0,0.3C46.4,63.9,46.4,63.9,46.4,64z'/> </g> </svg>"
    },
    "hsh-flower-head": {
        "keyWords": {
            "HU": [
                "virág",
                "dekorációü"
            ],
            "EN": [
                "flower",
                "decoration"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-flower-head",
        "svg": "<svg version='1.1' id='flower_x5F_symbol' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shepa_x5F_flower'> \t<path style='fill:currentColor;' d='M197.3,86.8c0-22.7-18.5-41.1-41.1-41.1c-5.3,0-10.6,1.1-15.4,3c0.1-0.9,0.1-1.8,0.1-2.7 \t\tc0-22.7-18.5-41.1-41.1-41.1C77,4.9,58.6,23.4,58.6,46.1c0,1.2,0.1,2.4,0.2,3.6c-4.8-2-10.1-3-15.5-3c-22.7,0-41.1,18.5-41.1,41.1 \t\tc0,19,12.9,35,30.5,39.7c-5.8,7.2-9.2,16.3-9.2,25.9c0,22.7,18.5,41.1,41.1,41.1c14.9,0,27.9-7.9,35.1-19.8 \t\tc7.2,11.8,20.3,19.8,35.1,19.8c22.7,0,41.1-18.5,41.1-41.1c0-10-3.6-19.4-9.8-26.7C184,122.3,197.3,106.1,197.3,86.8z M156.2,116 \t\tc-2.1,0-4.1-0.2-6.1-0.6l0,0c-0.1,0-0.2,0-0.3,0s-0.2,0-0.4-0.1c-0.2,0-0.4,0-0.6,0c-3.3,0-6,2.7-6,6c0,0.3,0,0.7,0.1,1 \t\tc0,0.1,0,0.2,0.1,0.3c0,0.2,0.1,0.4,0.2,0.6c0,0.1,0.1,0.2,0.1,0.3c0.1,0.2,0.2,0.4,0.3,0.5s0.1,0.2,0.2,0.3 \t\tc0.1,0.2,0.2,0.3,0.3,0.5c0.1,0.1,0.1,0.2,0.2,0.3c0.1,0.2,0.3,0.3,0.4,0.4c0.1,0.1,0.2,0.2,0.2,0.2c0.2,0.2,0.4,0.3,0.7,0.5 \t\tc0,0,0.1,0,0.1,0.1c0.3,0.2,0.5,0.3,0.8,0.4c10.6,4.7,17.4,15.1,17.4,26.7c0,16.1-13.1,29.1-29.1,29.1c-16.1,0-29.1-13.1-29.1-29.1 \t\tl0,0c0-2.9-2.1-5.3-4.8-5.9c-0.4-0.1-0.8-0.1-1.2-0.1c-3.3,0-6,2.7-6,6c0,16.1-13.1,29.1-29.1,29.1c-16.1,0-29.1-13.1-29.1-29.1 \t\tc0-10.5,5.7-20.2,14.8-25.4l0,0c0,0,0.1,0,0.1-0.1c0.3-0.1,0.5-0.3,0.7-0.5c0.1-0.1,0.2-0.1,0.2-0.2c0.2-0.2,0.4-0.3,0.5-0.5 \t\tc0.1-0.1,0.1-0.1,0.2-0.2c0.2-0.2,0.4-0.5,0.6-0.8l0,0c0.2-0.3,0.3-0.5,0.4-0.8c0-0.1,0.1-0.2,0.1-0.3c0.1-0.2,0.2-0.5,0.2-0.7 \t\tc0-0.1,0-0.2,0.1-0.3c0.1-0.3,0.1-0.7,0.1-1c0-3.3-2.7-6-6-6c-0.3,0-0.5,0-0.8,0c-1.1,0.1-2.2,0.2-3.5,0.2 \t\tc-16.1,0-29.1-13.1-29.1-29.1s13.1-29.1,29.1-29.1c8.6,0,16.8,3.8,22.3,10.4l0.1,0.1c0.1,0.1,0.1,0.2,0.2,0.2 \t\tc0.1,0.1,0.2,0.2,0.3,0.3c0.1,0.1,0.1,0.1,0.2,0.2s0.2,0.2,0.3,0.3c0.1,0.1,0.2,0.1,0.3,0.2c0.1,0.1,0.2,0.2,0.3,0.2 \t\tc0.1,0.1,0.2,0.1,0.3,0.2c0.1,0.1,0.3,0.1,0.4,0.2c0.1,0,0.2,0.1,0.3,0.1c0.1,0.1,0.3,0.1,0.4,0.1s0.2,0.1,0.3,0.1 \t\tc0.2,0,0.3,0.1,0.5,0.1c0.1,0,0.2,0,0.2,0c0.3,0,0.5,0.1,0.8,0.1c3.3,0,6-2.7,6-6c0-0.3,0-0.6-0.1-0.9c0-0.1-0.1-0.2-0.1-0.3 \t\tc0-0.2-0.1-0.4-0.1-0.6c0-0.1-0.1-0.2-0.1-0.3c-0.1-0.2-0.1-0.3-0.2-0.5c-0.1-0.1-0.1-0.2-0.2-0.3s-0.1-0.3-0.2-0.4 \t\tc-3.1-4.7-4.8-10.3-4.8-16C70.6,30,83.7,17,99.7,17c16.1,0,29.1,13.1,29.1,29.1c0,4.8-1.2,9.6-3.5,13.8c-0.1,0.2-0.2,0.5-0.3,0.7 \t\tc0,0.1,0,0.1-0.1,0.2c-0.1,0.3-0.2,0.7-0.3,1v0.1c-0.1,0.3-0.1,0.7-0.1,1V63c0,0.3,0.1,0.7,0.1,1v0.1c0.1,0.3,0.2,0.7,0.3,1 \t\tc0,0,0,0.1,0.1,0.1c0.1,0.3,0.3,0.6,0.5,0.9c0,0,0,0.1,0.1,0.1c0.2,0.3,0.5,0.6,0.7,0.8l0,0l0,0c0.3,0.2,0.5,0.5,0.9,0.7l0.1,0.1 \t\tc0.1,0,0.1,0.1,0.2,0.1c0.2,0.1,0.5,0.2,0.7,0.3c0.1,0,0.1,0,0.2,0.1c0.3,0.1,0.7,0.2,1,0.3h0.1c0.3,0.1,0.7,0.1,1,0.1h0.1 \t\tc0.3,0,0.7-0.1,1-0.1h0.1c0.3-0.1,0.7-0.2,1-0.3c0,0,0.1,0,0.1-0.1c0.3-0.1,0.6-0.3,0.9-0.5c0,0,0.1,0,0.1-0.1 \t\tc0.3-0.2,0.6-0.5,0.8-0.7l0,0c5.5-5.9,13.1-9.1,21.2-9.1c16.1,0,29.1,13.1,29.1,29.1C185.3,102.9,172.3,116,156.2,116z'/> \t<circle style='fill:currentColor;' cx='99.7' cy='105.4' r='33'/> </g> </svg>"
    },
    "hsh-flower": {
        "keyWords": {
            "HU": [
                "virág",
                "dekorációü"
            ],
            "EN": [
                "flower",
                "decoration"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-flower",
        "svg": "<svg version='1.1' id='flower_x5F_3' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='virag'> \t<path style='fill:currentColor;' d='M142.6,38.1c0-11.1-9-20.1-20.1-20.1c-1.4,0-2.9,0.2-4.3,0.5c-1.1-10.1-9.6-18-20-18 \t\tc-10.5,0-19.1,8.1-20,18.4c-1.4-0.3-2.8-0.4-4.2-0.4c-11.1,0-20.1,9-20.1,20.1c0,8.1,4.8,15.1,11.7,18.2c-1.7,3-2.6,6.4-2.6,9.9 \t\tc0,11.1,9,20.1,20.1,20.1c6,0,11.4-2.7,15.1-6.9c3.7,4.2,9.1,6.9,15.1,6.9c11.1,0,20.1-9,20.1-20.1c0-3.7-1-7.2-2.8-10.2 \t\tC137.7,53.3,142.6,46.2,142.6,38.1z M122.6,48.1c-0.7,0-1.4-0.1-2.1-0.2l0,0c-0.3-0.1-0.7-0.1-1-0.1c-2.8,0-5,2.2-5,5 \t\tc0,0.3,0,0.6,0.1,0.8c0,0.1,0,0.2,0.1,0.2c0,0.2,0.1,0.4,0.2,0.6c0,0.1,0.1,0.2,0.1,0.3c0.1,0.2,0.1,0.3,0.2,0.5 \t\tc0,0.1,0.1,0.2,0.1,0.3c0.1,0.1,0.2,0.3,0.3,0.4c0.1,0.1,0.1,0.2,0.2,0.2c0.1,0.1,0.3,0.3,0.4,0.4c0.1,0.1,0.1,0.1,0.2,0.2 \t\tc0.2,0.2,0.4,0.3,0.6,0.5l0,0c0.2,0.1,0.4,0.2,0.6,0.3c3.6,1.6,6,5.2,6,9.2c0,5.6-4.5,10.1-10.1,10.1s-10.1-4.5-10.1-10.1 \t\tc0-2.8-2.2-5-5-5s-5,2.2-5,5c0,5.6-4.5,10.1-10.1,10.1s-10.1-4.5-10.1-10.1c0-3.6,1.9-6.9,5.1-8.7c0.2-0.1,0.5-0.3,0.7-0.4 \t\tc0.1,0,0.1-0.1,0.2-0.1c0.2-0.1,0.3-0.3,0.4-0.4c0.1-0.1,0.1-0.1,0.2-0.2c0.2-0.2,0.3-0.4,0.5-0.6l0,0c0.1-0.2,0.3-0.5,0.4-0.7 \t\tc0-0.1,0.1-0.1,0.1-0.2c0.1-0.2,0.1-0.4,0.2-0.6c0-0.1,0-0.2,0.1-0.2c0-0.3,0.1-0.6,0.1-0.9c0-2.8-2.2-5-5-5c-0.2,0-0.4,0-0.6,0 \t\tl0,0c-0.4,0-0.8,0.1-1.2,0.1c-5.6,0-10.1-4.5-10.1-10.1s4.5-10.1,10.1-10.1c3,0,5.8,1.3,7.7,3.6c0,0,0,0,0,0.1s0.1,0.1,0.2,0.2 \t\tc0.1,0.1,0.2,0.2,0.2,0.3c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.2,0.2,0.3,0.2c0.1,0.1,0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.2 \t\tc0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.2c0.1,0,0.1,0.1,0.2,0.1s0.2,0.1,0.4,0.1c0.1,0,0.1,0,0.2,0.1c0.1,0,0.3,0.1,0.4,0.1 \t\ts0.1,0,0.2,0c0.2,0,0.4,0,0.6,0c2.4,0,4.4-1.7,4.9-4c0.1-0.3,0.1-0.7,0.1-1s0-0.5-0.1-0.8c0-0.1,0-0.2-0.1-0.3 \t\tc0-0.2-0.1-0.3-0.1-0.5c0-0.1-0.1-0.2-0.1-0.3c-0.1-0.1-0.1-0.3-0.2-0.4c0-0.1-0.1-0.2-0.2-0.3c-0.1-0.1-0.1-0.2-0.2-0.3 \t\tc-1.1-1.6-1.6-3.5-1.6-5.5c0-5.6,4.5-10.1,10.1-10.1s10.1,4.5,10.1,10.1c0,1.7-0.4,3.3-1.2,4.8c-0.1,0.1-0.1,0.2-0.1,0.3 \t\tc-0.1,0.2-0.2,0.3-0.2,0.5c-0.1,0.2-0.1,0.3-0.1,0.5s-0.1,0.3-0.1,0.5s0,0.3,0,0.5s0,0.3,0,0.5s0,0.3,0.1,0.5 \t\tc0,0.2,0.1,0.3,0.1,0.5s0.1,0.3,0.1,0.4c0.1,0.2,0.1,0.3,0.2,0.5c0.1,0.1,0.2,0.3,0.2,0.4c0.1,0.1,0.2,0.3,0.3,0.4 \t\tc0.1,0.1,0.2,0.3,0.4,0.4c0.1,0.1,0.1,0.2,0.2,0.2l0.1,0.1c0.1,0.1,0.3,0.2,0.4,0.3c0.1,0.1,0.3,0.2,0.4,0.3l0.1,0.1 \t\tc0.1,0.1,0.2,0.1,0.3,0.1c0.2,0.1,0.3,0.2,0.5,0.2c0.2,0.1,0.3,0.1,0.5,0.1s0.3,0.1,0.5,0.1s0.3,0,0.5,0s0.3,0,0.5,0s0.3,0,0.5-0.1 \t\tc0.2,0,0.3-0.1,0.5-0.1s0.3-0.1,0.4-0.1c0.2-0.1,0.3-0.1,0.5-0.2c0.1-0.1,0.3-0.2,0.4-0.2c0.1-0.1,0.3-0.2,0.4-0.3 \t\tc0.1-0.1,0.3-0.2,0.4-0.4c0.1-0.1,0.2-0.1,0.2-0.2c1.9-2,4.5-3.2,7.3-3.2c5.5,0,10.1,4.5,10.1,10.1 \t\tC132.6,43.6,128.1,48.1,122.6,48.1z'/> \t<path style='fill:currentColor;' d='M98.4,32.2c-7.6,0-13.8,6.2-13.8,13.8s6.2,13.8,13.8,13.8s13.8-6.2,13.8-13.8S106,32.2,98.4,32.2z' \t\t/> </g> <path id='levele' style='fill:currentColor;' d='M148.9,118.7c0-0.1,0-0.2,0-0.2c0-0.1,0-0.3-0.1-0.4c0-0.1-0.1-0.3-0.1-0.4 \ts-0.1-0.3-0.1-0.4s-0.1-0.3-0.2-0.4c-0.1-0.1-0.1-0.2-0.2-0.4c-0.1-0.1-0.1-0.2-0.2-0.4c-0.1-0.1-0.1-0.2-0.2-0.3 \tc-0.1-0.1-0.2-0.2-0.3-0.3c-0.1-0.1-0.1-0.1-0.2-0.2l-0.1-0.1c-0.1-0.1-0.2-0.2-0.3-0.3c-0.1-0.1-0.2-0.2-0.3-0.2 \tc-0.1-0.1-0.2-0.1-0.3-0.2s-0.3-0.1-0.4-0.2c-0.1,0-0.2-0.1-0.3-0.1c-0.1-0.1-0.3-0.1-0.4-0.1c-0.1,0-0.1,0-0.1,0 \tc-0.1,0-0.1,0-0.2,0c-0.2,0-0.3,0-0.5-0.1c-0.1,0-0.3,0-0.4,0c-0.1,0-0.3,0-0.4,0c-0.1,0-0.3,0-0.4,0c-0.1,0-0.3,0.1-0.4,0.1 \tc-0.1,0-0.3,0.1-0.4,0.1c-0.1,0-0.3,0.1-0.4,0.1c-0.1,0.1-0.3,0.1-0.4,0.2c-0.1,0-0.1,0.1-0.2,0.1c-19.4,11.7-30.5,27.3-36.7,41.7 \tL104,95.9c0-2.8-2.3-5-5.1-4.9c-2.8,0-5,2.3-4.9,5.1l0.7,63.9c-6.2-13-16-27.2-31.5-38.9c-0.1,0-0.1-0.1-0.2-0.1 \tc-0.2-0.1-0.3-0.2-0.5-0.3c-0.1-0.1-0.2-0.1-0.3-0.1c-0.2-0.1-0.3-0.2-0.5-0.2c-0.1,0-0.3-0.1-0.4-0.1c-0.2,0-0.3-0.1-0.5-0.1 \tc-0.3,0-0.6,0-0.9,0l0,0c-0.1,0-0.1,0-0.2,0c-0.2,0-0.5,0.1-0.7,0.1c-0.1,0-0.2,0.1-0.3,0.1c-0.2,0.1-0.4,0.1-0.5,0.2 \ts-0.2,0.1-0.3,0.2c-0.2,0.1-0.3,0.2-0.4,0.3c-0.1,0.1-0.2,0.2-0.3,0.2l-0.1,0.1c-0.1,0.1-0.2,0.2-0.2,0.3c-0.1,0.1-0.2,0.2-0.3,0.3 \tc-0.1,0.1-0.2,0.3-0.3,0.5c-0.1,0.1-0.1,0.2-0.2,0.3c-0.1,0.2-0.2,0.4-0.3,0.6c0,0.1-0.1,0.1-0.1,0.2c-0.1,0.3-0.2,0.6-0.2,0.9 \tc0,0.1,0,0.2,0,0.3c0,0.2,0,0.4,0,0.7v0.1c2.3,36,22.4,60.2,34.2,71.5c0.1,0.1,0.2,0.1,0.3,0.2c0.1,0.1,0.3,0.2,0.4,0.3 \ts0.3,0.2,0.4,0.2c0.1,0.1,0.3,0.1,0.4,0.2c0.2,0.1,0.3,0.1,0.5,0.2c0.1,0,0.3,0.1,0.4,0.1c0.2,0,0.4,0.1,0.6,0.1c0.1,0,0.2,0,0.3,0 \tl14.5,0.3h0.1l0,0l0,0l0,0l0,0c0.3,0,0.6,0,0.9-0.1c0.1,0,0.2,0,0.3-0.1c0.2,0,0.4-0.1,0.6-0.2c0.1,0,0.2-0.1,0.3-0.1 \tc0.2-0.1,0.3-0.2,0.5-0.3c0.1-0.1,0.2-0.1,0.3-0.2c0,0,0.1,0,0.1-0.1C122.4,188.7,150.7,163.1,148.9,118.7z'/> </svg>"
    },
    "hsh-garage": {
        "keyWords": {
            "HU": [
                "garázs"
            ],
            "EN": [
                "garage"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-garage",
        "svg": "<svg version='1.1' id='garage' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='car_1_'> \t<path style='fill:currentColor;' d='M45.3,161.5l-1.5-1.3v15.1c0,5.2,4.4,9.4,9.8,9.4h5.1c5.4,0,9.8-4.2,9.8-9.4v-8.7h-9.1 \t\tC54.2,166.6,49.2,164.8,45.3,161.5z'/> \t<path style='fill:currentColor;' d='M153.9,162.4l-0.3,0.2c-3.7,2.6-8.1,3.9-12.6,3.9h-9v8.7c0,5.2,4.4,9.4,9.8,9.4h5.1 \t\tc5.4,0,9.8-4.2,9.8-9.4v-15.3l-1.6,1.4C154.7,161.8,154.3,162.1,153.9,162.4z'/> \t<path style='fill:currentColor;' d='M178.7,97.2c-0.3-0.9-0.8-1.7-1.5-2.5c-1.2-1.2-2.9-1.9-4.6-1.9h-7.3c-2.8,0-5.2,1.8-6.1,4.3H156 \t\tl0,0l-3.5-25c-0.9-4.4-3.3-8.4-6.7-11.1c-5.2-4.1-10.9-4.1-13.3-3.9H69c-2.5-0.2-7.2-0.1-11.7,3c-5.6,3.8-7.1,9.7-7.5,12l-4.1,25 \t\tl0,0H42c-0.3-0.7-0.7-1.3-1.3-1.9c-1.2-1.2-2.9-1.9-4.6-1.9h-7.3c-3.6,0-6.6,2.9-6.6,6.6c0,1.8,0.7,3.4,1.9,4.6 \t\tc1.2,1.2,2.9,1.9,4.6,1.9H36c2.7,0,5-1.6,6-4h2.1c-4.4,4.5-6.9,10.6-6.9,16.9v19.2c0,7,3,13.6,8.4,18.2c4.4,3.8,10,5.9,15.8,5.9 \t\th78.4c5.2,0,10.3-1.7,14.5-4.8c0.1-0.1,0.2-0.1,0.2-0.2c0.4-0.3,0.8-0.7,1.2-1c5.2-4.6,8.2-11.2,8.2-18.2v-19.2 \t\tc0-6.3-2.5-12.4-6.9-16.9h2.3c0.3,0.6,0.7,1.1,1.1,1.6c1.2,1.2,2.9,1.9,4.6,1.9h7.3c2.9,0,5.4-1.9,6.3-4.5c0.2-0.6,0.3-1.3,0.3-2 \t\tv-0.1l0,0C179.1,98.6,178.9,97.9,178.7,97.2z M63.2,67.1c1.7-0.9,3.5-1.4,5.5-1.6c0.1,0,0.2,0,0.3,0c0.5,0,46.2-0.1,63.4,0 \t\tc4.2,0,7.8,1.6,10.6,4.7c2.7,3,4.3,7.3,5.3,11.6c0.6,2.8,0.9,5.6,1.1,8.2c0,0.5,0.1,1,0.1,1.5c0,0.4,0,0.8,0,1.2 \t\tc0.1,2.1,0,3.9-0.1,5.2c0,0.4,0,0.8-0.1,1.1c0,0.6-0.1,1-0.1,1.1c-0.1,1.4-1.3,2.4-2.7,2.4H56.8c-1.3,0-2.4-0.9-2.7-2.3 \t\tC51.5,84.3,55,71.6,63.2,67.1z M78,117.7c-0.4,0.4-0.8,0.7-1.3,0.9c-0.5,0.2-1,0.3-1.5,0.3H51.5c-2.2,0-4.1-1.8-4.1-4.1 \t\tc0-0.9,0.3-1.7,0.8-2.4c0.1-0.2,0.3-0.3,0.4-0.5c0.7-0.8,1.8-1.2,2.9-1.2h23.6c2.3,0,4.1,1.8,4.1,4.1 \t\tC79.2,115.9,78.7,116.9,78,117.7z M152.8,117.7c-0.8,0.7-1.8,1.2-2.9,1.2h-23.6c-0.4,0-0.7-0.1-1.1-0.2c-0.1,0-0.2,0-0.2-0.1 \t\tc-0.3-0.1-0.7-0.3-0.9-0.4c-0.2-0.2-0.4-0.3-0.6-0.5c-0.1-0.1-0.2-0.2-0.3-0.4c-0.1-0.1-0.2-0.3-0.2-0.4c-0.1-0.1-0.1-0.1-0.1-0.2 \t\tc-0.1-0.1-0.1-0.2-0.2-0.4c-0.1-0.1-0.1-0.3-0.2-0.5s-0.1-0.5-0.1-0.7c0-0.1,0-0.3,0-0.4c0-1.1,0.5-2.2,1.2-2.9 \t\tc0.7-0.8,1.8-1.2,2.9-1.2h23.6c0.2,0,0.4,0,0.5,0c0.2,0,0.4,0.1,0.6,0.1c0.1,0,0.1,0,0.2,0.1c0.7,0.2,1.3,0.6,1.8,1.2 \t\tc0.1,0.1,0.2,0.3,0.3,0.4s0.2,0.3,0.3,0.4c0.2,0.4,0.3,0.8,0.4,1.2c0,0.2,0.1,0.4,0.1,0.6C154,115.9,153.5,116.9,152.8,117.7z'/> </g> <g id='frame'> \t<path style='fill:currentColor;' d='M177.7,15.4H22.9c-3.3,0-6,2.7-6,6v20.9c0,3.3,2.7,6,6,6h154.8c3.3,0,6-2.7,6-6V21.4 \t\tC183.7,18.1,181,15.4,177.7,15.4z M171.7,36.2H28.9v-8.9h142.8V36.2z'/> \t<path style='fill:currentColor;' d='M199.7,6.1c0-3.3-2.7-6-6-6H6.8c-3.3,0-6,2.7-6,6L0.6,199.9h12l0.1-187.7h174.9l0.2,187.7h12 \t\tL199.7,6.1z'/> </g> </svg>"
    },
    "hsh-garage-door": {
        "keyWords": {
            "HU": [
                "garázs kapu"
            ],
            "EN": [
                "garage door"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-garage-door",
        "svg": "<svg version='1.1' id='garage_x5F_door' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='body_x5F_garagedoor'> \t<path style='fill:currentColor;' d='M22.3,50.4h155c3.3,0,6-2.7,6-6V23.6c0-3.3-2.7-6-6-6h-155c-3.3,0-6,2.7-6,6v20.8 \t\tC16.3,47.7,19,50.4,22.3,50.4z M28.3,29.6h143v8.8h-143C28.3,38.4,28.3,29.6,28.3,29.6z'/> \t<path style='fill:currentColor;' d='M177.5,55.1h-155c-3.3,0-6,2.7-6,6v20.8c0,3.3,2.7,6,6,6h155c3.3,0,6-2.7,6-6V61.1 \t\tC183.5,57.8,180.8,55.1,177.5,55.1z M171.5,75.9h-143v-8.8h143V75.9z'/> \t<path style='fill:currentColor;' d='M177.3,92.8h-155c-3.3,0-6,2.7-6,6v20.8c0,3.3,2.7,6,6,6h155c3.3,0,6-2.7,6-6V98.8 \t\tC183.3,95.4,180.6,92.8,177.3,92.8z M171.3,113.5h-143v-8.8h143V113.5z'/> \t<path style='fill:currentColor;' d='M176.5,130.4h-155c-3.3,0-6,2.7-6,6v20.8c0,3.3,2.7,6,6,6h155c3.3,0,6-2.7,6-6v-20.8 \t\tC182.5,133.1,179.8,130.4,176.5,130.4z M170.5,151.2h-143v-8.8h143V151.2z'/> \t<path style='fill:currentColor;' d='M176.5,167.4h-155c-3.3,0-6,2.7-6,6v20.8c0,3.3,2.7,6,6,6h155c3.3,0,6-2.7,6-6v-20.8 \t\tC182.5,170.1,179.8,167.4,176.5,167.4z M170.5,188.2h-143v-8.8h143V188.2z'/> \t<path style='fill:currentColor;' d='M199.8,6.5c0-3.3-2.7-6-6-6H6.3c-3.3,0-6,2.7-6,6L0.1,200h12.1l0.1-187.5h175.4l0.2,187.5H200 \t\tL199.8,6.5z'/> </g> </svg>"
    },
    "hsh-delete": {
        "keyWords": {
            "HU": [
                "kuka",
                "törlés"
            ],
            "EN": [
                "garbage",
                "delete"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-delete",
        "svg": "<svg id='garbage' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 157.33 199.73'><title>garbage</title><g id='garbage-2' data-name='garbage'><path d='M174.21,48.6a15.22,15.22,0,0,0-11.28-5H40.72a18.7,18.7,0,0,0-13.85,6.17A21.33,21.33,0,0,0,21.41,65.9l9.25,115.15c.86,10.73,9.17,18.82,19.31,18.82h99.66c10.14,0,18.44-8.09,19.31-18.81l9.67-119.47A17.15,17.15,0,0,0,174.21,48.6ZM157,180.09h0c-.36,4.36-3.58,7.78-7.35,7.78H50c-3.77,0-7-3.42-7.35-7.78L33.37,64.94a9.25,9.25,0,0,1,2.32-7,6.82,6.82,0,0,1,5-2.31H162.93a3.35,3.35,0,0,1,2.46,1.16,5.1,5.1,0,0,1,1.26,3.89Z' transform='translate(-21.34 -0.13)' style='fill:currentColor'/><path d='M142,67.9a5,5,0,0,0-5.48,4.48l-9.85,97.69a5,5,0,0,0,4.47,5.47,4.36,4.36,0,0,0,.51,0,5,5,0,0,0,5-4.5l9.85-97.69A5,5,0,0,0,142,67.9Z' transform='translate(-21.34 -0.13)' style='fill:currentColor'/><path d='M101.06,74.87a5,5,0,0,0-5,5v91.36a5,5,0,0,0,10,0V79.87A5,5,0,0,0,101.06,74.87Z' transform='translate(-21.34 -0.13)' style='fill:currentColor'/><path d='M28.07,32.26H171.93a6,6,0,1,0,0-12H28.07a6,6,0,0,0,0,12Z' transform='translate(-21.34 -0.13)' style='fill:currentColor'/><path d='M80,12.13h42.11a6,6,0,1,0,0-12H80a6,6,0,0,0,0,12Z' transform='translate(-21.34 -0.13)' style='fill:currentColor'/><path d='M63.61,73a5,5,0,1,0-10,1l9.85,97.69a5,5,0,0,0,5,4.5,4.36,4.36,0,0,0,.51,0,5,5,0,0,0,4.48-5.47Z' transform='translate(-21.34 -0.13)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-gate": {
        "keyWords": {
            "HU": [
                "kapu"
            ],
            "EN": [
                "gate"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-gate",
        "svg": "<svg version='1.1' id='gate' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='oszlop'> \t<path style='fill:currentColor;' d='M196.6,30.7h-27.2c-1.7,0-3,1.3-3,3v163.1c0,1.7,1.3,3,3,3h27.2c1.7,0,3-1.3,3-3V33.7 \t\tC199.6,32.1,198.3,30.7,196.6,30.7z M193.6,193.8h-21.2V36.7h21.2V193.8z'/> \t<path style='fill:currentColor;' d='M30.5,30.4h-1.2v-3.8c0-1.3-1-2.3-2.2-2.5L25.7,10c-0.1-1.3-1.2-2.3-2.5-2.3H10.9 \t\tc-1.3,0-2.3,1-2.5,2.2L6.8,24.2c-1.3,0.1-2.2,1.2-2.2,2.5v3.8H3.4c-1.7,0-3,1.3-3,3v163.4c0,1.7,1.3,3,3,3h27.1c1.7,0,3-1.3,3-3 \t\tV33.4C33.5,31.8,32.1,30.4,30.5,30.4z M13.1,12.8h7.8L22,24.2H11.8L13.1,12.8z M9.6,29.2h14.7v1.3H9.6V29.2z M27.5,193.8H6.4V36.4 \t\th21.1V193.8z'/> </g> <g id='wings'> \t<path style='fill:currentColor;' d='M153.9,33.7h-12c-3.4,0-6.1,2.7-6.1,6.1v151c0,3.4,2.7,6.1,6.1,6.1h12c3.4,0,6.1-2.7,6.1-6.1v-151 \t\tC160.1,36.4,157.3,33.7,153.9,33.7z'/> \t<path style='fill:currentColor;' d='M122.5,33.5h-11.9c-3.4,0-6.2,2.8-6.2,6.2v150.9c0,3.4,2.8,6.2,6.2,6.2h11.9c3.4,0,6.2-2.8,6.2-6.2 \t\tV39.7C128.6,36.3,125.9,33.5,122.5,33.5z'/> \t<path style='fill:currentColor;' d='M91.1,33.8h-12c-3.4,0-6.1,2.7-6.1,6.1v151c0,3.4,2.7,6.1,6.1,6.1h12c3.4,0,6.1-2.7,6.1-6.1v-151 \t\tC97.2,36.5,94.5,33.8,91.1,33.8z'/> \t<path style='fill:currentColor;' d='M59.8,33.8h-12c-3.4,0-6.1,2.7-6.1,6.1v151c0,3.4,2.7,6.1,6.1,6.1h12c3.4,0,6.1-2.7,6.1-6.1v-151 \t\tC65.9,36.6,63.2,33.8,59.8,33.8z'/> </g> </svg>"
    },
    "hsh-gate-open": {
        "keyWords": {
            "HU": [
                "kapu",
                "nyitva"
            ],
            "EN": [
                "gate",
                "open"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-gate-open",
        "svg": "<svg version='1.1' id='gate_x5F_open' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='oszlopok'> \t<path style='fill:currentColor;' d='M197,28.5h-27.3c-1.7,0-3,1.3-3,3V197c0,1.7,1.3,3,3,3H197c1.7,0,3-1.3,3-3V31.5 \t\tC200,29.9,198.7,28.5,197,28.5z M194,194h-21.3V34.5H194V194z'/> \t<path style='fill:currentColor;' d='M30.2,28.2h-0.7v-3.9c0-1.4-1-2.6-2.2-2.9l-1.4-14c-0.2-1.5-1.4-2.7-3-2.7H10.6 \t\tc-1.5,0-2.8,1.1-3,2.7L6,21.4c-1.3,0.3-2.3,1.5-2.3,2.9v3.9H3c-1.7,0-3,1.3-3,3V197c0,1.7,1.3,3,3,3h27.2c1.7,0,3-1.3,3-3V31.2 \t\tC33.2,29.6,31.9,28.2,30.2,28.2z M13.3,10.8h6.9l1.1,10.6H12L13.3,10.8z M9.7,27.3h13.8v0.9H9.7V27.3z M27.2,194H6V34.2h21.2V194z' \t\t/> </g> <g id='wings_x5F_open'> \t<path style='fill:currentColor;' d='M160.1,31.2l-6-8.3c-0.5-0.7-1.7-0.4-1.7,0.6c0,54.1,0,108.2,0,162.3c0,0.2,0.1,0.4,0.2,0.6 \t\tc2,2.8,4,5.5,6,8.3c0.5,0.7,1.7,0.4,1.7-0.6V31.8C160.3,31.6,160.2,31.4,160.1,31.2z'/> \t<path style='fill:currentColor;' d='M142,3.6c-0.5-0.7-1.7-0.4-1.7,0.6c0,54.1,0,108.2,0,162.3c0,0.2,0.1,0.4,0.2,0.6c2,2.8,4,5.5,6,8.3 \t\tc0.5,0.7,1.7,0.4,1.7-0.6V12.4c0-0.2-0.1-0.4-0.2-0.6L142,3.6z'/> \t<path style='fill:currentColor;' d='M43.4,23.5l-6,8.3c-0.1,0.2-0.2,0.4-0.2,0.6v162.4c0,0.9,1.2,1.3,1.7,0.6c2-2.8,4-5.5,6-8.3 \t\tc0.1-0.2,0.2-0.4,0.2-0.6c0-54.1,0-108.2,0-162.3C45.1,23.2,43.9,22.8,43.4,23.5z'/> \t<path style='fill:currentColor;' d='M55.4,4.2l-6,8.3c-0.1,0.2-0.2,0.4-0.2,0.6v162.4c0,0.9,1.2,1.3,1.7,0.6c2-2.8,4-5.5,6-8.3 \t\tc0.1-0.2,0.2-0.4,0.2-0.6c0-54.1,0-108.2,0-162.3C57.1,3.8,56,3.4,55.4,4.2z'/> </g> </svg>"
    },
    "hsh-grass": {
        "keyWords": {
            "HU": [
                "fű",
                "növény"
            ],
            "EN": [
                "grass",
                "plant"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-grass",
        "svg": "<svg  version=\"1.1\" id=\"gras\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"shape_x5F_gras\" style=\"fill:currentColor;\" d=\"M198.9,81.4c-0.3-0.8-1.1-1.3-2-1c-3,0.2-5.8,0.7-8.6,1.4 \tc-2.8,0.7-5.6,1.5-8.3,2.5c-5.4,2-10.6,4.6-15.5,7.8c-9.8,6.3-18.3,14.5-25.1,23.9c-1.8,2.3-3.3,4.8-4.9,7.2 \tc-0.5,0.7-0.9,1.5-1.3,2.3c0-3.1,0-6.2,0-9.4c0.2-9.3,0.6-18.6,1.6-27.9c1-9.2,2.5-18.4,5-27.2c1.3-4.4,2.8-8.7,4.8-12.8 \ts4.4-7.9,7.4-11.1l0.1-0.1c0.6-0.6,0.8-1.6,0.3-2.4c-0.5-1-1.8-1.4-2.8-0.9l0,0c-2.3,1.2-4.2,2.4-6.2,3.8c-1.9,1.4-3.8,2.8-5.6,4.3 \tc-3.6,3-7,6.4-10.1,9.9c-6.3,7-11.6,14.9-16,23.2c-2.3,4.1-4.2,8.4-6,12.8c-0.8,2.2-1.8,4.4-2.5,6.6l-1.2,3.3l-1.1,3.4 \tc-0.7,2.4-1.4,4.8-2.1,7.3c-2.3-8.6-5-17-8.1-25.4c-5.8-15.4-13-30.4-22.9-43.7c-2.4-3.3-5.2-6.5-8-9.5c-2.9-3-5.9-5.8-9.2-8.4 \ts-6.8-4.9-10.5-6.7c-1.9-1-3.8-1.8-5.8-2.5c-1-0.3-2-0.7-3-0.9c-1-0.3-2-0.5-3.2-0.6c-0.6-0.1-1.2,0.3-1.4,0.8 \tc-0.3,0.7,0,1.6,0.7,1.9l0,0l0,0c4.9,2.2,9.3,5.5,13.1,9.3s7,8.3,9.8,13C55.9,45,59.8,55.4,62.9,66c3.1,10.6,5.3,21.5,6.9,32.5 \tc0.5,3.2,0.9,6.3,1.3,9.5c-1.3-2.1-2.6-4.3-4-6.3c-7.6-11.5-16.9-21.8-27.7-30.3c-0.7-0.5-1.3-1.1-2-1.6l-2.1-1.5 \tc-1.4-1-2.8-2-4.2-3c-2.9-1.8-5.7-3.7-8.8-5.3c-5.9-3.4-12.2-6-18.6-8.5l0,0c-1.1-0.4-2.4-0.1-3.1,0.9c-0.9,1.2-0.6,2.8,0.5,3.7l0,0 \tc2.2,1.8,4.5,3.9,6.6,6s4.3,4.3,6.3,6.5c4.1,4.4,7.9,9.1,11.6,13.9c7.3,9.6,13.5,19.9,18.8,30.6c2.6,5.4,4.9,10.9,6.9,16.5 \ts3.7,11.3,5.1,17.1c2.3,9.8,3.7,19.8,4.1,29.8H25.3c-3.3,0-6,2.7-6,6s2.7,6,6,6h164.2c3.3,0,6-2.7,6-6s-2.7-6-6-6h-36.9 \tc0-0.8,0-1.6,0-2.3c0-2.4,0.1-4.8,0.2-7.2c0.2-4.8,0.6-9.6,1.3-14.4c1.2-9.6,3.2-19.1,6.3-28.1c1.5-4.6,3.5-8.9,5.7-13.2 \tc1.1-2.1,2.4-4.1,3.6-6.1l2.1-2.9c0.7-1,1.5-1.8,2.2-2.8c3.1-3.6,6.6-6.9,10.5-9.5c4-2.6,8.3-4.6,12.9-6.1l0.4-0.1 \tC198.7,83.1,199.2,82.3,198.9,81.4z M108,103.1l0.9-3.2l1-3.2c0.6-2.2,1.4-4.2,2.1-6.4c1.6-4.2,3.3-8.4,5.2-12.4 \tc3.9-8.1,8.7-15.7,14.4-22.6c2.6-3.2,5.5-6.2,8.5-9.1c-2.3,4.3-4.1,8.8-5.6,13.3c-3,9.2-5,18.6-6.4,28c-1.4,9.4-2.3,18.9-2.9,28.4 \tc-0.5,9-0.8,18-0.8,27c-0.5,1.3-1,2.6-1.5,3.9c-3.7,9.6-6.3,19.5-8.3,29.5h-3.1c-1.8-15.4-4.2-30.8-7.4-46c-0.2-1-0.4-2-0.7-3 \tC104.4,119.1,105.9,111,108,103.1z M67.8,64.5c-3.5-10.8-7.9-21.4-14.1-31c-2.9-4.6-6.3-8.9-10.2-12.7c1.6,1.1,3.1,2.3,4.6,3.6 \tc3,2.6,5.7,5.4,8.3,8.4c2.5,3,5,6.1,7.2,9.5c8.9,13.1,15.1,28,20.1,43.1c4.8,15.2,8.3,30.9,10.9,46.7c2.4,14.6,3.9,29.4,5,44.2h-5.8 \tl-0.3-2.6c-0.2-1.7-0.5-3.4-0.7-5.2c-0.5-3.4-1.2-6.8-1.9-10.2c-1.5-6.7-3.4-13.3-5.6-19.8c-1.4-4.2-3.1-8.3-4.8-12.4 \tc-1.1-9.6-2.5-19.2-4.3-28.7C74,86.3,71.4,75.3,67.8,64.5z M66.6,143.9c-1.7-6.1-3.9-12-6.2-17.9c-2.4-5.8-5.1-11.5-8.1-17 \tc-6-11-13.1-21.4-21-31C27.7,73.7,24,69.5,20,65.6c2.6,1.5,5.1,3.3,7.5,5c1.3,0.9,2.6,2,3.8,3l1.9,1.5c0.6,0.5,1.2,1.1,1.8,1.6 \tc9.8,8.5,18.1,18.5,24.8,29.6c3.4,5.5,6.3,11.3,8.9,17.2s4.8,12,6.6,18.2c1.8,6.2,3.3,12.5,4.5,18.9c0.6,3.2,1.1,6.4,1.4,9.6 \tc0.2,1.6,0.4,3.2,0.5,4.8l0.1,1.3h-9.4C71.6,165.3,69.6,154.4,66.6,143.9z M170,95.5c-0.9,0.9-1.8,1.8-2.7,2.8l-2.5,3 \tc-1.5,2.1-3.1,4.2-4.4,6.4c-2.7,4.4-5.2,8.9-7.2,13.7c-4.1,9.4-6.9,19.3-8.9,29.3c-1,5-1.8,10-2.4,15.1c-0.3,2.5-0.6,5.1-0.8,7.6 \tc-0.1,1-0.1,1.9-0.2,2.9h-14.4c1.3-8.9,3.1-17.8,5.8-26.3c0.9-2.6,1.6-5.2,2.6-7.7l1.4-3.8l1.6-3.7l0.8-1.9l0.9-1.8 \tc0.6-1.2,1.2-2.4,1.8-3.6c1.3-2.4,2.6-4.8,4.1-7c5.8-9.2,13.2-17.3,21.9-23.8c1.5-1.1,3.1-2.2,4.7-3.2 \tC171.5,94.1,170.8,94.8,170,95.5z\"></path> </svg>"
    },
    "hsh-group": {
        "keyWords": {
            "HU": [
                "csoport"
            ],
            "EN": [
                "group"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-group",
        "svg": "<svg version='1.1' id='group' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='group_x5F_shape' style='fill:currentColor;' d='M154.1,119.2l-14,14l-13.8-13.8l18.3-18.3l-19.7-19.7l14-14l14.1,14l36.7-36.7 \tL153,8.2l-36.7,36.7l14,14l-14,14L100,56.6L81.9,74.9L68,61l14.2-14.3L45.7,10.2L9,46.9l36.6,36.5l14-14l13.9,13.9l-18,18l16.3,16.3 \tl-13.9,14l-12.3-12.3L8.8,156.1l36.6,36.5l36.7-36.7l-15.8-15.7l13.9-14l19.7,19.7l17.9-17.9l13.8,13.8L117.4,156l36.6,36.5 \tl36.7-36.7L154.1,119.2z M153.1,25.2l19.6,19.6L153,64.6L133.4,45L153.1,25.2z M45.6,66.5L26,46.9l19.7-19.8l19.6,19.6L45.6,66.5z \t M45.4,175.7l-19.6-19.6l19.7-19.8l19.6,19.6L45.4,175.7z M99.9,128.9l-15.4-15.4l0,0l0,0l-12.1-12l27.7-27.8l12.1,12l0,0l0,0 \tl15.4,15.4L99.9,128.9z M154,175.5L134.4,156l9.9-9.9l0,0l0,0l9.8-9.8l19.6,19.6L154,175.5z'/> </svg>"
    },
    "hsh-users": {
        "keyWords": {
            "HU": [
                "felhasználók",
                "emberek"
            ],
            "EN": [
                "users",
                "people"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-users",
        "svg": "<svg version='1.1' id='group_x5F_users' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='shape_x5F_group'> \t<ellipse style='fill:currentColor;' cx='168' cy='62.7' rx='23.3' ry='21.6'/> \t<path style='fill:currentColor;' d='M172.1,87.9h-7.9c-8.4,0-16,3-21.1,7.7c6.5,6.5,10.5,14.7,10.5,23.6v24.9H200V110 \t\tC200,97.8,187.5,87.9,172.1,87.9z'/> \t<ellipse style='fill:currentColor;' cx='31.7' cy='62.7' rx='23.3' ry='21.6'/> \t<path style='fill:currentColor;' d='M55.7,94.5c-5.1-4.1-12.1-6.6-19.8-6.6H28c-15.5,0-28,9.9-28,22.1v34h44.1v-24.8 \t\tC44.1,109.8,48.5,101.2,55.7,94.5z'/> \t<ellipse style='fill:currentColor;' cx='98.9' cy='47.2' rx='36.3' ry='33.6'/> \t<path style='fill:currentColor;' d='M105.3,86.5H92.9c-23.9,0-43.4,15.5-43.4,34.4v53h99.2v-53C148.7,102,129.2,86.5,105.3,86.5z'/> </g> </svg>"
    },
    "hsh-heating": {
        "keyWords": {
            "HU": [
                "fűtés"
            ],
            "EN": [
                "heating"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-heating",
        "svg": "<svg version='1.1' id='heating' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='frame'> \t<path style='fill:currentColor;' d='M188.3,200H11.9c-6.4,0-11.6-5.2-11.6-11.6V11.6C0.3,5.2,5.5,0,11.9,0h176.5 \t\tc6.4,0,11.6,5.2,11.6,11.6v176.8C199.9,194.8,194.7,200,188.3,200z M15.3,185h169.6V15H15.3V185z'/> </g> <g id='arrows'> \t<g> \t\t<path style='fill:currentColor;' d='M80.5,45.2l-24.4,5.7l4.8,4.7c-3.2,2.8-8.6,8.7-10.3,18c-2,11,1.7,23,11.1,35.7 \t\t\tc7.3,9.9,10.3,18.7,9,26.2c-1.4,7.9-7.2,11.8-7.4,12c-2.8,1.8-3.6,5.5-1.8,8.3c1.1,1.8,3.1,2.8,5.1,2.8c1.1,0,2.2-0.3,3.2-0.9 \t\t\tc0.4-0.3,10.3-6.7,12.7-19.7c2-11-1.7-23-11.1-35.7c-7.3-9.8-10.3-18.7-9-26.2c1.3-7.2,6.1-11.2,7.2-11.9l5,4.8L80.5,45.2 \t\t\tL80.5,45.2z'/> \t</g> \t<g> \t\t<path style='fill:currentColor;' d='M112,46.7l-24.4,5.7l4.8,4.7c-3.2,2.8-8.6,8.7-10.3,18c-2,11,1.7,23,11.1,35.7 \t\t\tc7.3,9.9,10.3,18.7,9,26.2c-1.4,7.9-7.2,11.8-7.4,12c-2.8,1.8-3.6,5.5-1.8,8.3c1.1,1.8,3.1,2.8,5.1,2.8c1.1,0,2.2-0.3,3.2-0.9 \t\t\tc0.4-0.3,10.3-6.7,12.7-19.7c2-11-1.7-23-11.1-35.7c-7.3-9.8-10.3-18.7-9-26.2c1.3-7.2,6.1-11.2,7.2-12l5,4.8L112,46.7L112,46.7z' \t\t\t/> \t</g> \t<g> \t\t<path style='fill:currentColor;' d='M142.9,46.7l-24.4,5.7l4.8,4.7c-3.2,2.8-8.6,8.7-10.3,18c-2,11,1.7,23,11.1,35.7 \t\t\tc7.3,9.9,10.3,18.7,9,26.2c-1.4,7.9-7.2,11.8-7.4,12c-2.8,1.8-3.6,5.5-1.8,8.3c1.1,1.8,3.1,2.8,5.1,2.8c1.1,0,2.2-0.3,3.2-0.9 \t\t\tc0.4-0.3,10.3-6.7,12.7-19.7c2-11-1.7-23-11.1-35.7c-7.3-9.8-10.3-18.7-9-26.2c1.3-7.2,6.1-11.2,7.2-12l5,4.8L142.9,46.7 \t\t\tL142.9,46.7z'/> \t</g> </g> </svg>"
    },
    "hsh-home": {
        "keyWords": {
            "HU": [
                "ház",
                "otthon"
            ],
            "EN": [
                "house",
                "home"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-home",
        "svg": "<svg version='1.1' id='home' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='frame'> \t<path style='fill:currentColor;' d='M172.4,50.2H27.5l0,0c-1.6,0-3.1,0.6-4.2,1.8c-1.1,1.1-1.8,2.7-1.8,4.2v38.3c0,3.3,2.7,6,6,6 \t\ts6-2.7,6-6V62.2h132.9v116.4H27.6c-3.3,0-6,2.7-6,6s2.7,6,6,6h144.9c3.3,0,6-2.7,6-6V56.2C178.4,52.9,175.7,50.2,172.4,50.2z'/> \t<path style='fill:currentColor;' d='M195.3,31.7l-94-25.3c-1-0.3-2.1-0.3-3.1,0L4.7,31.7c-3.2,0.9-5.1,4.2-4.2,7.4 \t\tc0.7,2.7,3.1,4.4,5.8,4.4c0.5,0,1-0.1,1.6-0.2l92-24.9l92.5,24.9c3.2,0.9,6.5-1,7.4-4.2C200.4,35.9,198.5,32.6,195.3,31.7z'/> </g> <path id='center' style='fill:currentColor;' d='M124,94.9H76.7c-3.3,0-6,2.7-6,6v47.3c0,3.3,2.7,6,6,6H124c3.3,0,6-2.7,6-6v-47.3 \tC130,97.6,127.3,94.9,124,94.9z'/> </svg>"
    },
    "hsh-weather-system": {
        "keyWords": {
            "HU": [
                "időjárás állomás"
            ],
            "EN": [
                "weather system"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-weather-system",
        "svg": "<svg version='1.1' id='idojaras_x5F_allomas' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' \t x='0px' y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='frame'> \t<path style='fill:currentColor;' d='M94,58l0.2,31.2H55.9c-3.3,0-6,2.7-6,6V183c0,3.3,2.7,6,6,6h87.8c3.3,0,6-2.7,6-6V95.2 \t\tc0-3.3-2.7-6-6-6h-37.6L106,57.9c-1.9,0.5-4,0.8-6.1,0.8S95.8,58.5,94,58z M137.8,101.2V177H61.9v-75.8H137.8z'/> \t<path style='fill:currentColor;' d='M174,9.8c-12.1,0-22.3,8.4-25,19.7h-26.7l0,0c-0.2-0.6-0.3-1.2-0.6-1.8c0,0,0,0,0-0.1 \t\tc-0.2-0.6-0.4-1.1-0.7-1.6c0-0.1-0.1-0.1-0.1-0.2c-0.2-0.5-0.5-1-0.8-1.5c0-0.1-0.1-0.1-0.1-0.2c-0.3-0.5-0.6-1-0.9-1.4 \t\tc0,0,0-0.1-0.1-0.1c-0.3-0.5-0.6-0.9-1-1.3c-0.1-0.1-0.1-0.2-0.2-0.3c-0.3-0.4-0.7-0.8-1.1-1.2c-0.1-0.1-0.1-0.1-0.2-0.2 \t\tc-0.4-0.4-0.7-0.7-1.1-1.1l-0.1-0.1c-0.4-0.4-0.8-0.7-1.2-1c-0.1-0.1-0.2-0.2-0.3-0.2c-0.4-0.3-0.9-0.6-1.3-0.9 \t\tc-0.1-0.1-0.2-0.1-0.3-0.2c-0.4-0.3-0.9-0.5-1.3-0.8c-0.1,0-0.1-0.1-0.2-0.1c-0.5-0.3-1-0.5-1.5-0.7c-0.1-0.1-0.2-0.1-0.3-0.2 \t\tc-0.5-0.2-1-0.4-1.5-0.6c-0.1,0-0.2-0.1-0.3-0.1c-0.5-0.2-1-0.3-1.5-0.5h-0.1c-0.5-0.1-1.1-0.3-1.7-0.4c-0.1,0-0.2,0-0.4-0.1 \t\tc-0.5-0.1-1.1-0.2-1.7-0.2c-0.1,0-0.2,0-0.3,0c-0.6,0-1.2-0.1-1.8-0.1l0,0l0,0c-0.6,0-1.2,0-1.8,0.1c-0.1,0-0.2,0-0.3,0 \t\tc-0.6,0.1-1.1,0.1-1.7,0.2c-0.1,0-0.2,0-0.3,0.1c-0.6,0.1-1.1,0.2-1.7,0.4c0,0,0,0-0.1,0c-0.5,0.1-1.1,0.3-1.6,0.5 \t\tc-0.1,0-0.2,0.1-0.3,0.1c-0.5,0.2-1,0.4-1.5,0.6c-0.1,0-0.2,0.1-0.3,0.1c-0.5,0.2-1,0.5-1.5,0.7l-0.1,0.1c-0.5,0.3-0.9,0.5-1.3,0.8 \t\tc0.1-0.1,0,0-0.1,0c-0.4,0.3-0.9,0.6-1.3,0.9c-0.1,0.1-0.2,0.2-0.3,0.2c-0.4,0.3-0.8,0.7-1.2,1c-0.1,0-0.1,0.1-0.2,0.1 \t\tc-0.4,0.3-0.7,0.7-1.1,1.1c-0.1,0.1-0.1,0.2-0.2,0.2c-0.4,0.4-0.7,0.8-1,1.2c-0.1,0.1-0.2,0.2-0.2,0.3c-0.3,0.4-0.7,0.9-1,1.3 \t\tc0,0.1-0.1,0.1-0.1,0.2c-0.3,0.4-0.6,0.9-0.8,1.3c0,0.1-0.1,0.1-0.1,0.2c-0.3,0.5-0.5,1-0.7,1.5c0,0.1-0.1,0.2-0.1,0.3 \t\tc-0.2,0.5-0.4,1-0.6,1.6v0.1c-0.2,0.5-0.4,1.1-0.5,1.7c0,0,0,0,0,0.1h-26C49,18.5,39.6,10.3,28,9.6l0,0l0,0c-0.4,0-0.9,0-1.3,0 \t\tc-14.5,0.2-26,11.7-26,25.8c0,14.2,11.5,25.7,25.7,25.7c12.1,0,22.3-8.4,25-19.7h26l0,0c0.1,0.5,0.3,0.9,0.4,1.3 \t\tc0,0.1,0.1,0.2,0.1,0.2c0.2,0.4,0.3,0.9,0.5,1.3l0,0c0.2,0.4,0.4,0.9,0.6,1.3c0,0.1,0.1,0.1,0.1,0.2c0.2,0.4,0.4,0.7,0.6,1 \t\tc0.1,0.1,0.1,0.2,0.2,0.3c0.5,0.8,1,1.6,1.6,2.3c0.1,0.1,0.2,0.2,0.2,0.3c0.2,0.3,0.4,0.5,0.7,0.8c0.1,0.1,0.2,0.2,0.3,0.3 \t\tc0.3,0.3,0.6,0.7,0.9,1c0.1,0.1,0.1,0.1,0.2,0.2c0.3,0.3,0.5,0.5,0.8,0.8c0.1,0.1,0.2,0.2,0.4,0.3c0.2,0.2,0.5,0.4,0.7,0.6 \t\tc0.1,0.1,0.3,0.2,0.4,0.3c0.3,0.3,0.7,0.5,1,0.7c0.1,0.1,0.3,0.2,0.4,0.3c0.2,0.1,0.5,0.3,0.7,0.4c0.2,0.1,0.4,0.2,0.5,0.3 \t\tc0.2,0.1,0.4,0.2,0.7,0.4c0.2,0.1,0.4,0.2,0.5,0.3c0.4,0.2,0.7,0.3,1.1,0.5c0.2,0.1,0.4,0.2,0.6,0.3s0.4,0.2,0.6,0.2 \t\tc0.2,0.1,0.5,0.2,0.7,0.2c0.2,0.1,0.4,0.1,0.6,0.2c0.2,0.1,0.4,0.1,0.6,0.2l0,0c1.9,0.5,3.8,0.8,5.9,0.8s4.2-0.3,6.1-0.8l0,0 \t\tc0.1,0,0.2-0.1,0.3-0.1c0.3-0.1,0.5-0.2,0.8-0.3c0.2-0.1,0.4-0.1,0.5-0.2c0.3-0.1,0.6-0.2,0.9-0.3c0.2-0.1,0.4-0.2,0.6-0.3 \t\tc0.3-0.1,0.6-0.3,0.9-0.4c0.2-0.1,0.4-0.2,0.5-0.3c0.2-0.1,0.5-0.2,0.7-0.4c0.2-0.1,0.3-0.2,0.5-0.3c0.3-0.2,0.6-0.4,0.9-0.6 \t\tc0.2-0.1,0.3-0.2,0.4-0.3c0.3-0.2,0.6-0.4,0.8-0.6c0.1-0.1,0.3-0.2,0.4-0.3c0.2-0.2,0.5-0.4,0.7-0.6c0.1-0.1,0.2-0.2,0.3-0.3 \t\tc0.3-0.3,0.7-0.6,1-0.9l0.1-0.1c0.3-0.3,0.6-0.6,0.9-0.9c0.1-0.1,0.1-0.2,0.2-0.3c0.3-0.3,0.5-0.6,0.7-0.9c0-0.1,0.1-0.1,0.1-0.2 \t\tc0.6-0.8,1.1-1.6,1.6-2.4c0-0.1,0.1-0.1,0.1-0.2c0.2-0.4,0.5-0.8,0.7-1.2l0,0c0.4-0.9,0.8-1.8,1.1-2.8v-0.1 \t\tc0.2-0.5,0.3-0.9,0.4-1.4H149c2.7,11.3,12.9,19.7,25,19.7c14.2,0,25.7-11.5,25.7-25.7C199.7,21.3,188.2,9.8,174,9.8z M31,34.2 \t\tc0,0.2,0,0.4,0,0.6c0,0.3,0,0.7-0.1,1c0,0.1,0,0.3,0,0.4c0,0.5-0.1,1-0.2,1.5c0,0.2,0,0.3-0.1,0.5c-0.1,0.4-0.1,0.7-0.2,1.1 \t\tc0,0.2-0.1,0.4-0.1,0.6c-0.1,0.3-0.2,0.7-0.2,1c-0.1,0.2-0.1,0.4-0.2,0.6c-0.1,0.4-0.2,0.7-0.3,1.1c-0.1,0.2-0.1,0.4-0.2,0.6 \t\tc-0.2,0.5-0.3,0.9-0.5,1.4c0,0.1-0.1,0.2-0.1,0.3c-0.2,0.6-0.5,1.1-0.7,1.7c-0.1,0.2-0.2,0.4-0.3,0.6c-0.2,0.4-0.4,0.8-0.6,1.2 \t\tc-0.1,0.2-0.2,0.5-0.4,0.7c-0.2,0.4-0.4,0.8-0.7,1.2c-0.1,0.2-0.3,0.5-0.4,0.7c-0.3,0.4-0.5,0.9-0.8,1.3c-0.1,0.2-0.3,0.4-0.4,0.6 \t\tc0,0.1-0.1,0.1-0.1,0.2c-8.8-1-15.7-8.5-15.7-17.6c0-9.5,7.5-17.3,17-17.7v0.1c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.2,0.2,0.3 \t\tc0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.2,0.2,0.3,0.4c0,0.1,0.1,0.1,0.1,0.2c0.1,0.2,0.2,0.3,0.3,0.5c0,0,0,0.1,0.1,0.1 \t\tc0.1,0.2,0.3,0.4,0.4,0.7c0,0.1,0.1,0.2,0.1,0.3c0.1,0.2,0.2,0.3,0.3,0.5c0,0.1,0.1,0.2,0.2,0.3c0.1,0.2,0.2,0.3,0.3,0.5 \t\tc0,0.1,0.1,0.2,0.2,0.3c0.1,0.2,0.2,0.4,0.3,0.6c0,0.1,0.1,0.2,0.1,0.3c0.1,0.3,0.3,0.6,0.4,0.9c0,0.1,0,0.1,0.1,0.2 \t\tc0.1,0.3,0.2,0.5,0.3,0.8c0,0.1,0.1,0.3,0.1,0.4c0.1,0.2,0.1,0.5,0.2,0.7c0,0.1,0.1,0.3,0.1,0.4c0.1,0.2,0.1,0.5,0.2,0.7 \t\tc0,0.1,0.1,0.3,0.1,0.5c0.1,0.3,0.1,0.5,0.2,0.8c0,0.1,0.1,0.3,0.1,0.4c0.1,0.4,0.1,0.8,0.2,1.2c0,0.1,0,0.3,0,0.4 \t\tc0,0.3,0.1,0.6,0.1,0.9c0,0.2,0,0.4,0,0.5c0,0.3,0,0.5,0,0.8c0,0.2,0,0.4,0,0.6L31,34.2L31,34.2z M99.8,46.7 \t\tc-6.2,0-11.3-5.1-11.3-11.3c0-5.3,3.7-9.8,8.7-11c0.1,0,0.2-0.1,0.4-0.1h0.1c0.3-0.1,0.7-0.1,1-0.2c0.2,0,0.4,0,0.7,0 \t\tc0.2,0,0.3,0,0.5,0c6.2,0,11.3,5.1,11.3,11.3C111.1,41.7,106.1,46.7,99.8,46.7z M175.4,35.6c0,0.4,0,0.8,0,1.2c0,0.2,0,0.3,0,0.4 \t\tc0,0.4,0,0.8-0.1,1.2c0,0.1,0,0.2,0,0.3c0,0.5-0.1,1.1-0.2,1.6c0,0.1,0,0.2,0,0.2c0,0.5-0.1,0.9-0.2,1.4c0,0.2,0,0.3-0.1,0.5 \t\tc-0.1,0.4-0.1,0.8-0.2,1.2c0,0.1,0,0.3-0.1,0.4c-0.1,0.5-0.2,1.1-0.4,1.7l0,0c-0.1,0.6-0.3,1.1-0.5,1.7c-0.1,0.2-0.1,0.3-0.1,0.5 \t\tc-0.1,0.4-0.3,0.8-0.4,1.3c0,0.2-0.1,0.3-0.2,0.5c-0.2,0.5-0.4,1-0.6,1.6c0,0,0,0.1-0.1,0.1c-0.2,0.5-0.4,1-0.7,1.5 \t\tc-8.6-1.2-15.3-8.6-15.3-17.5s6.7-16.4,15.3-17.5c0.2,0.4,0.3,0.8,0.5,1.2v0.1c0.1,0.2,0.2,0.4,0.3,0.7c0,0.1,0,0.1,0.1,0.2 \t\tc0.1,0.2,0.2,0.5,0.3,0.7v0.1c0.1,0.3,0.2,0.6,0.3,0.9v0.1c0.1,0.3,0.2,0.6,0.3,0.9c0,0.1,0.1,0.2,0.1,0.3c0.1,0.3,0.2,0.6,0.3,0.9 \t\tc0,0.1,0,0.1,0.1,0.2c0.1,0.4,0.2,0.8,0.3,1.1l0,0c0.1,0.4,0.2,0.8,0.3,1.1c0,0.1,0,0.2,0.1,0.3c0.1,0.3,0.1,0.6,0.2,1 \t\tc0,0.1,0,0.2,0.1,0.3c0.2,0.8,0.3,1.7,0.4,2.6c0,0.1,0,0.2,0,0.3c0,0.3,0.1,0.7,0.1,1.1c0,0.1,0,0.3,0,0.4c0,0.4,0.1,0.8,0.1,1.2 \t\tc0,0.1,0,0.1,0,0.2c0,0.5,0,1,0,1.5C175.4,35.4,175.3,35.5,175.4,35.6z'/> </g> <g id='celsius'> \t<path style='fill:currentColor;' d='M110.7,151.7c-1.6,0-3.2,0.6-4.4,1.8c-5.4,5.5-14.3,5.5-19.7,0.1c-2.7-2.6-4.1-6.1-4.1-9.9 \t\tc0-3.7,1.4-7.2,4-9.9s6.1-4.1,9.9-4.1c3.7,0,7.2,1.4,9.8,4c2.4,2.4,6.4,2.4,8.7,0c2.4-2.4,2.4-6.3,0-8.7c-5-4.9-11.5-7.6-18.5-7.6 \t\th-0.1c-7,0-13.7,2.8-18.6,7.8c-4.9,5-7.7,11.6-7.6,18.7c0,7,2.8,13.6,7.8,18.6c5,4.9,11.5,7.6,18.5,7.6c7.1,0,13.8-2.8,18.7-7.8 \t\tc2.4-2.4,2.4-6.3,0-8.7C113.8,152.3,112.2,151.7,110.7,151.7z'/> \t<ellipse style='fill:currentColor;' cx='123.5' cy='115.4' rx='8.4' ry='8.4'/> </g> </svg>"
    },
    "hsh-pantry": {
        "keyWords": {
            "HU": [
                "spájz"
            ],
            "EN": [
                "pantry"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-pantry",
        "svg": "<svg version='1.1' id='kamra' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='jar_x5F_shape' style='fill:currentColor;' d='M166.4,65.3c0.1-1.9-0.4-3.9-1.5-5.6l-11.5-17.2v-12c2.8-0.7,4.8-3.2,4.8-6.2v-12 \tc0-3.5-2.9-6.4-6.4-6.4H48.3c-3.5,0-6.4,2.9-6.4,6.4v12c0,2.8,1.8,5.1,4.2,6v12.2L35.1,59.9c-1.2,1.9-1.7,4-1.3,6.2v20.8 \tc0,0,0,0,0,0s0,0,0,0v72.8c0,0,0,0,0,0c0,0,0,0,0,0v3.2c0,17,13,30.9,28.9,30.9h74.9c15.9,0,28.9-13.8,28.9-30.9V65.6 \tC166.5,65.5,166.4,65.4,166.4,65.3z M56.1,30.8h87.4v8.3l-87.4,0V30.8z M51.9,16h96.4v4.8H51.9V16z M53.9,49.1l91.9,0l9.7,14.6h-111 \tL53.9,49.1z M43.7,91.9h51.1l0,62.9l-51.1,0V91.9z M137.6,184H62.6c-9.9,0-18-8.4-18.8-19.2l56-0.1c2.8,0,5-2.2,5-5l0-72.9 \tc0-1.3-0.5-2.6-1.5-3.5c-0.9-0.9-2.2-1.5-3.5-1.5H43.7v-8.3h112.7v89.5C156.5,174.6,148,184,137.6,184z'/> </svg>"
    },
    "hsh-boiler": {
        "keyWords": {
            "HU": [
                "kazán"
            ],
            "EN": [
                "boiler"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-boiler",
        "svg": "<svg version='1.1' id='kazan' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='fire'> \t<path style='fill:currentColor;' d='M149,113.7c-0.1,8-2.7,15.9-7.3,22.4c-4.1,5.7-11.4,14-19,14.3c-0.6-3.1,0.8-7.5,1-10.7 \t\tc0.5-5.9,0.7-11.8-0.6-17.6c-1.9-8.2-6.3-15.9-13.9-19.9c-3-1.6-6.3-2.3-9.4-3.6c-11.4-4.9-17.5-16.1-11.9-27.9 \t\tc-0.8,1.7-2.8,3.2-3.9,4.7c-1.4,1.9-2.6,4-3.7,6.2c-3.6,7.5-5.3,16.3-1.5,24.1c1.6,3.4,3.9,6.6,7.3,8.4c4.3,2.3,8.7,3.6,12,7.4 \t\tc2.5,3,4,6.7,4.2,10.5c0.4,6-1.8,11.9-4.4,17.1c-1,2-2.1,4-3.3,5.9c-28.5-3-50.7-26.8-50.7-55.8c0-13.9,5.5-27.7,14.8-37.9 \t\tc10.1-11.3,23.5-16,38.1-17.9c1.3-0.2,2.5-0.3,3.8-0.4c4.7-0.4,8.6-0.5,11.4-0.4c-1.3,1.1-6.2,5.8-6.6,13.1c-0.2,4,1,7,1.6,8.4 \t\tc3.3,7.7,10.4,11,12.6,11.9c0.1,0,0.1,0.1,0.2,0.1c4.8,1.7,9.4,3.9,13.5,6.9s7.6,6.7,10.2,10.9C147.3,99.7,149,106.7,149,113.7z'/> </g> <g id='frame'> \t<path style='fill:currentColor;' d='M191.7,1.1H8.7c-3.9,0-7.1,3.2-7.1,7.1v183.7c0,3.9,3.2,7.1,7.1,7.1h183c3.9,0,7.1-3.2,7.1-7.1V8.2 \t\tC198.8,4.3,195.6,1.1,191.7,1.1z M186.8,186.9H13.7V13.1h173.1V186.9z'/> \t<rect x='154.1' y='22.9' style='fill:currentColor;' width='21.4' height='21.6'/> </g> </svg>"
    },
    "hsh-question-mark": {
        "keyWords": {
            "HU": [
                "segítség"
            ],
            "EN": [
                "question"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-question-mark",
        "svg": "<svg id='kerdojel' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 198.34 184.31'><title>kerdojel</title><path id='keret' d='M100.22,9.65C45.54,9.65,1.05,47.84,1.05,94.79a75.77,75.77,0,0,0,12.06,40.74L1.4,186.62a6,6,0,0,0,7.82,7l55.55-19.32a113.27,113.27,0,0,0,35.45,5.62c54.68,0,99.17-38.19,99.17-85.14S154.9,9.65,100.22,9.65Zm0,158.28a101.32,101.32,0,0,1-33.53-5.61l-.17,0-.36-.1a2.27,2.27,0,0,0-.25-.06l-.33-.06-.27,0L65,162h-.58l-.32,0-.26,0-.34.06-.24,0-.35.11-.18,0L15.52,178.73l9.86-43a.43.43,0,0,1,0-.11c0-.1,0-.21.05-.31s0-.19,0-.29a2.64,2.64,0,0,0,0-.28c0-.1,0-.21,0-.31v-.27c0-.1,0-.21,0-.31a2.7,2.7,0,0,0,0-.28,2.54,2.54,0,0,0,0-.29c0-.1,0-.2-.07-.3l-.06-.26c0-.1-.07-.2-.1-.31l-.09-.24c0-.1-.09-.2-.13-.29l-.12-.25-.15-.26a2.26,2.26,0,0,0-.16-.26l-.06-.1a64.09,64.09,0,0,1-11.43-36.2c0-40.33,39.1-73.14,87.17-73.14s87.17,32.81,87.17,73.14S148.28,167.93,100.22,167.93Z' transform='translate(-1.05 -9.65)' style='fill:currentColor'/><g id='kerdojel_elem'><path d='M126.1,58.26C119.66,46.59,106.46,40.19,94,42.67a31,31,0,0,0-15.31,8c-4.4,4.21-6.47,9.13-8.53,14.67a6,6,0,1,0,11.24,4.19c1.64-4.41,3-7.72,5.58-10.17a19.19,19.19,0,0,1,9.37-4.94c7.41-1.48,15.32,2.48,19.26,9.61a18,18,0,0,1-3.54,22.29c-1.16,1-2.51,2-3.93,3a44.07,44.07,0,0,0-7.25,6.15c-5,5.57-7.37,13.15-7.12,22.52a6,6,0,0,0,6,5.84h.16a6,6,0,0,0,5.84-6.15c-.17-6.3,1.16-10.95,4.07-14.2a33.51,33.51,0,0,1,5.34-4.43c1.59-1.15,3.24-2.34,4.84-3.75A29.89,29.89,0,0,0,126.1,58.26Z' transform='translate(-1.05 -9.65)' style='fill:currentColor'/><circle cx='98.66' cy='131.67' r='9.42' style='fill:currentColor'/></g></svg>"
    },
    "hsh-exit-closed": {
        "keyWords": {
            "HU": [
                "kisjató",
                "zárva"
            ],
            "EN": [
                "exit",
                "closed"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-exit-closed",
        "svg": "<svg version='1.1' id='gate_x5F_1wing' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='oszlopok1'> \t<path style='fill:currentColor;' d='M57.6,12.2H35.8c-1.7,0-3,1.3-3,3V197c0,1.7,1.3,3,3,3h21.8c1.7,0,3-1.3,3-3V15.2 \t\tC60.6,13.5,59.3,12.2,57.6,12.2z M54.6,194H38.8V18.2h15.8V194z'/> \t<path style='fill:currentColor;' d='M164.2,12.2h-21.8c-1.7,0-3,1.3-3,3V197c0,1.7,1.3,3,3,3h21.8c1.7,0,3-1.3,3-3V15.2 \t\tC167.2,13.5,165.8,12.2,164.2,12.2z M161.2,193.9h-15.8V18.2h15.8V193.9z'/> </g> <g id='wing11'> \t<path style='fill:currentColor;' d='M107.5,22.7H93.6c-0.8,0-1.5,0.7-1.5,1.5v171.2c0,0.8,0.7,1.5,1.5,1.5h13.9c0.8,0,1.5-0.7,1.5-1.5 \t\tV24.2C109,23.4,108.3,22.7,107.5,22.7z'/> \t<path style='fill:currentColor;' d='M84.8,22.7H70.9c-0.8,0-1.5,0.7-1.5,1.5v171.2c0,0.8,0.7,1.5,1.5,1.5h13.9c0.8,0,1.5-0.7,1.5-1.5 \t\tV24.2C86.3,23.4,85.6,22.7,84.8,22.7z'/> \t<path style='fill:currentColor;' d='M132.6,23.3h-13.9c-0.8,0-1.5,0.7-1.5,1.5V196c0,0.8,0.7,1.5,1.5,1.5h13.9c0.8,0,1.5-0.7,1.5-1.5 \t\tV24.8C134.1,23.9,133.5,23.3,132.6,23.3z'/> </g> </svg>"
    },
    "hsh-exit-open": {
        "keyWords": {
            "HU": [
                "kisajtó",
                "nyitva"
            ],
            "EN": [
                "exit",
                "open"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-exit-open",
        "svg": "<svg version='1.1' id='gate_x5F_1wing_x5F_open' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' \t x='0px' y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='oszlop22'> \t<path style='fill:currentColor;' d='M58,13.2H36.3c-1.7,0-3,1.3-3,3v180.7c0,1.7,1.3,3,3,3H58c1.7,0,3-1.3,3-3V16.2 \t\tC61,14.6,59.6,13.2,58,13.2z M55,193.9H39.3V19.2H55V193.9z'/> \t<path style='fill:currentColor;' d='M163.9,13.2h-21.7c-1.7,0-3,1.3-3,3v180.7c0,1.7,1.3,3,3,3h21.7c1.7,0,3-1.3,3-3V16.2 \t\tC166.9,14.6,165.5,13.2,163.9,13.2z M160.9,193.9h-15.7V19.2h15.7V193.9z'/> </g> <g id='wing22'> \t<path style='fill:currentColor;' d='M81.5,18.3l-11,5c-0.5,0.2-0.9,0.8-0.9,1.3v170c0,1.1,1.1,1.8,2.1,1.3c3.7-1.7,7.3-3.3,11-5 \t\tc0.5-0.2,0.9-0.8,0.9-1.3v-170C83.6,18.6,82.5,17.9,81.5,18.3z'/> \t<path style='fill:currentColor;' d='M99.5,10.5l-11,5c-0.5,0.2-0.9,0.8-0.9,1.3v170c0,1.1,1.1,1.8,2.1,1.3c3.7-1.7,7.3-3.3,11-5 \t\tc0.5-0.2,0.9-0.8,0.9-1.3v-170C101.6,10.7,100.5,10,99.5,10.5z'/> \t<path style='fill:currentColor;' d='M116.5,2.9l-11,5c-0.5,0.2-0.9,0.8-0.9,1.3v170c0,1.1,1.1,1.8,2.1,1.3c3.7-1.7,7.3-3.3,11-5 \t\tc0.5-0.2,0.9-0.8,0.9-1.3V4.2C118.6,3.1,117.4,2.4,116.5,2.9z'/> </g> </svg>"
    },
    "hsh-lock-locked": {
        "keyWords": {
            "HU": [
                "lakat"
            ],
            "EN": [
                "lock"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-lock-locked",
        "svg": "<svg id='lakat_lock' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 131.86 170.52'><title>lakat_lock</title><g id='lakat_elem'><path d='M152.91,92.15h-9.57V55.51a26.19,26.19,0,0,0-26.15-26.16H79.93A26.2,26.2,0,0,0,53.77,55.51V92.15H44.21a11.6,11.6,0,0,0-11.58,11.59v84.55a11.6,11.6,0,0,0,11.58,11.59h108.7a11.6,11.6,0,0,0,11.58-11.59V103.74A11.6,11.6,0,0,0,152.91,92.15ZM65.77,55.51A14.17,14.17,0,0,1,79.93,41.35h37.26a14.16,14.16,0,0,1,14.15,14.16V92.15H65.77Zm86.72,132.37H44.63V104.15H152.49Z' transform='translate(-32.63 -29.35)' style='fill:currentColor'/><path d='M98.2,120.49a11.42,11.42,0,0,0-5,21.7v18.57a4,4,0,0,0,4,4h2a4,4,0,0,0,4-4V142.19a11.42,11.42,0,0,0-5-21.7Z' transform='translate(-32.63 -29.35)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-lock-unlocked": {
        "keyWords": {
            "HU": [
                "lakat"
            ],
            "EN": [
                "lock"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-lock-unlocked",
        "svg": "<svg id='lakat_unlock' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 131.86 200.02'><title>lakat_unlocked</title><g id='lakat_elem'><path d='M152.55,92.29H66.05V26.11A14.14,14.14,0,0,1,80.18,12H117.5a14.14,14.14,0,0,1,14.13,14.12v24.4a6,6,0,0,0,12,0V26.11A26.16,26.16,0,0,0,117.5,0H80.18A26.16,26.16,0,0,0,54.05,26.11V92.29H43.85a11.59,11.59,0,0,0-11.58,11.58v84.56A11.6,11.6,0,0,0,43.85,200h108.7a11.6,11.6,0,0,0,11.58-11.58V103.87A11.59,11.59,0,0,0,152.55,92.29ZM152.13,188H44.27V104.29H152.13Z' transform='translate(-32.27 0.01)' style='fill:currentColor'/><path d='M92.84,142.32v18.57a4,4,0,0,0,4,4h2a4,4,0,0,0,4-4V142.32a11.43,11.43,0,1,0-10,0Z' transform='translate(-32.27 0.01)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-lamp": {
        "keyWords": {
            "HU": [
                "lámpa"
            ],
            "EN": [
                "lamp"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-lamp",
        "svg": "<svg version='1.1' id='lamp' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shape_x5F_lamp' style='fill:currentColor;' d='M182,167.5c0-0.1,0-0.1,0-0.2c0-0.1,0-0.1,0-0.2c-2.7-41-35.6-73.5-76-76.5v-60 \tc13.6-0.7,27.1-4.1,39.5-9.8c2.1-1,3.5-3.1,3.5-5.4V6c0-3.3-2.7-6-6-6H58c-3.3,0-6,2.7-6,6v9.4c0,2.3,1.4,4.5,3.5,5.4 \tc12.1,5.6,25.3,8.9,38.6,9.7v60c-40.3,3-73.2,35.4-76,76.3c0,0.2,0,0.4,0,0.6l0,0v0.1c0,0.4,0.1,0.8,0.2,1.1v0.1 \tc0,0.1,0.1,0.3,0.1,0.4c0,0.1,0.1,0.2,0.1,0.3s0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.3,0.2,0.4c0,0,0,0.1,0.1,0.1c0.1,0.1,0.2,0.3,0.2,0.4 \tc0,0,0,0.1,0.1,0.1c0.1,0.1,0.2,0.2,0.3,0.3l0.1,0.1c0.1,0.1,0.2,0.2,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2 \tc0.1,0.1,0.2,0.1,0.3,0.2l0.1,0.1c0.1,0.1,0.2,0.2,0.4,0.2l0,0c0.1,0.1,0.2,0.1,0.3,0.2l0,0h0.1h0.1c18.5,10,39.4,16.4,60.5,18.8 \tc4.8,4.6,11.2,7.3,17.9,7.3c6.6,0,13-2.6,17.7-7.1c21.3-2.2,42.6-8.7,61.4-18.8l0,0c0.5-0.3,1-0.6,1.4-1.1l0,0l0,0 \tC181.3,170.7,182,169.2,182,167.5z M74.5,178.3c-9.7-1.6-19.2-4.2-28.4-7.6c9.4-0.9,18.8-1.6,28.2-2.1c-0.2,1.4-0.4,2.9-0.4,4.3 \tC73.9,174.8,74.1,176.6,74.5,178.3z M125,168.7c9.6,0.5,19.3,1.2,28.9,2.1c-9.4,3.5-19.2,6.1-29.1,7.7c0.4-1.8,0.6-3.6,0.6-5.5 \tC125.3,171.6,125.2,170.1,125,168.7z M135.6,12c-11.8,4.7-24.5,7-37.2,6.7c-11.3-0.2-22.6-2.6-33.1-6.7C65.3,12,135.6,12,135.6,12z \t M100,102.4c34.3,0,63.4,25,69.1,58.1c-16.8-2.1-33.9-3.5-50.9-4.1c-12.6-0.4-25-0.4-37.1,0c-16.6,0.6-33.5,1.9-50.2,4 \tC36.7,127.3,65.7,102.4,100,102.4z M99.6,189.7c-5.4,0-10.3-2.5-13.5-6.9c-2.1-2.9-3.2-6.3-3.2-9.8c0-1.6,0.2-3.2,0.7-4.7 \tc10.5-0.3,21.2-0.3,32.1,0c0.4,1.5,0.7,3.1,0.7,4.7c0,3.6-1.1,7.1-3.3,10C109.9,187.3,105,189.7,99.6,189.7z'/> </svg>"
    },
    "hsh-language": {
        "keyWords": {
            "HU": [
                "földgömb",
                "nyelv"
            ],
            "EN": [
                "planet",
                "language"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-language",
        "svg": "<svg id='language' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 199.53 190.99'><title>language</title><path id='foldgomb' d='M183.23,60.39a92,92,0,0,0-42.16-31,98.77,98.77,0,0,0-34.21-6,101.25,101.25,0,0,0-18.64,1.73,5,5,0,1,0,1.84,9.83A92.61,92.61,0,0,1,103,33.44l1.42,72H61.53a187.75,187.75,0,0,1,1.56-20.33A4,4,0,0,0,55.16,84a194.54,194.54,0,0,0-1.63,21.4H24.08a70.06,70.06,0,0,1,3.81-19.21,5,5,0,1,0-9.43-3.31A80,80,0,0,0,14,109.42c0,35.29,22.81,66.63,58.11,79.83a98.76,98.76,0,0,0,34.8,6.24c1.13,0,2.26,0,3.36-.05A98.89,98.89,0,0,0,142.47,189l.24-.1c34.67-13.44,57-44.59,57-79.43A81.26,81.26,0,0,0,183.23,60.39Zm-159.15,53H53.49c.34,22.53,4.4,44.21,11.44,61.65C41,162.22,25.53,139.22,24.08,113.42ZM76,180c-8.88-17.51-14.08-41.43-14.47-66.6h43L106,185.47A88.69,88.69,0,0,1,76,180Zm113.68-74.6H160.81c-.55-22.76-4.9-44.5-12.26-61.78C172.69,56.45,188.19,79.5,189.64,105.42ZM111,33.45a88.6,88.6,0,0,1,26.34,5.2c9.3,17.23,14.88,41.27,15.51,66.77H112.38Zm1.58,80h40.31c-.4,25-5.55,48.85-14.34,66.33A88.75,88.75,0,0,1,114,185.21Zm37,61.22c6.94-17.37,10.94-38.9,11.28-61.22h28.79C188.19,138.87,173.09,161.7,149.57,174.64Z' transform='translate(-0.23 -4.51)' style='fill:currentColor'/><path id='doboz_elem' d='M84.22,75.36,77.37,48.28V9.51a5,5,0,0,0-5-5H5.23a5,5,0,0,0-5,5V65.12a5,5,0,0,0,5,5H52.75l24.57,11a5,5,0,0,0,2.05.44,5,5,0,0,0,4.85-6.23ZM55.87,60.56h0a3.84,3.84,0,0,0-.6-.2,2.35,2.35,0,0,0-.35-.11,3,3,0,0,0-.42-.05,3.94,3.94,0,0,0-.58-.06H10.23V14.51H67.37v34.4s0,.06,0,.1a4.4,4.4,0,0,0,.05.51,4.5,4.5,0,0,0,.08.51.34.34,0,0,0,0,.1L72,67.8Z' transform='translate(-0.23 -4.51)' style='fill:currentColor'/><path id='zaszlo' d='M59.19,22.3a3,3,0,0,0-2.82-.36A42.65,42.65,0,0,1,42.63,25,24.81,24.81,0,0,1,36,24a31.2,31.2,0,0,0-7.89-1.17,32.23,32.23,0,0,0-9.27,1.47,3,3,0,0,0-2.08,2.75L16,48.94a3,3,0,0,0,3.92,3,26.08,26.08,0,0,1,7.52-1.17,27,27,0,0,1,6.41,1,32.22,32.22,0,0,0,7.6,1.16H42a48.21,48.21,0,0,0,15.7-3.45,3,3,0,0,0,1.92-2.69l.81-21.89A3,3,0,0,0,59.19,22.3Zm-31,6.53a26.76,26.76,0,0,1,6.42,1A30.34,30.34,0,0,0,42.83,31a45.12,45.12,0,0,0,11.46-2l-.21,5.63c-3.17.91-10.9,2.07-16.7.36a41.3,41.3,0,0,0-14.87-1.11l.16-4.41A27.69,27.69,0,0,1,28.19,28.83ZM41.82,46.89a25.2,25.2,0,0,1-6.62-1,32.48,32.48,0,0,0-7.64-1.17h-.25a33.43,33.43,0,0,0-5.22.47l.2-5.27a36,36,0,0,1,13.4.82,31.77,31.77,0,0,0,8.81,1.12,44.07,44.07,0,0,0,9.35-1l-.13,3.64A41.24,41.24,0,0,1,41.82,46.89Z' transform='translate(-0.23 -4.51)' style='fill:currentColor'/></svg>"
    },
    "hsh-leaf": {
        "keyWords": {
            "HU": [
                "levél"
            ],
            "EN": [
                "leaf"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-leaf",
        "svg": "<svg version='1.1' id='leaf' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shape_x5F_leaf' style='fill:currentColor;stroke:#808080;stroke-width:2;stroke-linecap:round;stroke-linejoin:round;stroke-miterlimit:10;' d=' \tM4.4,196.1c0,0,202.5,37.7,191.2-191c0,0-201.7-32.7-191.2,135.6c0,0,62.8-64,115.5-65.3C31.2,117.9,4.4,196.1,4.4,196.1z'/> </svg>"
    },
    "hsh-led-strip": {
        "keyWords": {
            "HU": [
                "led"
            ],
            "EN": [
                "led"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-led-strip",
        "svg": "<svg version='1.1' id='led_x5F_strip' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='keret'> \t<path style='fill:currentColor;' d='M7,13.1h186.3c3.6,0,6.5-2.9,6.5-6.4s-2.9-6.4-6.5-6.4H7c-3.6,0-6.5,2.9-6.5,6.4S3.4,13.1,7,13.1z' \t\t/> \t<path style='fill:currentColor;' d='M193.2,186.7H7c-3.6,0-6.5,2.9-6.5,6.4s2.9,6.4,6.5,6.4h186.3c3.6,0,6.5-2.9,6.5-6.4 \t\tS196.8,186.7,193.2,186.7z'/> \t<path style='fill:currentColor;' d='M100.1,34.1L100.1,34.1c-3.3,0-6,2.6-6.1,5.9l-0.5,42.4c0,3.3,2.6,6,5.9,6.1c0,0,0,0,0.1,0 \t\tc3.3,0,6-2.6,6-5.9l0.5-42.4C106.1,36.8,103.5,34.1,100.1,34.1z'/> \t<path style='fill:currentColor;' d='M100.1,111.1L100.1,111.1c-3.3,0-6,2.6-6.1,5.9l-0.5,42.4c0,3.3,2.6,6,5.9,6.1c0,0,0,0,0.1,0 \t\tc3.3,0,6-2.6,6-5.9l0.5-42.4C106.1,113.9,103.5,111.2,100.1,111.1z'/> </g> <g id='ledek'> \t<path style='fill:currentColor;' d='M193.6,51.1h-14.4V34.7c0-3.3-2.7-6-6-6l0,0c-3.3,0-6,2.7-6,6v16.4H149V34.7c0-3.3-2.7-6-6-6 \t\ts-6,2.7-6,6v16.4h-16.2c-3.3,0-6,2.7-6,6V145c0,3.3,2.7,6,6,6H137v16.4c0,3.3,2.7,6,6,6s6-2.7,6-6V151h18.1v16.4c0,3.3,2.7,6,6,6 \t\tl0,0c3.3,0,6-2.7,6-6V151h14.4c3.3,0,6-2.7,6-6V57.1C199.6,53.8,196.9,51.1,193.6,51.1z M157.2,130.7c-16.5,0-30-13.2-30-29.6 \t\tc0-16.3,13.4-29.6,30-29.6s30,13.2,30,29.6C187.2,117.4,173.7,130.7,157.2,130.7z'/> \t<path style='fill:currentColor;' d='M79.8,51.1H65.3V34.7c0-3.3-2.7-6-6-6l0,0c-3.3,0-6,2.7-6,6v16.4H35.2V34.7c0-3.3-2.7-6-6-6 \t\ts-6,2.7-6,6v16.4H7c-3.3,0-6,2.7-6,6V145c0,3.3,2.7,6,6,6h16.2v16.4c0,3.3,2.7,6,6,6s6-2.7,6-6V151h18.1v16.4c0,3.3,2.7,6,6,6l0,0 \t\tc3.3,0,6-2.7,6-6V151h14.4c3.3,0,6-2.7,6-6V57.1C85.8,53.8,83.1,51.1,79.8,51.1z M43.4,130.7c-16.5,0-30-13.2-30-29.6 \t\tc0-16.3,13.4-29.6,30-29.6s30,13.2,30,29.6C73.3,117.4,59.9,130.7,43.4,130.7z'/> </g> </svg>"
    },
    "hsh-light-bulb": {
        "keyWords": {
            "HU": [
                "lámpa"
            ],
            "EN": [
                "light"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-light-bulb",
        "svg": "<svg version='1.1' id='light_x5F_bulb' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='body' style='fill:currentColor;' d='M170.4,132.4c-0.2-9.5-2.7-19-7.2-27.6c-2.4-4.5-5.3-8.7-8.7-12.6 \tc-2.2-2.4-4.5-4.4-6.8-6.3c-1.6-1.3-3.1-2.6-4.4-3.9c-4.6-4.6-7.2-10.3-7.2-15.7v-8.6c0-7.2-6.3-13-13.9-13h-45 \tc-7.7,0-13.9,5.9-13.9,13v8.7c0,5.9-3.1,11.6-9.5,17.4c-7,6.3-14.1,13.6-18.7,23.3c-3.6,7.4-5.6,15.4-6,23.6c0,0.1,0,0.2,0,0.3 \tc-0.1,0.9-0.1,1.8-0.1,2.8c0,2.1,0.1,4.2,0.3,6.3c3.4,33.2,33.7,59.3,70.3,59.3c35.9,0,65.6-24.9,70.1-57.1c0.4-2.8,0.6-5.6,0.6-8.5 \tV133C170.4,132.8,170.4,132.6,170.4,132.4z M99.8,185.9c-30,0-54.6-21.9-56.2-49.3c18.2-2.9,36.8-4.2,55.2-4 \tc19.1,0.3,38.3,2.2,57.1,5.8C153.3,165,129.1,185.9,99.8,185.9z'/> <g id='menet'> \t<path style='fill:currentColor;' d='M124.6,28.8H75.5c-3,0-5.4,2.1-5.4,4.6s2.4,4.6,5.4,4.6h49.1c3,0,5.4-2.1,5.4-4.6 \t\tS127.6,28.8,124.6,28.8z'/> \t<path style='fill:currentColor;' d='M78.6,24h42.2c3,0,5.4-2.1,5.4-4.6s-2.4-4.6-5.4-4.6H78.6c-3,0-5.4,2.1-5.4,4.6S75.7,24,78.6,24z'/> \t<path style='fill:currentColor;' d='M80.7,10.1h38.1c3,0,5.4-2.1,5.4-4.6s-2.4-4.6-5.4-4.6H80.7c-3,0-5.4,2.1-5.4,4.6 \t\tS77.7,10.1,80.7,10.1z'/> </g> </svg>"
    },
    "hsh-living-room": {
        "keyWords": {
            "HU": [
                "nappali"
            ],
            "EN": [
                "livingroom"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-living-room",
        "svg": "<svg version='1.1' id='living_x5F_room' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='couch' style='fill:currentColor;' d='M192.8,74.6c-2.7-2.2-5.9-3.7-9.4-4.5c0.1-1,0.2-2,0.2-3V53c0-17.7-17.2-32.1-38.2-32.1 \th-45.1h0H55.1C34,20.9,16.8,35.3,16.8,53v14.1c0,1,0.1,2,0.2,3C7.6,72.3,0.6,79.8,0.6,88.6v63.3c0,10.6,10,19.2,22.3,19.2h154.6 \tc12.3,0,22.3-8.6,22.3-19.2V88.6C199.8,83.3,197.2,78.2,192.8,74.6z M171.5,53v14.1c0,1-0.1,2.1-0.3,3.1 \tc-9.3,2.4-15.9,9.7-15.9,18.4v20.7h-49.3l0.3-76.4h39.1C159.7,33,171.5,42,171.5,53z M28.9,53C28.9,42,40.6,33,55.1,33h39.1 \tl-0.3,76.4H45.1V88.6c0-5.3-2.5-10.4-7-14c-2.5-2-5.6-3.5-8.9-4.4c-0.2-1-0.3-2.1-0.3-3.1V53z M187.7,151.9c0,3.9-4.7,7.1-10.2,7.1 \tH22.9c-5.5,0-10.2-3.3-10.2-7.1V88.6c0-3.9,4.7-7.1,10.2-7.1c0.4,0,0.9,0,1.2,0c2.5,0.2,4.8,1.1,6.5,2.5c0.9,0.8,2.5,2.4,2.5,4.6 \tv26.8c0,3.3,2.7,6,6,6h60.7h0h61.4c3.3,0,6-2.7,6-6V88.6c0-3.5,4-6.7,8.9-7.1c0.4,0,0.9-0.1,1.3-0.1c2.9,0,5.7,0.9,7.7,2.5 \tc0.9,0.8,2.5,2.4,2.5,4.6V151.9z'/> </svg>"
    },
    "hsh-tv-complex": {
        "keyWords": {
            "HU": [
                "tv"
            ],
            "EN": [
                "tv"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-tv-complex",
        "svg": "<svg version='1.1' id='tv_x5F_allvany' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='tvallvany_x5F_shape'> \t<path style='fill:currentColor;' d='M183.1,121.1H16.9c-9.2,0-16.8,7.5-16.8,16.8v11.2c0,9.2,7.5,16.8,16.8,16.8h8.4l-3.7,6.2 \t\tc-1.7,2.8-0.8,6.5,2.1,8.2c1,0.6,2,0.9,3.1,0.9c2,0,4-1,5.2-2.9l7.4-12.4h113.3l7.4,12.4c1.1,1.9,3.1,2.9,5.2,2.9 \t\tc1,0,2.1-0.3,3.1-0.9c2.8-1.7,3.8-5.4,2.1-8.2l-3.7-6.2h16.5c9.2,0,16.8-7.5,16.8-16.8v-11.2C199.9,128.6,192.3,121.1,183.1,121.1z \t\t M12.1,149.1v-11.2c0-2.6,2.1-4.8,4.8-4.8h77l-0.3,20.8H16.9C14.3,153.9,12.1,151.8,12.1,149.1z M187.9,149.1 \t\tc0,2.6-2.1,4.8-4.8,4.8h-77.4l0.3-20.8h77.2c2.6,0,4.8,2.1,4.8,4.8V149.1z'/> \t<path style='fill:currentColor;' d='M118.9,140.2c-1.9,0-3.4,1.5-3.4,3.4c0,1.9,1.5,3.4,3.4,3.4c1.9,0,3.4-1.5,3.4-3.4 \t\tC122.2,141.7,120.7,140.2,118.9,140.2z'/> \t<path style='fill:currentColor;' d='M82.6,140.2c-1.9,0-3.4,1.5-3.4,3.4c0,1.9,1.5,3.4,3.4,3.4c1.9,0,3.4-1.5,3.4-3.4 \t\tC85.9,141.7,84.4,140.2,82.6,140.2z'/> \t<path style='fill:currentColor;' d='M61.1,103.3c-3.3,0-6,2.7-6,6s2.7,6,6,6h77.3c3.3,0,6-2.7,6-6s-2.7-6-6-6H61.1z'/> \t<path style='fill:currentColor;' d='M24.1,97.4h150.5c3.3,0,6-2.7,6-6V24.8c0-3.3-2.7-6-6-6H24.1c-3.3,0-6,2.7-6,6v66.6 \t\tC18.1,94.7,20.8,97.4,24.1,97.4z M30.1,30.8h138.5v54.6H30.1V30.8z'/> </g> </svg>"
    },
    "hsh-hall": {
        "keyWords": {
            "HU": [
                "előtér"
            ],
            "EN": [
                "hall"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-hall",
        "svg": "<svg version='1.1' id='eloszoba' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='kalap' style='fill:currentColor;' d='M168.5,85.2c0-0.4,0-0.8,0-1.2l0.2-30.9c0-0.9-0.2-1.8-0.6-2.6c-1.6-3.4-3.9-6.6-6.8-9.2 \tc-9.2-8.5-24.4-12.9-37-10.6c-7.7,1.3-12.1,4.7-15.3,7.1c-2.9,2.2-4.2,3.1-6.8,3.1c-2.3,0-3.2-0.7-5.7-2.7 \tc-2.7-2.2-6.5-5.2-13.3-6.9c-15.8-4-33.8,2.3-43.3,10.6C37,44.3,34.7,47,32.9,50c-0.6,0.9-0.8,2-0.9,3l-0.2,32.1 \tc-20.2,9.1-31.3,21.8-31.3,35.9c0,13.9,11,26.7,30.9,35.8C49.8,165.3,74.2,170,100,170c25.8,0,50.2-4.7,68.6-13.1 \tc19.9-9.1,30.9-21.8,30.9-35.8C199.5,107,188.5,94.4,168.5,85.2z M47.6,50.9c7.1-6.2,21.3-10.9,32.5-8c4.3,1.1,6.3,2.7,8.7,4.7 \tc2.9,2.3,6.5,5.2,13,5.4c6.9,0.1,11-3,14.3-5.5c2.8-2.2,5.3-4,10.1-4.9c8.9-1.6,20.4,1.7,26.8,7.6c1.4,1.3,2.6,2.8,3.5,4.4L156.5,84 \tc0,5.3,0,10.7-0.1,16.1v0.9c0,0.3,0,0.5,0.1,0.7c0,5.9,0,11.8-0.1,17.7c0,0,0,0,0,0c0,0,0,0,0,0c0,0.3,0,0.5,0.1,0.8 \tc0,0.2,0,0.3,0,0.5c0,0.1-0.1,0.2-0.2,0.3c0,0,0,0,0,0.1c0,0-0.1,0.1-0.1,0.1l-0.1,0.1c-0.1,0.1-0.2,0.2-0.3,0.3 \tc-0.1,0.1-0.2,0.1-0.2,0.2l-0.3,0.2c-0.2,0.1-0.3,0.2-0.5,0.3c-0.2,0.1-0.3,0.2-0.5,0.3c-0.2,0.1-0.4,0.2-0.6,0.3 \tc-0.1,0-0.1,0.1-0.2,0.1l-0.2,0.1c0,0,0,0,0,0l0,0c-0.1,0.1-0.2,0.1-0.3,0.2c-0.1,0-0.2,0.1-0.2,0.1c-0.8,0.4-1.7,0.8-2.7,1.3 \tc-0.1,0-0.2,0.1-0.3,0.1l-0.1,0c-0.1,0.1-0.3,0.1-0.4,0.2l-0.1,0.1c-0.1,0-0.2,0.1-0.2,0.1c-0.6,0.2-1.2,0.5-1.9,0.7l-1.4,0.4 \tc-1.3,0.4-2.8,0.8-3.9,1.1c-0.8,0.2-1.6,0.4-2.5,0.6c0,0-0.1,0-0.1,0c-0.7,0.2-1.3,0.3-2,0.4c0,0-0.1,0-0.1,0 \tc-0.4,0.1-0.8,0.2-1.2,0.3c-0.4,0.1-0.7,0.1-1.1,0.2c-0.4,0.1-0.9,0.2-1.3,0.2c0,0,0,0-0.1,0l-0.2,0c-0.3,0-0.5,0.1-0.8,0.1 \tc-0.3,0-0.5,0.1-0.8,0.1c-1.2,0.2-2.4,0.4-3.6,0.5c-0.5,0.1-1.1,0.2-1.6,0.2c-0.2,0-0.4,0-0.6,0.1c-1.3,0.2-2.7,0.3-4.1,0.5l-0.3,0 \tc-1.4,0.1-2.8,0.3-4.2,0.4c-0.8,0.1-1.6,0.1-2.5,0.2c-1.6,0.1-3.3,0.2-5,0.3c-0.1,0-0.2,0-0.4,0c0,0-0.1,0-0.1,0l-2.9,0.1 \tc-2.3,0.1-4.3,0.1-6.2,0.1c-1.8,0-3.8,0-5.9-0.1l-0.1,0c0,0,0,0,0,0c-0.6,0-1.1,0-1.7-0.1c-0.1,0-0.1,0-0.2,0 \tc-0.8,0-1.7-0.1-2.5-0.1c0,0-0.1,0-0.1,0c-1,0-1.9-0.1-2.7-0.2c0,0-0.1,0-0.1,0l-2.9-0.2c-1.4-0.1-2.8-0.2-4.3-0.4 \tc-1.5-0.1-2.9-0.3-4.3-0.5c-0.1,0-0.2,0-0.3,0c-1.2-0.2-2.4-0.3-3.5-0.5c-0.1,0-0.2,0-0.2,0c-2.5-0.4-4.7-0.8-6.8-1.2 \tc0,0-0.1,0-0.1,0c-0.5-0.1-1-0.2-1.5-0.3c0,0,0,0-0.1,0c-0.4-0.1-0.9-0.2-1.3-0.3c-0.1,0-0.1,0-0.2,0c-0.4-0.1-0.8-0.2-1.2-0.3 \tc-0.1,0-0.1,0-0.2,0c-0.3-0.1-0.6-0.2-1-0.2c-0.1,0-0.2-0.1-0.4-0.1c-0.3-0.1-0.5-0.1-0.8-0.2c-0.2,0-0.3-0.1-0.5-0.1 \tc-0.2-0.1-0.5-0.1-0.7-0.2c-0.2,0-0.3-0.1-0.5-0.1c-0.2-0.1-0.4-0.1-0.6-0.2c-0.2,0-0.3-0.1-0.5-0.1c-0.2-0.1-0.4-0.1-0.6-0.2 \tc-0.2-0.1-0.3-0.1-0.5-0.2c-0.2-0.1-0.3-0.1-0.5-0.2c-0.2-0.1-0.3-0.1-0.5-0.2c-0.1,0-0.3-0.1-0.4-0.1c-0.2-0.1-0.4-0.1-0.5-0.2 \tc-0.1,0-0.2-0.1-0.3-0.1c-0.2-0.1-0.4-0.1-0.6-0.2c-0.1,0-0.2-0.1-0.3-0.1c-0.2-0.1-0.4-0.1-0.5-0.2c-0.1,0-0.2-0.1-0.3-0.1 \tc-0.2-0.1-0.3-0.1-0.5-0.2c-0.1,0-0.2-0.1-0.2-0.1c-0.2-0.1-0.3-0.1-0.5-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.2-0.1-0.3-0.2-0.5-0.2 \tc0,0-0.1,0-0.1-0.1c-0.2-0.1-0.3-0.2-0.5-0.2c0,0-0.1,0-0.1-0.1c-0.1-0.1-0.3-0.2-0.4-0.2c0,0-0.1,0-0.1-0.1 \tc-0.1-0.1-0.3-0.2-0.4-0.2c0,0-0.1,0-0.1,0c-0.1-0.1-0.3-0.2-0.4-0.2c0,0,0,0-0.1,0c-0.1-0.1-0.2-0.2-0.3-0.2c0,0,0,0-0.1,0 \tc-0.1-0.1-0.2-0.1-0.3-0.2c0,0,0,0-0.1,0c-0.1-0.1-0.2-0.1-0.3-0.2c0,0,0,0,0,0c-0.1-0.1-0.2-0.1-0.2-0.2c0,0,0,0,0,0 \tc-0.1-0.1-0.1-0.1-0.2-0.2c0,0,0,0,0,0c-0.1-0.1-0.1-0.1-0.2-0.2c0,0,0,0,0,0c-0.1-0.1-0.1-0.1-0.1-0.1c0,0,0,0,0,0 \tc0,0-0.1-0.1-0.1-0.1c0,0,0,0,0,0c0,0,0-0.1-0.1-0.1l0.1-31.7c0-0.2,0-0.5,0-0.7L44,54.9C45,53.5,46.2,52.1,47.6,50.9z M163.6,146 \tc-16.9,7.7-39.5,12-63.6,12c-24.1,0-46.7-4.3-63.6-12c-15.2-7-23.9-16-23.9-24.9c0-8,6.9-16,19.2-22.5l0,2.4c0,0.3,0,0.7,0.1,1 \tl-0.1,19.1c0,0.4,0,0.8,0.1,1.2c1.2,11.8,20.9,17.2,37.6,19.7c0,0,0,0,0.1,0c0.1,0,0.3,0,0.4,0.1c0.1,0,0.1,0,0.2,0 \tc1.2,0.2,2.4,0.3,3.7,0.5c1.5,0.2,3,0.4,4.6,0.5c1.4,0.2,2.9,0.3,4.4,0.4c0,0,0,0,0.1,0c0,0,0,0,0,0c0,0,0,0,0.1,0l1.3,0.1 \tc0.6,0,1.1,0.1,1.7,0.1c0.3,0,0.7,0.1,1.1,0.1c0.1,0,0.3,0,0.4,0c0.5,0,1.1,0.1,1.7,0.1c0.9,0.1,1.8,0.1,2.8,0.1 \tc0.6,0,1.3,0,1.9,0.1l0.1,0c2.3,0.1,4.3,0.1,6.2,0.1c2,0,4.1,0,6.6-0.1l2.9-0.1c0.1,0,0.3,0,0.4,0c0,0,0.1,0,0.1,0c0,0,0,0,0,0 \tc0,0,0,0,0,0c0.1,0,0.1,0,0.2,0c1.6-0.1,3.3-0.2,5.1-0.3c0.9-0.1,1.8-0.1,2.7-0.2c1.5-0.1,3-0.3,4.5-0.4l0.5-0.1 \tc1.5-0.2,3-0.3,4.4-0.5c0,0,0,0,0,0c0,0,0,0,0,0c0,0,0,0,0.1,0c0.1,0,0.1,0,0.2,0c0.3,0,0.6-0.1,0.9-0.1c0.4-0.1,0.8-0.1,1.2-0.2 \tc1.3-0.2,2.5-0.4,3.7-0.6c0,0,0.1,0,0.1,0l0.7-0.1c0.3-0.1,0.7-0.1,1-0.2l0.2,0c0.4-0.1,0.8-0.2,1.2-0.2c0.1,0,0.1,0,0.2,0 \tc21.1-4,31.7-10.6,31.7-19.9c0-0.8-0.1-1.6-0.3-2.4c0-6.7,0-13.4,0.1-20c12.2,6.6,19.1,14.5,19.1,22.5 \tC187.5,129.9,178.8,139,163.6,146z'/> </svg>"
    },
    "hsh-login": {
        "keyWords": {
            "HU": [
                "bejelentkezés"
            ],
            "EN": [
                "login"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-login",
        "svg": "<svg id='login' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 170.5 199.63'><title>login</title><g id='lgin_shape'><ellipse cx='39.4' cy='62.67' rx='28.95' ry='26.8' style='fill:currentColor'/><path d='M93.89,121.68c0-15.11-15.58-27.47-34.67-27.47H49.36c-19.09,0-34.67,12.36-34.67,27.5V164h79.2Z' transform='translate(-14.69 -0.19)' style='fill:currentColor'/><path d='M179.74,5.68A18.56,18.56,0,0,0,166.51.19H97.76A18.71,18.71,0,0,0,79.07,18.88v2.83a6,6,0,1,0,12,0V18.88a6.7,6.7,0,0,1,6.69-6.69h68.75a6.69,6.69,0,0,1,6.69,6.7l-.41,161.91a6.7,6.7,0,0,1-6.65,6.67l-68.09.34a6.51,6.51,0,0,1-4.74-1.93,6.66,6.66,0,0,1-2-4.72v-.82a6,6,0,0,0-6-6h0a6,6,0,0,0-6,6v.82A18.68,18.68,0,0,0,98,199.81h.09l68.09-.34a18.74,18.74,0,0,0,18.59-18.64l.41-161.91A18.57,18.57,0,0,0,179.74,5.68Z' transform='translate(-14.69 -0.19)' style='fill:currentColor'/><path d='M107,50a6,6,0,0,0,6,6h28.68l-9,8.88a6,6,0,0,0,8.46,8.52l19.18-19a6,6,0,0,0,0-8.49l-19.1-19.23a6,6,0,1,0-8.51,8.45L141.6,44H113A6,6,0,0,0,107,50Z' transform='translate(-14.69 -0.19)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-logout": {
        "keyWords": {
            "HU": [
                "kijelentkezés"
            ],
            "EN": [
                "logout"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-logout",
        "svg": "<svg id='logout' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 170.5 199.63'><title>logout</title><g id='logout_shape'><ellipse cx='39.4' cy='62.67' rx='28.95' ry='26.8' style='fill:currentColor'/><path d='M93.89,121.68c0-15.11-15.58-27.47-34.67-27.47H49.36c-19.09,0-34.67,12.36-34.67,27.5V164h79.2Z' transform='translate(-14.69 -0.19)' style='fill:currentColor'/><path d='M179.74,5.68A18.56,18.56,0,0,0,166.51.19H97.76A18.71,18.71,0,0,0,79.07,18.88v2.83a6,6,0,1,0,12,0V18.88a6.7,6.7,0,0,1,6.69-6.69h68.75a6.69,6.69,0,0,1,6.69,6.7l-.41,161.91a6.7,6.7,0,0,1-6.65,6.67l-68.09.34a6.51,6.51,0,0,1-4.74-1.93,6.66,6.66,0,0,1-2-4.72v-.82a6,6,0,0,0-6-6h0a6,6,0,0,0-6,6v.82A18.68,18.68,0,0,0,98,199.81h.09l68.09-.34a18.74,18.74,0,0,0,18.59-18.64l.41-161.91A18.57,18.57,0,0,0,179.74,5.68Z' transform='translate(-14.69 -0.19)' style='fill:currentColor'/><path d='M136.29,26.64a6,6,0,0,0-8.49,0L108.71,45.9a6,6,0,0,0,0,8.49l19.18,19a6,6,0,0,0,8.46-8.52L127.43,56h28.68a6,6,0,0,0,0-12H127.48l8.84-8.91A6,6,0,0,0,136.29,26.64Z' transform='translate(-14.69 -0.19)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-magicstick": {
        "keyWords": {
            "HU": [
                "mágikus varázspálca"
            ],
            "EN": [
                "magic stick"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-magicstick",
        "svg": "<svg id='magicstick' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 193.04 195.9'><title>magic_stick</title><g id='magicstick_elem'><path d='M63.33,34.13h0a6,6,0,0,0,6-6L69.28,8a6,6,0,0,0-6-6h0a6,6,0,0,0-6,6l0,20.07A6,6,0,0,0,63.33,34.13Z' transform='translate(-3.48 -2.05)' style='fill:currentColor'/><path d='M35.56,62a6,6,0,0,0-6-6h0l-20.08.1a6,6,0,0,0,0,12h0L29.58,68A6,6,0,0,0,35.56,62Z' transform='translate(-3.48 -2.05)' style='fill:currentColor'/><path d='M87.31,44.12a6,6,0,0,0,4.24-1.76l14.21-14.18a6,6,0,1,0-8.48-8.49L83.07,33.87a6,6,0,0,0,4.24,10.25Z' transform='translate(-3.48 -2.05)' style='fill:currentColor'/><path d='M35.1,81.48,20.89,95.67a6,6,0,1,0,8.48,8.49L43.58,90a6,6,0,0,0-8.48-8.5Z' transform='translate(-3.48 -2.05)' style='fill:currentColor'/><path d='M29.48,19.62A6,6,0,1,0,21,28.12L35.22,42.3a6,6,0,1,0,8.47-8.49Z' transform='translate(-3.48 -2.05)' style='fill:currentColor'/><path d='M194.76,173.68,94.07,73a6.17,6.17,0,0,0-1.43-1.06L63,56.19a6,6,0,0,0-8.12,8.09L70.48,94a5.85,5.85,0,0,0,1.07,1.45l100.7,100.73a6,6,0,0,0,4.24,1.76h0a6,6,0,0,0,4.24-1.76l14-14A6,6,0,0,0,194.76,173.68Zm-18.27,9.78L80.68,87.62,74.52,75.87l11.7,6.2L182,177.92Z' transform='translate(-3.48 -2.05)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-menu": {
        "keyWords": {
            "HU": [
                "menü"
            ],
            "EN": [
                "menu"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-menu",
        "svg": "<svg version='1.1' id='menu' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <g id='lines'> \t<path style='fill:currentColor;' d='M16.1,30.6h167.8c4.4,0,8-3.6,8-8s-3.6-8-8-8H16.1c-4.4,0-8,3.6-8,8S11.7,30.6,16.1,30.6z'/> \t<path style='fill:currentColor;' d='M16.1,106.2h167.8c4.4,0,8-3.6,8-8s-3.6-8-8-8H16.1c-4.4,0-8,3.6-8,8S11.7,106.2,16.1,106.2z'/> \t<path style='fill:currentColor;' d='M183.9,169.4H16.1c-4.4,0-8,3.6-8,8s3.6,8,8,8h167.8c4.4,0,8-3.6,8-8S188.3,169.4,183.9,169.4z'/> </g> </svg>"
    },
    "hsh-microchip": {
        "keyWords": {
            "HU": [
                "microchip"
            ],
            "EN": [
                "microchip"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-microchip",
        "svg": "<svg id='microchip' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 183.75 182.27'><title>microchip</title><g id='microchip_elem'><path d='M185.81,104.21h0a6,6,0,0,0,0-12l-14.26,0V75.81l14.28,0h0a6,6,0,0,0,0-12l-14.31,0V34a6,6,0,0,0-6-6h-32V14.86a6,6,0,0,0-12,0V28H106.18V14.91a6,6,0,1,0-12,0V28H78.75V14.92a6,6,0,0,0-12,0V28H35.24a6,6,0,0,0-6,6V64.34l-15,0h0a6,6,0,0,0,0,12l15,0V92.71l-15,0h0a6,6,0,0,0,0,12l15.07,0V122l-15.1,0h0a6,6,0,0,0,0,12l15.13,0v30.32a6,6,0,0,0,6,6H66v14.78a6,6,0,0,0,12,0V170.36H93.42v14.77a6,6,0,0,0,12,0V170.36h15.44v14.72a6,6,0,0,0,12,0V170.36h32.72a6,6,0,0,0,6-6V133.51l14.17,0h0a6,6,0,0,0,0-12l-14.2,0V104.18Zm-58.66,54.15-.29,0-.29,0H41.24V128.13s0,0,0-.06,0,0,0-.06V98.8a.43.43,0,0,1,0,0s0,0,0-.07V70.43s0,0,0-.06,0,0,0-.06V40H72.11c.21,0,.42,0,.64,0s.42,0,.63,0H99.57a6.08,6.08,0,0,0,.61,0c.21,0,.41,0,.62,0h58.78V158.36Z' transform='translate(-8.12 -8.86)' style='fill:currentColor'/><path d='M135.42,60.15H64.78a4.5,4.5,0,0,0-4.5,4.5v70.64a4.51,4.51,0,0,0,4.5,4.5h70.64a4.5,4.5,0,0,0,4.5-4.5V64.65A4.49,4.49,0,0,0,135.42,60.15Zm-4.5,70.64H69.28V69.15h61.64Z' transform='translate(-8.12 -8.86)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-moon": {
        "keyWords": {
            "HU": [
                "hold"
            ],
            "EN": [
                "moon"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-moon",
        "svg": "<svg version='1.1' id='moon' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shape_x5F_m' style='fill:currentColor;' d='M188.9,158.6l0.1-0.1c0.1-0.1,0.1-0.2,0.2-0.4c0-0.1,0.1-0.2,0.1-0.2 \tc0-0.1,0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0.1-0.2,0.1-0.3s0-0.2,0.1-0.3c0-0.1,0-0.2,0-0.2c0-0.1,0-0.3,0-0.4c0-0.1,0-0.1,0-0.2 \tc0-0.4,0-0.8-0.1-1.2c0-0.1,0-0.2-0.1-0.3c0-0.1,0-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.4c0-0.1,0-0.1-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3 \ts-0.1-0.1-0.1-0.2c0-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2 \tc-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.2-0.2-0.4-0.4c0,0,0,0-0.1-0.1c-0.4-0.4-0.9-0.8-1.5-1H186 \tc-0.1-0.1-0.3-0.1-0.4-0.2c-0.1,0-0.1,0-0.2-0.1c-0.1,0-0.3-0.1-0.4-0.1c-0.1,0-0.2,0-0.2,0c-0.1,0-0.2-0.1-0.3-0.1s-0.2,0-0.3,0 \ts-0.2,0-0.2,0c-0.2,0-0.4,0-0.6,0c-11.2,0.5-22.3-1.3-32.8-5.4c-20.2-7.7-36.3-22.7-45.2-42.2c-8.9-19.4-9.7-41-2.1-60.8 \tc4.1-10.8,10.5-20.4,18.8-28.4l0,0c0.3-0.3,0.5-0.5,0.7-0.8c0,0,0-0.1,0.1-0.1c0.2-0.3,0.4-0.6,0.5-1c0,0,0,0,0-0.1 \tc0.1-0.3,0.2-0.7,0.3-1V9.6c0-0.2,0.1-0.4,0.1-0.7c0-0.1,0-0.2,0-0.4V8.4c0-0.4,0-0.7-0.1-1V7.3c-0.1-0.3-0.2-0.7-0.3-1V6.2 \tc-0.1-0.3-0.3-0.6-0.5-0.9c0,0,0-0.1-0.1-0.1c-0.2-0.3-0.4-0.6-0.7-0.9l0,0l0,0c-0.3-0.3-0.6-0.5-0.9-0.7l0,0 \tc-0.3-0.2-0.6-0.4-1-0.5l0,0c-0.3-0.1-0.7-0.2-1-0.3h-0.1c-0.2,0-0.4-0.1-0.7-0.1C74.6-1.5,33,24.1,17.4,65 \tC-1.7,115.2,24,172,74.7,191.4c11.5,4.4,23.4,6.5,35.2,6.5c30.3,0,59.8-13.9,78.6-38.8C188.6,158.9,188.8,158.8,188.9,158.6z \t M79,180.2c-44.6-17-67.2-66.9-50.3-111.1c12.2-31.9,42.4-53.2,76-54.9c-5.3,6.9-9.5,14.5-12.7,22.7c-8.7,22.8-7.9,47.7,2.4,70.1 \tc10.2,22.3,28.7,39.5,51.8,48.4c8,3,16.2,5,24.5,5.8C147.1,184.5,111,192.4,79,180.2z'/> </svg>"
    },
    "hsh-moon-cloud": {
        "keyWords": {
            "HU": [
                "hold"
            ],
            "EN": [
                "moon"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-moon-cloud",
        "svg": "<svg version='1.1' id='moon' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' y='0px' \t viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='shape_x5F_m' style='fill:currentColor;' d='M79.5,17.9c0-0.1,0-0.1,0-0.2s0-0.3-0.1-0.4c0-0.1-0.1-0.2-0.1-0.3 \tc0-0.1-0.1-0.3-0.1-0.4c-0.1-0.2-0.1-0.3-0.2-0.5c-0.1-0.2-0.2-0.3-0.3-0.5c-0.1-0.1-0.1-0.2-0.2-0.3s-0.1-0.2-0.2-0.3 \ts-0.2-0.3-0.3-0.4l-0.1-0.1c0,0,0,0-0.1,0c-0.1-0.1-0.2-0.2-0.3-0.3c0,0,0,0-0.1-0.1l0,0c-0.1-0.1-0.3-0.2-0.4-0.3 \tc0,0-0.1,0-0.1-0.1c-0.2-0.1-0.3-0.2-0.5-0.3l0,0c-0.2-0.1-0.3-0.2-0.5-0.3h-0.1h-0.1c-0.1,0-0.2-0.1-0.3-0.1h-0.1 \tc-0.1,0-0.3,0-0.5-0.1s-0.4-0.1-0.6-0.1C44,9.7,15.7,26.7,5.2,54.1C-4.6,79.7,3,108.3,24,126.7c1.2-4.1,3-8,5.2-11.5 \tC14,100.1,8.9,78.1,16.4,58.4c7.1-18.6,24.4-31.3,44.3-33.5c-2.4,3.6-4.4,7.5-6,11.6c-7.3,19.1-4.3,40.1,7.9,57 \tc0.3,0,0.6-0.1,0.9-0.1c0.6-5.1,2.1-10,4.2-14.6c-5.9-12-6.6-25.6-1.8-38.1c2.5-6.7,6.5-12.5,11.7-17.4l0.1-0.1l0.1-0.1 \tc0,0,0,0,0-0.1c0.1-0.1,0.2-0.2,0.3-0.3c0,0,0-0.1,0.1-0.1l0,0c0.1-0.1,0.2-0.3,0.3-0.4c0,0,0-0.1,0.1-0.1c0.1-0.2,0.2-0.3,0.3-0.5 \tl0,0c0.1-0.2,0.2-0.3,0.3-0.5c0,0,0-0.1,0.1-0.2c0-0.1,0.1-0.2,0.1-0.3v-0.1c0.1-0.2,0.1-0.4,0.1-0.6c0.1-0.4,0.1-0.8,0.1-1.2 \tC79.6,18.5,79.6,18.2,79.5,17.9z'/> <path id='shape_x5F_cl' style='fill:currentColor;' d='M157.4,93.3c-2.8-23.4-22.8-41.6-46.9-41.6c-24.2,0-44.1,18.2-46.9,41.6 \tc-23.4,2.9-41.6,22.8-41.6,47c0,26.1,21.2,47.3,47.3,47.3h0.1h82.4h0.1c26.1,0,47.3-21.2,47.3-47.3C199,116.1,180.8,96.2,157.4,93.3 \tz M151.8,175.5L151.8,175.5H69.2c0,0,0,0-0.1,0c-19.4,0-35.2-15.8-35.2-35.3c0-19.4,15.8-35.3,35.3-35.3c3.3,0,6-2.7,6-6 \tc0-19.4,15.8-35.3,35.3-35.3c19.4,0,35.3,15.8,35.3,35.3c0,3.3,2.7,6,6,6c19.4,0,35.3,15.8,35.3,35.3 \tC187,159.7,171.2,175.5,151.8,175.5z'/> </svg>"
    },
    "hsh-night-lamp": {
        "keyWords": {
            "HU": [
                "éjjeli lámpa"
            ],
            "EN": [
                "night light"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-night-lamp",
        "svg": "<svg version='1.1' id='night_x5F_lamp' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' x='0px' \t y='0px' viewBox='0 0 200 200' style='enable-background:new 0 0 200 200;' xml:space='preserve'> <path id='full_x5F_body' style='fill:currentColor;' d='M172.7,78.5L153.3,18c-3.4-10.7-13.8-17.8-25.7-17.8H74.3 \tc-11.7,0-21.9,6.9-25.5,17.2L27.6,77.9c-2.6,7.3-1.5,15.1,3,21.4c5,7,13.4,11.2,22.4,11.2h40v54H67.2c-9.7,0-17.6,7.9-17.6,17.6v0.1 \tc0,9.7,7.9,17.6,17.6,17.6h64.9c9.7,0,17.6-7.9,17.6-17.6v-0.1c0-9.7-7.9-17.6-17.6-17.6h-25.7v-54h35.5v9.3 \tc-6.2,2.1-10.8,8-10.8,14.9c0,8.7,7.1,15.8,15.8,15.8s15.8-7.1,15.8-15.8c0-6.9-4.5-12.8-10.8-14.9v-9.7c7-1.2,13.2-5,17.2-10.5 \tC173.7,93.4,175,85.7,172.7,78.5z M137.6,182.2v0.1c0,3.1-2.5,5.6-5.6,5.6H67.2c-3.1,0-5.6-2.5-5.6-5.6v-0.1c0-3.1,2.5-5.6,5.6-5.6 \tH99h1.4h31.7C135.2,176.6,137.6,179.1,137.6,182.2z M60.1,21.3c1.9-5.4,7.7-9.2,14.2-9.2h53.2c6.6,0,12.5,3.9,14.3,9.5l8.5,26.7 \tH50.7L60.1,21.3z M146.9,140.5c-3.2,0-5.8-2.6-5.8-5.8s2.6-5.8,5.8-5.8s5.8,2.6,5.8,5.8S150.1,140.5,146.9,140.5z M159.5,92.5 \tc-2.8,3.8-7.4,6-12.5,6H53.1c-5.2,0-9.9-2.3-12.6-6.2c-2.3-3.2-2.8-6.9-1.6-10.5l7.6-21.6h107.8l7,21.9 \tC162.4,85.7,161.7,89.4,159.5,92.5z'/> </svg>"
    },
    "hsh-notification": {
        "keyWords": {
            "HU": [
                "értesítések"
            ],
            "EN": [
                "notifications"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-notification",
        "svg": "<svg id='notification1' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 159.63 200'><title>notification1</title><g id='notification1_shape'><path d='M177.14,150.94c-4.56-4.57-8.76-8.72-12.85-12.71-6-5.83-6.45-19.54-6.78-29.55,0-1.5-.09-2.94-.16-4.29-.17-3.74-.08-7.56,0-11.61.19-8.49.39-17.28-1.87-25.87a59,59,0,0,0-18.9-30.42,59.34,59.34,0,0,0-22.26-11.34V12.37A12.38,12.38,0,0,0,102,0H93.81A12.39,12.39,0,0,0,81.44,12.37V25.86A58.52,58.52,0,0,0,61.58,36.48a59.07,59.07,0,0,0-18.9,30.43c-2.26,8.59-2.06,17.38-1.87,25.87.09,4,.18,7.87,0,11.6-.06,1.36-.11,2.8-.16,4.3-.33,10-.78,23.72-6.79,29.56-4,3.94-8.24,8.1-12.84,12.7a6,6,0,0,0-1.76,4.24v15a6,6,0,0,0,6,6H172.9a6,6,0,0,0,6-6v-15A6,6,0,0,0,177.14,150.94ZM166.9,164.22H31.27v-6.55c3.88-3.88,7.49-7.44,11-10.84,9.47-9.2,10-25.7,10.41-37.75.05-1.45.1-2.84.16-4.15.18-4.14.09-8.35,0-12.42-.19-8-.36-15.59,1.47-22.55,2.54-9.64,8-18.47,15-24.23a47.4,47.4,0,0,1,19.53-9.44l.16,0,.38-.1.22-.08.32-.13.26-.13.26-.13.27-.17.21-.13.28-.21.18-.14.25-.23.18-.17.21-.23.18-.21a1.88,1.88,0,0,0,.16-.23l.18-.25a2.39,2.39,0,0,0,.13-.21l.16-.29.11-.22.14-.3a2.41,2.41,0,0,0,.08-.25,2.64,2.64,0,0,0,.1-.3,2.45,2.45,0,0,0,.08-.29c0-.09,0-.17.06-.27l.06-.35c0-.07,0-.15,0-.22a2.82,2.82,0,0,0,0-.41.76.76,0,0,0,0-.15v-.12h0v-18a.38.38,0,0,1,.37-.37H102a.36.36,0,0,1,.36.37V30c0,.14,0,.27,0,.4s0,.14,0,.21,0,.24,0,.36,0,.16,0,.23a2.81,2.81,0,0,0,.08.31c0,.09,0,.18.08.27a2.67,2.67,0,0,0,.09.26c0,.1.07.2.11.29a2.4,2.4,0,0,1,.11.23l.15.29.13.22.17.27c.05.08.12.15.17.23l.17.22L104,34l.16.17.27.25.16.13.29.23.17.12.3.18.21.12.27.13c.09,0,.18.09.27.12a2.34,2.34,0,0,0,.24.09l.33.11a1.41,1.41,0,0,0,.22.06l.37.09h.06a47.56,47.56,0,0,1,21.67,9.88c7,5.76,12.41,14.59,14.95,24.23,1.83,7,1.66,14.53,1.47,22.55-.09,4.07-.18,8.28,0,12.42,0,1.31.1,2.7.15,4.15.4,12,.94,28.55,10.4,37.75,3.51,3.42,7.12,7,11,10.84Z' transform='translate(-19.27)' style='fill:currentColor'/><path d='M97.85,188c-4.43,0-8-3.15-8-7h-12c0,10.49,9,19,20,19s20-8.54,20-19h-12C105.87,184.85,102.27,188,97.85,188Z' transform='translate(-19.27)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-notification-filled": {
        "keyWords": {
            "HU": [
                "értesítések"
            ],
            "EN": [
                "notifications"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-notification-filled",
        "svg": "<svg id='notification2' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 159.63 200'><title>notification2</title><g id='notifi2_shape'><path d='M177.14,151.16c-4.56-4.57-8.76-8.72-12.85-12.71-6-5.83-6.45-19.54-6.78-29.55,0-1.5-.09-2.94-.16-4.29-.17-3.74-.08-7.56,0-11.61.19-8.49.39-17.28-1.87-25.87a59,59,0,0,0-18.9-30.42,59.34,59.34,0,0,0-22.26-11.34,59.88,59.88,0,0,0-12-1.44l-8.89.27a80.07,80.07,0,0,0-12,1.88A58.52,58.52,0,0,0,61.58,36.7a59.07,59.07,0,0,0-18.9,30.43C40.42,75.72,40.62,84.51,40.81,93c.09,4,.18,7.87,0,11.6-.06,1.36-.11,2.8-.16,4.3-.33,10-.78,23.72-6.79,29.56-4,3.94-8.24,8.1-12.84,12.7a6,6,0,0,0-1.76,4.24v15a6,6,0,0,0,6,6H172.9a6,6,0,0,0,6-6v-15A6,6,0,0,0,177.14,151.16Z' transform='translate(-19.27 -0.22)' style='fill:currentColor'/><path d='M93.44,21.6v-9a.38.38,0,0,1,.37-.37H102a.36.36,0,0,1,.36.37v8.74h.06a61.32,61.32,0,0,1,11.94,1.39V12.59A12.38,12.38,0,0,0,102,.22H93.81A12.39,12.39,0,0,0,81.44,12.59V23.42A84.49,84.49,0,0,1,93.38,21.6Z' transform='translate(-19.27 -0.22)' style='fill:currentColor'/><path d='M97.85,188.22c-4.43,0-8-3.15-8-7h-12c0,10.49,9,19,20,19s20-8.54,20-19h-12C105.87,185.07,102.27,188.22,97.85,188.22Z' transform='translate(-19.27 -0.22)' style='fill:currentColor'/><path d='M81.44,23.42l-.23.06h.23Z' transform='translate(-19.27 -0.22)' style='fill:currentColor'/><path d='M114.56,22.77l-.23-.05v.05Z' transform='translate(-19.27 -0.22)' style='fill:currentColor'/></g></svg>"
    },
    "hsh-copy": {
        "keyWords": {
            "HU": [
                "másolás"
            ],
            "EN": [
                "copy"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-copy",
        "svg": "<svg  version=\"1.1\" id=\"copy\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <g id=\"shape_x5F_copy\"> \t<path style=\"fill:currentColor;\" d=\"M154.2,142.5H93.4c-3.3,0-6,2.7-6,6s2.7,6,6,6h60.8c3.3,0,6-2.7,6-6S157.5,142.5,154.2,142.5z\"></path> \t<path style=\"fill:currentColor;\" d=\"M154.2,117.3H93.4c-3.3,0-6,2.7-6,6s2.7,6,6,6h60.8c3.3,0,6-2.7,6-6S157.5,117.3,154.2,117.3z\"></path> \t<path style=\"fill:currentColor;\" d=\"M87.4,96.1c0,3.3,2.7,6,6,6h60.8c3.3,0,6-2.7,6-6s-2.7-6-6-6H93.4C90.1,90.1,87.4,92.8,87.4,96.1z\"></path> \t<path style=\"fill:currentColor;\" d=\"M181.3,61.9l-33.6-21.5c-1-0.6-2.1-0.9-3.2-0.9h-12.7V27.8c0-2-1-3.9-2.8-5.1L95.4,1.2 \t\tc-1-0.6-2.1-0.9-3.2-0.9h-71c-3.3,0-6,2.7-6,6v147.6c0,3.3,2.7,6,6,6h46.3V193c0,3.3,2.7,6,6,6h104.6c3.3,0,6-2.7,6-6V67 \t\tC184.1,64.9,183,63,181.3,61.9z M67.4,45.4v5.5H41.1c-3.3,0-6,2.7-6,6s2.7,6,6,6h26.3v15.3H41.1c-3.3,0-6,2.7-6,6s2.7,6,6,6h26.3 \t\tv13.2H41.1c-3.3,0-6,2.7-6,6s2.7,6,6,6h26.3v32.5H27.1V12.3h63.2l18,11.5H94.4v-4.9c0-2.2-1.8-4-4-4s-4,1.8-4,4v8.9 \t\tc0,2.2,1.8,4,4,4h29.3v7.6H73.4C70.1,39.4,67.4,42.1,67.4,45.4z M172.1,187H79.4v-33.2V51.4h46.3h16.9l18,11.5h-13.9v-4.9 \t\tc0-2.2-1.8-4-4-4s-4,1.8-4,4V67c0,2.2,1.8,4,4,4h29.3V187z\"></path> </g> </svg>"
    },
    "hsh-histeresys": {
        "keyWords": {
            "HU": [
                "hiszterézis"
            ],
            "EN": [
                "histeresys"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-histeresys",
        "svg": "<svg  version=\"1.1\" id=\"hiszterezis\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <g id=\"shape_x5F_hiszterezis\"> \t<path style=\"fill:currentColor;\" d=\"M148.6,0.3H50.9C23.1,0.3,0.5,22.9,0.5,50.6v97.8c0,27.8,22.6,50.3,50.4,50.3h97.8 \t\tc27.8,0,50.4-22.6,50.4-50.3V50.6C199,22.9,176.4,0.3,148.6,0.3z M187,148.4c0,21.2-17.2,38.3-38.4,38.3H50.9 \t\tc-21.2,0-38.4-17.2-38.4-38.3V50.6c0-21.2,17.2-38.4,38.4-38.4h97.8c21.1,0,38.4,17.2,38.4,38.4V148.4z\"></path> \t<path style=\"fill:currentColor;\" d=\"M91.1,137.1l6.8,2.2c-0.7,1-1.4,1.8-2.2,2.6c-11.5,12.1-29.6,15.9-42.7,17 \t\tc22.6-21.4,30.9-47.7,36.7-66c1-3.2-0.8-6.5-3.9-7.5c-3.2-1-6.5,0.8-7.5,3.9c-6.7,21.3-15.9,50.4-45.7,70.7c-2.1,1.4-3.1,4-2.4,6.4 \t\tc0.6,2.4,2.7,4.2,5.2,4.5c0.5,0,3.8,0.4,9,0.4c14.4,0,42.6-2.6,60.2-21.1c1.9-2,3.7-4.4,5.4-7.1l11,3.5l-6.6-30.4L91.1,137.1z\"></path> \t<path style=\"fill:currentColor;\" d=\"M164.2,30.7c-1.9,0-47.6-0.6-68.5,20.6c-1.3,1.3-2.5,2.8-3.7,4.4L80.2,52l4.3,18.7l1,4.5l1.7,7.1 \t\tl5.4-5c0,0,0,0,0,0l3.3-3.1l14.1-13.2l-5.4-1.7c9-8.9,24.5-13.1,37.5-15c-18.1,17-25.1,41.1-30.9,61.3l-0.5,1.6 \t\tc-0.9,3.2,0.9,6.5,4.1,7.4c0.6,0.2,1.1,0.2,1.7,0.2c2.6,0,5-1.7,5.8-4.3l0.5-1.6c7.3-25.2,15.5-53.8,44-66.9 \t\tc2.5-1.2,3.9-3.9,3.4-6.7C169.4,32.7,167,30.7,164.2,30.7z\"></path> </g> </svg>"
    },
    "hsh-other": {
        "keyWords": {
            "HU": [
                "egyéb"
            ],
            "EN": [
                "other"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-other",
        "svg": "<svg  version=\"1.1\" id=\"other_x5F_place\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <g id=\"shape_x5F_otherplace\"> \t<path style=\"fill:currentColor;\" d=\"M100.3,0.2c-55,0-99.7,44.7-99.7,99.7s44.7,99.7,99.7,99.7c55,0,99.7-44.7,99.7-99.7 \t\tS155.3,0.2,100.3,0.2z M100.3,189.6c-49.5,0-89.8-40.3-89.8-89.8c0-49.5,40.3-89.8,89.8-89.8s89.8,40.3,89.8,89.8 \t\tC190.1,149.4,149.8,189.6,100.3,189.6z\"></path> \t<path style=\"fill:currentColor;\" d=\"M130.7,49.8H70c-10.8,0-19.7,8.8-19.7,19.7v60.8c0,10.8,8.8,19.7,19.7,19.7h60.8 \t\tc10.8,0,19.7-8.8,19.7-19.7V69.5C150.4,58.7,141.6,49.8,130.7,49.8z M138.5,130.3c0,4.3-3.5,7.8-7.8,7.8H70c-4.3,0-7.8-3.5-7.8-7.8 \t\tV69.5c0-4.3,3.5-7.8,7.8-7.8h60.8c4.3,0,7.8,3.5,7.8,7.8V130.3z\"></path> \t<circle style=\"fill:currentColor;\" cx=\"100.3\" cy=\"99.9\" r=\"10.3\"></circle> \t<path style=\"fill:currentColor;\" d=\"M75.3,89.7c-5.6,0-10.2,4.6-10.2,10.2c0,5.6,4.6,10.2,10.2,10.2c5.6,0,10.2-4.6,10.2-10.2 \t\tC85.5,94.3,80.9,89.7,75.3,89.7z\"></path> \t \t\t<ellipse transform=\"matrix(0.9999 -1.561895e-02 1.561895e-02 0.9999 -1.5457 1.9753)\" style=\"fill:currentColor;\" cx=\"125.7\" cy=\"99.9\" rx=\"10.2\" ry=\"10.2\"></ellipse> </g> </svg>"
    },
    "hsh-paper-plane": {
        "keyWords": {
            "HU": [
                "papír repülő",
                "papír",
                "repülő"
            ],
            "EN": [
                "paper plane",
                "paper",
                "plane"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-paper-plane",
        "svg": "<svg  version=\"1.1\" id=\"paper_x5F_airplane\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"shape_x5F_airplane\" style=\"fill:currentColor;\" d=\"M190.1,5.2c-1.8-1.6-4.4-2-6.6-1L10.8,86.7c-1.8,0.9-3.1,2.6-3.4,4.6 \tc-0.3,2,0.4,4,1.9,5.3l35.3,31.8V172c0,2.4,1.5,4.6,3.7,5.6c0.7,0.3,1.5,0.4,2.3,0.4c1.6,0,3.1-0.6,4.3-1.8l20-20.5l43.2,38.9 \tc1.1,1,2.5,1.5,4,1.5c0.5,0,1-0.1,1.5-0.2c1.9-0.5,3.5-1.9,4.2-3.8l63.9-180.4C192.6,9.4,191.9,6.8,190.1,5.2z M56.6,134.4 \tC56.7,134.4,56.7,134.4,56.6,134.4c0.5,0.3,0.9,0.5,1.4,0.8c0.1,0,0.1,0.1,0.2,0.1c0.2,0.1,0.3,0.2,0.5,0.3l6.2,5.6 \tc0.2,0.2,0.3,0.4,0.5,0.6c0,0.1,0.1,0.1,0.1,0.2c0.4,0.5,0.7,1.1,1.1,1.6c0.1,0.1,0.1,0.2,0.2,0.3c0.3,0.6,0.6,1.2,0.9,1.8 \tc0,0,0,0.1,0.1,0.2l-11.1,11.4V134.4z M119.5,179.6l-36.7-33.1l59.1-78.8c1.8-2.4,1.6-5.7-0.5-7.8c-2.1-2.1-5.4-2.4-7.8-0.7 \tL51.1,118L24,93.6l151.6-72.3L119.5,179.6z\"></path> </svg>"
    },
    "hsh-recycle": {
        "keyWords": {
            "HU": [
                "újrahasznosítás"
            ],
            "EN": [
                "recycle"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-recycle",
        "svg": "<svg  version=\"1.1\" id=\"recycle\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <g id=\"shape_x5F_recycle\"> \t<path style=\"fill:currentColor;\" d=\"M195.3,149.4l-28-48.5c0,0,0-0.1-0.1-0.1c-3-5.1-9.7-6.9-14.8-3.9c-5.2,3-7,9.7-4,14.9l7.3,12.6 \t\tl14.5,25.1l5.5,9.4l8.2,14.1c0.9,1.6,1.5,3.4,1.9,5.4c3.3-1.7,6.3-4.3,8-7.2l1.7-2.9C198.3,163.1,198.3,154.6,195.3,149.4z\"></path> \t<path style=\"fill:currentColor;\" d=\"M171.5,158.9l-23.5,0l0-10.8l-37.6,21.7l37.6,21.7l0-10.8l29.3,0c1.6,0,3.3-0.3,4.9-0.8 \t\tc-0.3-1.8-0.8-3.6-1.6-5L171.5,158.9z\"></path> \t<path style=\"fill:currentColor;\" d=\"M79.1,159l-14.5,0l-28.9,0l-10.9,0l-16.3,0c-1.8,0-3.7-0.4-5.6-1.1c-0.2,3.8,0.6,7.6,2.2,10.5 \t\tl1.7,2.9c3,5.2,10.3,9.4,16.3,9.4l56,0c0,0,0.1,0,0.1,0c5.9-0.1,10.8-4.9,10.8-10.9C90,163.9,85.1,159,79.1,159z\"></path> \t<path style=\"fill:currentColor;\" d=\"M26.8,155.3L38.5,135l9.4,5.4l0-43.4l-37.6,21.7l9.4,5.4L5,149.5c-0.8,1.4-1.4,3-1.7,4.7 \t\tc1.7,0.7,3.5,1.1,5.1,1.1L26.8,155.3z\"></path> \t<path style=\"fill:currentColor;\" d=\"M111.9,8.6c-3.2-2-6.9-3.3-10.2-3.3h-3.4c-6,0-13.3,4.2-16.3,9.4l-28,48.5c0,0,0,0.1-0.1,0.1 \t\tc-2.9,5.2-1.1,11.8,4,14.8c5.2,3,11.9,1.2,14.9-4l7.3-12.6l14.5-25.1L100,27l8.2-14.1C109.1,11.3,110.4,9.8,111.9,8.6z\"></path> \t<path style=\"fill:currentColor;\" d=\"M142.1,78.1V34.7l-9.4,5.4L118,14.7c-0.8-1.4-1.9-2.7-3.2-3.8c-1.5,1.1-2.7,2.5-3.5,3.8l-9.2,16 \t\tL113.9,51l-9.4,5.4L142.1,78.1z\"></path> </g> </svg>"
    },
    "hsh-delete-big": {
        "keyWords": {
            "HU": [
                "nagy kuka",
                "kuka",
                "szemetes",
                "szemét"
            ],
            "EN": [
                "big trash",
                "trash",
                "garbage"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-delete-big",
        "svg": "<svg  version=\"1.1\" id=\"very_x5F_big_x5F_trash\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <g id=\"very_x5F_big_x5F_shape\"> \t<circle style=\"fill:currentColor;\" cx=\"153\" cy=\"191\" r=\"9\"></circle> \t \t\t<ellipse transform=\"matrix(0.9732 -0.2298 0.2298 0.9732 -42.533 16.6852)\" style=\"fill:currentColor;\" cx=\"50.4\" cy=\"191\" rx=\"9\" ry=\"9\"></ellipse> \t<path style=\"fill:currentColor;\" d=\"M12.3,36.1H188c2.6,0,4.9-1.7,5.7-4.1c0.8-2.5-0.1-5.2-2.2-6.7c-14.3-10.4-29.1-18.4-43.9-23.7 \t\tc0,0-0.1,0-0.1,0c-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.2,0-0.2-0.1c-0.1,0-0.2,0-0.3-0.1c-0.1,0-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0 \t\tc-0.1,0-0.2,0-0.4,0c0,0-0.1,0-0.1,0H53.2c0,0-0.1,0-0.1,0c-0.1,0-0.3,0-0.4,0c-0.1,0-0.2,0-0.2,0c-0.1,0-0.2,0-0.3,0 \t\tc-0.1,0-0.2,0-0.3,0.1c-0.1,0-0.2,0-0.2,0.1c-0.1,0-0.2,0.1-0.4,0.1c0,0-0.1,0-0.1,0C24.9,11.1,9,25,8.3,25.6 \t\tc-1.9,1.7-2.5,4.3-1.6,6.6C7.6,34.6,9.8,36.1,12.3,36.1z M54.3,13.2h90.1c7.8,2.9,15.6,6.5,23.3,10.9H31.3 \t\tC37.4,20.5,45.2,16.6,54.3,13.2z\"></path> \t<path style=\"fill:currentColor;\" d=\"M187.9,46.3H12.1c-1.8,0-3.5,0.8-4.7,2.2c-1.1,1.4-1.6,3.3-1.2,5L32,174.2c0.6,2.8,3,4.7,5.9,4.7 \t\tl124.1,0c2.8,0,5.3-2,5.9-4.7l25.8-120.6c0.4-1.8-0.1-3.6-1.2-5C191.4,47.1,189.7,46.3,187.9,46.3z M157.2,166.9l-114.4,0 \t\tL19.5,58.3h160.9L157.2,166.9z\"></path> \t<path style=\"fill:currentColor;\" d=\"M123.4,122.3l6,10.5l2.3,3.9l3.4,5.9c0.4,0.6,0.6,1.4,0.8,2.2c1.4-0.7,2.6-1.8,3.3-3l0.7-1.2 \t\tc1.3-2.2,1.3-5.7,0-7.9l-11.7-20.3c0,0,0,0,0,0c-1.3-2.1-4-2.9-6.2-1.6c-2.2,1.2-2.9,4-1.7,6.2L123.4,122.3z\"></path> \t<path style=\"fill:currentColor;\" d=\"M129.9,136.7l-9.8,0l0-4.5l-15.7,9.1l15.7,9.1l0-4.5l12.3,0c0.7,0,1.4-0.1,2.1-0.4 \t\tc-0.1-0.8-0.3-1.5-0.7-2.1L129.9,136.7z\"></path> \t<path style=\"fill:currentColor;\" d=\"M61,141.9c1.3,2.2,4.3,3.9,6.8,3.9l23.4,0c0,0,0,0,0.1,0c2.5,0,4.5-2.1,4.5-4.6c0-2.5-2-4.5-4.6-4.5 \t\tl-6.1,0l-12.1,0l-4.6,0l-6.8,0c-0.8,0-1.5-0.2-2.3-0.4c-0.1,1.6,0.2,3.2,0.9,4.4L61,141.9z\"></path> \t<path style=\"fill:currentColor;\" d=\"M69.5,135.2l4.9-8.5l3.9,2.3l0-18.2l-15.7,9.1l3.9,2.3l-6.1,10.6c-0.3,0.6-0.6,1.2-0.7,2 \t\tc0.7,0.3,1.5,0.5,2.1,0.5L69.5,135.2z\"></path> \t<path style=\"fill:currentColor;\" d=\"M82.5,102.9c2.2,1.3,5,0.5,6.2-1.7l3-5.3l6.1-10.5l2.3-3.9l3.4-5.9c0.4-0.7,0.9-1.3,1.5-1.8 \t\tc-1.3-0.8-2.9-1.4-4.3-1.4h-1.4c-2.5,0-5.6,1.8-6.8,3.9L80.8,96.7c0,0,0,0,0,0C79.6,98.9,80.3,101.7,82.5,102.9z\"></path> \t<path style=\"fill:currentColor;\" d=\"M100.9,83.1l4.9,8.5l-3.9,2.3l15.7,9.1V84.8l-3.9,2.3l-6.1-10.6c-0.3-0.6-0.8-1.1-1.3-1.6 \t\tc-0.6,0.5-1.1,1-1.5,1.6L100.9,83.1z\"></path> </g> </svg>"
    },
    "hsh-cookie": {
        "keyWords": {
            "HU": [
                "süti"
            ],
            "EN": [
                "cookie"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-cookie",
        "svg": "<svg  version=\"1.1\" id=\"cookie\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <g id=\"shape_x5F_cookie\"> \t<path style=\"fill:currentColor;\" d=\"M154,0H45.6C20.4,0-0.1,20.5-0.1,45.7v108.4c0,25.2,20.5,45.7,45.7,45.7H154 \t\tc25.2,0,45.7-20.5,45.7-45.7V45.7C199.7,20.5,179.2,0,154,0z M188.4,154.1c0,18.9-15.4,34.4-34.4,34.4H45.6 \t\tc-18.9,0-34.4-15.4-34.4-34.4V45.7c0-18.9,15.4-34.4,34.4-34.4H154c18.9,0,34.4,15.4,34.4,34.4V154.1z\"></path> \t<path style=\"fill:currentColor;\" d=\"M112,86c-7.3,0-13.3,6-13.3,13.3c0,7.3,6,13.3,13.3,13.3c7.3,0,13.3-6,13.3-13.3 \t\tC125.2,91.9,119.3,86,112,86z\"></path> \t<path style=\"fill:currentColor;\" d=\"M76.1,104.2c-8.4,0-15.2,6.8-15.2,15.2s6.8,15.2,15.2,15.2c8.4,0,15.2-6.8,15.2-15.2 \t\tS84.5,104.2,76.1,104.2z\"></path> \t<path style=\"fill:currentColor;\" d=\"M76.1,87.1c6,0,10.9-4.9,10.9-10.9c0-6-4.9-10.9-10.9-10.9c-6,0-10.9,4.9-10.9,10.9 \t\tC65.3,82.2,70.2,87.1,76.1,87.1z\"></path> \t<path style=\"fill:currentColor;\" d=\"M165.1,99.8c0-1.7-0.1-3.4-0.2-5.1c0,0,0-0.1,0-0.1c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3 \t\tc0,0,0-0.1,0-0.1c0-0.1,0-0.1,0-0.2c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.2 \t\tc0-0.1-0.1-0.2-0.1-0.2c0-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2 \t\tc-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.2-0.2-0.2-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.3-0.2 \t\tc-0.1,0-0.1-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.3-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.1-0.1-0.2-0.1 \t\tc-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.1-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.1,0-0.2-0.1c-0.1,0-0.2,0-0.3-0.1 \t\tc-0.1,0-0.1,0-0.2,0c-0.1,0-0.2,0-0.4,0c-0.1,0-0.1,0-0.2,0c-0.1,0-0.2,0-0.4,0c-0.1,0-0.1,0-0.1,0c0,0,0,0-0.1,0 \t\tc-0.1,0-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0c0,0-0.1,0-0.1,0c-0.7,0.1-1.4,0.2-2.1,0.2c-5.5,0-10-4.5-10-10c0-3.8,2.1-7.2,5.4-8.9 \t\tc0.2-0.1,0.4-0.2,0.6-0.4c0,0,0,0,0,0c0,0,0,0,0,0c0.3-0.2,0.5-0.4,0.8-0.7c0,0,0.1-0.1,0.1-0.1c0.2-0.2,0.4-0.5,0.6-0.8 \t\tc0,0,0-0.1,0.1-0.1c0.2-0.3,0.3-0.6,0.4-0.9c0,0,0-0.1,0-0.1c0.1-0.3,0.2-0.6,0.3-0.9c0,0,0-0.1,0-0.1c0.1-0.3,0.1-0.6,0.1-1 \t\tc0,0,0-0.1,0-0.1c0-0.3,0-0.6-0.1-1c0,0,0-0.1,0-0.1c-0.1-0.3-0.2-0.6-0.3-0.9c0,0,0-0.1-0.1-0.1c0-0.1-0.1-0.2-0.1-0.3 \t\tc-0.1-0.2-0.2-0.4-0.4-0.6c0,0,0,0,0,0c-4.4-6.3-9.8-11.8-16.1-16.3c0,0,0,0,0,0c-0.1,0-0.1-0.1-0.2-0.1c0,0,0,0-0.1,0 \t\tc-0.2-0.2-0.5-0.3-0.7-0.4c-0.1,0-0.1,0-0.2-0.1c0,0-0.1,0-0.1-0.1c-0.3-0.1-0.6-0.2-0.9-0.3c0,0-0.1,0-0.1,0 \t\tc-0.3-0.1-0.6-0.1-1-0.1c0,0-0.1,0-0.1,0c-0.3,0-0.6,0-1,0.1c0,0-0.1,0-0.1,0c-0.3,0.1-0.6,0.1-0.9,0.3c0,0-0.1,0-0.1,0.1 \t\tc-0.3,0.1-0.6,0.3-0.8,0.4c0,0-0.1,0.1-0.1,0.1c-0.3,0.2-0.5,0.4-0.8,0.6c0,0-0.1,0.1-0.1,0.1c-0.2,0.2-0.5,0.5-0.7,0.8 \t\tc0,0,0,0,0,0c0,0,0,0,0,0.1c-0.1,0.2-0.3,0.4-0.4,0.7c-2.1,4.3-6.4,7-11.3,7c-6.9,0-12.6-5.6-12.6-12.6c0-0.6,0-1.2,0.1-1.9 \t\tc0,0,0-0.1,0-0.1c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0,0,0-0.1,0-0.1c0,0,0-0.1,0-0.1c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.2 \t\tc0-0.1,0-0.2-0.1-0.3c0-0.1,0-0.2-0.1-0.2c0-0.1,0-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3 \t\tc0-0.1-0.1-0.1-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2 \t\tc-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2 \t\tc-0.1-0.1-0.2-0.1-0.2-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.2-0.1 \t\tc-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.2-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.2,0-0.2-0.1c-0.1,0-0.2,0-0.3-0.1 \t\tc0,0-0.1,0-0.1,0c0,0-0.1,0-0.1,0c-0.1,0-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0c0,0-0.1,0-0.1,0c0,0,0,0,0,0c-0.1,0-0.2,0-0.3,0 \t\tc0,0,0,0,0,0c-35.7,0.3-64.7,29.5-64.7,65.3c0,36,29.3,65.3,65.3,65.3c12.7,0,25.1-3.7,35.7-10.6c0,0,0,0,0,0c0,0,0,0,0,0 \t\tc0.3-0.2,0.6-0.4,0.8-0.6c0,0,0,0,0,0c0,0,0,0,0,0c0.3-0.3,0.5-0.5,0.7-0.8c0,0,0,0,0,0c0.2-0.3,0.4-0.6,0.5-0.9c0,0,0,0,0,0 \t\tc0.1-0.3,0.2-0.7,0.3-1c0,0,0,0,0,0c0.1-0.3,0.1-0.7,0.1-1.1c0,0,0,0,0,0c0-0.4,0-0.7-0.1-1.1c0,0,0,0,0,0c-0.1-0.3-0.2-0.7-0.3-1 \t\tc0,0,0,0,0,0c-0.1-0.3-0.3-0.6-0.5-0.9c0,0,0-0.1,0-0.1c0,0,0,0,0,0c-0.2-0.3-0.4-0.6-0.7-0.8c0,0,0,0,0,0 \t\tc-3.1-3.2-4.8-7.3-4.8-11.7c0-9.3,7.6-16.9,16.9-16.9c2.4,0,4.7,0.5,6.9,1.5c0,0,0.1,0,0.1,0c0.1,0.1,0.3,0.1,0.4,0.2 \t\tc0.2,0.1,0.3,0.1,0.5,0.1c0,0,0.1,0,0.1,0c0,0,0,0,0,0c0.2,0,0.4,0.1,0.6,0.1c0,0,0.1,0,0.1,0c0.2,0,0.3,0,0.5,0c0,0,0,0,0.1,0 \t\tc0,0,0.1,0,0.1,0c0.3,0,0.6,0,0.9-0.1c0,0,0,0,0,0c0.3,0,0.5-0.1,0.8-0.2c0,0,0.1,0,0.1,0c0.3-0.1,0.5-0.2,0.7-0.3 \t\tc0,0,0.1,0,0.1-0.1c0.2-0.1,0.5-0.3,0.7-0.5c0,0,0,0,0.1-0.1c0.2-0.2,0.4-0.4,0.6-0.6c0,0,0,0,0.1-0.1c0.2-0.2,0.3-0.4,0.5-0.6 \t\tc0-0.1,0.1-0.1,0.1-0.2c0.1-0.2,0.3-0.4,0.4-0.7c0,0,0,0,0-0.1c0,0,0-0.1,0.1-0.1c0.1-0.3,0.2-0.5,0.3-0.8c0,0,0,0,0,0c0,0,0,0,0,0 \t\tc0,0,0-0.1,0-0.1C164.5,109.8,165.1,104.8,165.1,99.8z M120.5,134c0,5,1.3,9.8,3.7,14c-7.5,3.8-15.8,5.8-24.4,5.8 \t\tc-29.8,0-54-24.2-54-54c0-27.7,21.1-50.7,48.1-53.7c1.6,11.6,11.6,20.6,23.6,20.6c6.8,0,13.2-2.8,17.6-7.7c2.1,1.8,4,3.7,5.7,5.8 \t\tc-3.9,3.9-6.2,9.3-6.2,15c0,11,8.4,20.1,19.1,21.2c0,1.7-0.1,3.5-0.4,5.2c-1.6-0.3-3.1-0.4-4.8-0.4 \t\tC133.1,105.8,120.5,118.5,120.5,134z\"></path> </g> </svg>"
    },
    "hsh-office": {
        "keyWords": {
            "HU": [
                "iroda",
                "dolgozó szoba"
            ],
            "EN": [
                "office"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-office",
        "svg": "<svg  version=\"1.1\" id=\"office\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"shape_x5F_workingtable\" style=\"fill:currentColor;\" d=\"M194.2,86.4h-21.5c0-0.1,0-0.1,0-0.2c0-3.3-2.7-6-6-6h-8.4 \tc-3.3,0-6,2.7-6,6c0,0.1,0,0.1,0,0.2h-29.1c-0.2,0-0.4,0-0.6-0.1c0.3-0.7,0.4-1.5,0.4-2.3c0-3.3-2.7-6-6-6h-10.6V59.2h29 \tc3.3,0,6-2.7,6-6V5.8c0-3.3-2.7-6-6-6H64.9c-3.3,0-6,2.7-6,6v47.5c0,3.3,2.7,6,6,6h29.6v18.8h-46c-3.3,0-6,2.7-6,6 \tc0,0.8,0.2,1.6,0.5,2.3h-6.6C35.7,86.2,35,86,34.2,86s-1.4,0.1-2.1,0.4H6.7c-3.3,0-6,2.7-6,6v25c0,0,0,0,0,0s0,0,0,0v76.4 \tc0,3.3,2.7,6,6,6l27.5,0c0,0,0,0,0,0c3.3,0,6-2.7,6-6l0-70.5h76.2v70.5c0,1.6,0.6,3.1,1.8,4.2c1.1,1.1,2.7,1.8,4.2,1.8l71.8,0 \tc3.3,0,6-2.7,6-6V92.4C200.2,89.1,197.5,86.4,194.2,86.4z M70.9,11.8h58.7v35.5H70.9V11.8z M128.4,123.4l59.8-0.1v25.8l-59.8,0.1 \tV123.4z M188.2,98.4v12.9l-65.7,0.1c0,0,0,0-0.1,0c0,0,0,0-0.1,0H34.3c0,0,0,0-0.1,0c0,0,0,0,0,0c0,0,0,0-0.1,0H12.7v-13H188.2z \t M28.2,187.8l-15.5,0v-64.4h15.5L28.2,187.8z M128.4,187.8v-26.7l59.8-0.1v26.7L128.4,187.8z\"></path> </svg>"
    },
    "hsh-chart-bar": {
        "keyWords": {
            "HU": [
                "grafikon"
            ],
            "EN": [
                "graph"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-chart-bar",
        "svg": "<svg  version=\"1.1\" id=\"grafikon2\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <polygon id=\"axis2\" style=\"fill:currentColor;\" points=\"16.3,160 16.3,28.9 0.3,28.9 0.3,176 192.1,176 192.1,160 \"></polygon> <g id=\"lines2\"> \t<rect x=\"94.9\" y=\"55.2\" style=\"fill:currentColor;\" width=\"16\" height=\"89.8\"></rect> \t \t\t<rect x=\"103.3\" y=\"97.7\" transform=\"matrix(5.859274e-03 -1 1 5.859274e-03 35.9911 247.6474)\" style=\"fill:currentColor;\" width=\"78.5\" height=\"16\"></rect> \t \t\t<rect x=\"47.5\" y=\"121.2\" transform=\"matrix(1.464865e-02 -0.9999 0.9999 1.464865e-02 -66.9208 190.5799)\" style=\"fill:currentColor;\" width=\"31.5\" height=\"16\"></rect> \t<rect x=\"174.7\" y=\"28.9\" style=\"fill:currentColor;\" width=\"16\" height=\"116.1\"></rect> </g> </svg>"
    },
    "hsh-thumbs-up": {
        "keyWords": {
            "HU": [
                "hüvelykujj fel"
            ],
            "EN": [
                "thumbs up"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-thumbs-up",
        "svg": "<svg  version=\"1.1\" id=\"like_x5F_lines\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"shape_x5F_likel\" style=\"fill:currentColor;\" d=\"M200,126l0-3c0-5.2-2.1-10.1-5.5-13.5c-1.2-1.2-2.5-2.1-3.9-2.8 \tc0.9-2.4,1.3-5.1,1.3-8l0-3c-0.1-10.1-6-17.9-13.5-17.9c0,0-0.1,0-0.1,0L150.5,78l-40-0.1c2.1-20.2,2.7-36.3,2.8-37.9 \tc0.6-8.6,0.9-21.2-4-30.9c-3.3-6.6-9.2-9.9-15.6-8.9c-8.1,1.3-15.5,9.2-16.9,18.1c-0.3,1.8-0.5,3.6-0.8,5.4 \tc-1,7.2-1.9,13.9-4.7,20.2c-2.6,5.8-6.1,11.2-9.7,16.9c-1.1,1.8-2.3,3.6-3.4,5.3l-4.8,7.7H8.2c-3.3,0-6,2.7-6,6v113.2 \tc0,3.3,2.7,6,6,6h46.2c3.3,0,6-2.7,6-6v-8.3c9.3,7,20.1,11.8,31.9,14.2c0,0,0,0,0,0c0.4,0.1,0.8,0.1,1.2,0.1c0.1,0,0.2,0,0.4,0 \tl73.6-0.8c8-0.1,14.3-8.1,14.2-18.2l0-3c0-2.2-0.4-4.3-1-6.3c6.5-1.5,11.3-8.8,11.3-17.8l0-3c0-2.7-0.5-5.2-1.3-7.5 \tC196.2,139.8,200.1,133.4,200,126z M48.3,187.2H14.2V85.9h34.2V187.2z M167.3,186.3L94,187.2c-13-2.7-24.6-9-33.7-18.2V85.5l8-12.9 \tc1.1-1.7,2.2-3.5,3.3-5.2c3.7-5.8,7.6-11.9,10.6-18.5c3.5-7.8,4.6-15.8,5.7-23.4c0.2-1.7,0.5-3.5,0.8-5.2c0.6-4,4.3-7.7,6.9-8.1 \tc0.5-0.1,1.7-0.3,3,2.5c3.6,7.1,3.3,17.5,2.8,24.7c0,0.1,0,0.2,0,0.2c0,0.2-0.7,20-3.4,43.7c0,0,0,0,0,0c0,0.1,0,0.3,0,0.4 \tc0,0.1,0,0.1,0,0.2c0,0,0,0,0,0c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0,0.3c0,0.1,0,0.2,0.1,0.3 \tc0,0.1,0,0.2,0.1,0.3c0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.1,0.1,0.2c0,0.1,0.1,0.2,0.1,0.3c0,0.1,0.1,0.1,0.1,0.2 \tc0.1,0.1,0.1,0.2,0.2,0.3c0,0.1,0.1,0.1,0.1,0.2c0.1,0.1,0.1,0.2,0.2,0.3c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2 \tc0.1,0.1,0.1,0.2,0.2,0.2c0.1,0.1,0.1,0.1,0.2,0.2c0.1,0.1,0.2,0.2,0.3,0.2c0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.2,0.3,0.2 \tc0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.2c0.1,0,0.1,0.1,0.2,0.1c0.1,0.1,0.2,0.1,0.3,0.2c0.1,0,0.1,0.1,0.2,0.1 \tc0.1,0,0.2,0.1,0.3,0.1c0.1,0,0.2,0,0.3,0.1c0.1,0,0.2,0.1,0.3,0.1c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0,0,0,0,0,0 \tc0.2,0,0.4,0,0.5,0c0,0,0.1,0,0.1,0c0,0,0,0,0,0l46.7,0.1l27.4-0.3c0.6,0.5,1.8,2.6,1.9,6l0,3c0,3.5-1.2,5.5-1.8,6.1l-19.8,0.2 \tc-3.3,0-6,2.8-5.9,6.1c0,0.6,0.1,1.2,0.3,1.8c0.7,2.6,3,4.6,5.9,4.5l25.6-0.3c0.8,0,1.4,0.5,1.9,0.9c1.2,1.2,1.9,3.1,1.9,5.1l0,3 \tc0,3.4-2,6.1-3.7,6.1l-6.1,0.1c0,0,0,0,0,0l-18.4,0.2c-3.3,0-6,2.8-5.9,6.1c0,2.8,2,5.2,4.7,5.8c0,0,0.1,0,0.1,0c0.1,0,0.2,0,0.3,0 \tc0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0.1,0,0.2,0,0.3,0c0,0,0,0,0.1,0l17.9-0.2c0.7,0.5,2,2.6,2,6l0,3c0,3.4-1.3,5.6-1.9,6 \tl-6.2,0.1l-4.6,0c0,0,0,0,0,0l-19,0.2c-3.3,0-6,2.8-5.9,6.1c0,3.3,2.7,5.9,6,5.9c0,0,0,0,0.1,0l18.8-0.2c0,0,0,0,0,0l0,0 \tc0.6,0.2,2.4,2.2,2.4,6l0,3C169.7,184.1,167.9,186.2,167.3,186.3z\"></path> </svg>"
    },
    "hsh-thumbs-down": {
        "keyWords": {
            "HU": [
                "hüvelykujj le"
            ],
            "EN": [
                "thumbs down"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-thumbs-down",
        "svg": "<svg  version=\"1.1\" id=\"dislike_x5F_lines2\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" x=\"0px\" y=\"0px\" viewBox=\"0 0 200 200\" style=\"enable-background:new 0 0 200 200;\" xml:space=\"preserve\"> <path id=\"dislike_x5F_lines2_1_\" style=\"fill:currentColor;\" d=\"M2.2,73.3l0,3c0,5.2,2.1,10.1,5.5,13.5c1.2,1.2,2.5,2.1,3.9,2.8 \tc-0.9,2.4-1.3,5.1-1.3,8l0,3c0.1,10.1,6,17.9,13.5,17.9c0,0,0.1,0,0.1,0l27.7-0.3l40,0.1c-2.1,20.2-2.7,36.3-2.8,37.9 \tc-0.6,8.6-0.9,21.2,4,30.9c3.3,6.6,9.2,9.9,15.6,8.9c8.1-1.3,15.5-9.2,16.9-18.1c0.3-1.8,0.5-3.6,0.8-5.4c1-7.2,1.9-13.9,4.7-20.2 \tc2.6-5.8,6.1-11.2,9.7-16.9c1.1-1.8,2.3-3.6,3.4-5.3l4.8-7.7H194c3.3,0,6-2.7,6-6V6.1c0-3.3-2.7-6-6-6l-46.2,0c-3.3,0-6,2.7-6,6v8.3 \tc-9.3-7-20.1-11.8-31.9-14.2c0,0,0,0,0,0c-0.4-0.1-0.8-0.1-1.2-0.1c-0.1,0-0.2,0-0.4,0L34.7,0.9C26.7,1,20.4,8.9,20.5,19l0,3 \tc0,2.2,0.4,4.3,1,6.3c-6.5,1.5-11.3,8.8-11.3,17.8l0,3c0,2.7,0.5,5.2,1.3,7.5C6,59.4,2.1,65.9,2.2,73.3z M153.9,12.1H188v101.2 \th-34.2V12.1z M34.8,12.9l73.3-0.8c13,2.7,24.6,9,33.7,18.2v83.5l-8,12.9c-1.1,1.7-2.2,3.5-3.3,5.2c-3.7,5.8-7.6,11.9-10.6,18.5 \tc-3.5,7.8-4.6,15.8-5.7,23.4c-0.2,1.7-0.5,3.5-0.8,5.2c-0.6,4-4.3,7.7-6.9,8.1c-0.5,0.1-1.7,0.3-3-2.5c-3.6-7.1-3.3-17.5-2.8-24.7 \tc0-0.1,0-0.2,0-0.2c0-0.2,0.7-20,3.4-43.7c0,0,0,0,0,0c0-0.1,0-0.3,0-0.4c0-0.1,0-0.1,0-0.2c0,0,0,0,0,0c0-0.1,0-0.2,0-0.3 \tc0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2,0-0.3c0-0.1,0-0.2-0.1-0.3c0-0.1,0-0.2-0.1-0.3c0-0.1-0.1-0.2-0.1-0.3 \tc0-0.1-0.1-0.1-0.1-0.2c0-0.1-0.1-0.2-0.1-0.3c0-0.1-0.1-0.1-0.1-0.2c-0.1-0.1-0.1-0.2-0.2-0.3c0-0.1-0.1-0.1-0.1-0.2 \tc-0.1-0.1-0.1-0.2-0.2-0.3c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2c-0.1-0.1-0.1-0.2-0.2-0.2c-0.1-0.1-0.1-0.1-0.2-0.2 \tc-0.1-0.1-0.2-0.2-0.3-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.1-0.1-0.2-0.2-0.3-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.3-0.2 \tc-0.1,0-0.1-0.1-0.2-0.1c-0.1-0.1-0.2-0.1-0.3-0.2c-0.1,0-0.1-0.1-0.2-0.1c-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.2,0-0.3-0.1 \tc-0.1,0-0.2-0.1-0.3-0.1c-0.1,0-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0c0,0,0,0,0,0c-0.2,0-0.4,0-0.5,0c0,0-0.1,0-0.1,0c0,0,0,0,0,0 \tl-46.7-0.1l-27.4,0.3c-0.6-0.5-1.8-2.6-1.9-6l0-3c0-3.5,1.2-5.5,1.8-6.1l19.8-0.2c3.3,0,6-2.8,5.9-6.1c0-0.6-0.1-1.2-0.3-1.8 \tc-0.7-2.6-3-4.6-5.9-4.5l-25.6,0.3c-0.8,0-1.4-0.5-1.9-0.9c-1.2-1.2-1.9-3.1-1.9-5.1l0-3c0-3.4,2-6.1,3.7-6.1l6.1-0.1c0,0,0,0,0,0 \tl18.4-0.2c3.3,0,6-2.8,5.9-6.1c0-2.8-2-5.2-4.7-5.8c0,0-0.1,0-0.1,0c-0.1,0-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0c-0.1,0-0.2,0-0.3,0 \tc-0.1,0-0.2,0-0.3,0c0,0,0,0-0.1,0L24.3,55c-0.7-0.5-2-2.6-2-6l0-3c0-3.4,1.3-5.6,1.9-6l6.2-0.1l4.6,0c0,0,0,0,0,0l19-0.2 \tc3.3,0,6-2.8,5.9-6.1c0-3.3-2.7-5.9-6-5.9c0,0,0,0-0.1,0L35,27.9c0,0,0,0,0,0l0,0c-0.6-0.2-2.4-2.2-2.4-6l0-3 \tC32.5,15.1,34.3,13,34.8,12.9z\"></path> </svg>"
    },
    "hsh-github": {
        "keyWords": {
            "HU": [
                "Github"
            ],
            "EN": [
                "Github"
            ],
            "DE": [],
            "RO": []
        },
        "iconClass": "hsh-github",
        "svg": "<svg viewBox=\"0 0 1792 1792\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M896 128q209 0 385.5 103t279.5 279.5 103 385.5q0 251-146.5 451.5t-378.5 277.5q-27 5-40-7t-13-30q0-3 .5-76.5t.5-134.5q0-97-52-142 57-6 102.5-18t94-39 81-66.5 53-105 20.5-150.5q0-119-79-206 37-91-8-204-28-9-81 11t-92 44l-38 24q-93-26-192-26t-192 26q-16-11-42.5-27t-83.5-38.5-85-13.5q-45 113-8 204-79 87-79 206 0 85 20.5 150t52.5 105 80.5 67 94 39 102.5 18q-39 36-49 103-21 10-45 15t-57 5-65.5-21.5-55.5-62.5q-19-32-48.5-52t-49.5-24l-20-3q-21 0-29 4.5t-5 11.5 9 14 13 12l7 5q22 10 43.5 38t31.5 51l10 23q13 38 44 61.5t67 30 69.5 7 55.5-3.5l23-4q0 38 .5 88.5t.5 54.5q0 18-13 30t-40 7q-232-77-378.5-277.5t-146.5-451.5q0-209 103-385.5t279.5-279.5 385.5-103zm-477 1103q3-7-7-12-10-3-13 2-3 7 7 12 9 6 13-2zm31 34q7-5-2-16-10-9-16-3-7 5 2 16 10 10 16 3zm30 45q9-7 0-19-8-13-17-6-9 5 0 18t17 7zm42 42q8-8-4-19-12-12-20-3-9 8 4 19 12 12 20 3zm57 25q3-11-13-16-15-4-19 7t13 15q15 6 19-6zm63 5q0-13-17-11-16 0-16 11 0 13 17 11 16 0 16-11zm58-10q-2-11-18-9-16 3-14 15t18 8 14-14z\"/></svg>"
    }
};